{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Web-Design-and-Development-Academic-Part-Time-Undergraduate-Intern_R4412",
    "id": "837830523910100156d55829010b0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><h1>Job Details</h1><p>Join DesignLab at NASA’s Jet Propulsion Laboratory, and shape the web products we create in support of our community and of our mandate to explore Earth, our solar system, and the universe.</p><p></p><p>Our web and graphics team seeks a Web Intern to contribute to the production and maintenance of a variety of websites, platforms, and products. They will report to the Web Design and Development Manager and develop solutions in support of Laboratory and NASA programs and goals, including Mars Public Engagement content.</p><p></p><p>Because our mission attracts brilliant minds from all over the world, and from all backgrounds, you must be able to approach each individual and situation with an empathetic heart, an open mind, and a commitment to careful listening. Inclusion is a core value at JPL. The Lab depends on our internal communications team to reflect the range of lived experiences among our approximately 10,000 colleagues.</p><p></p><h2>Job Description:</h2><ul><li>Materially contribute to web projects including updating and maintaining website content and web applications.</li><li>Use content management systems to post and maintain accessible content</li><li>Assist in gathering and analyzing site metrics</li><li>Participate in developing or enhancing site features using MySQL databases, server side scripting (ColdFusion, PHP, Python, Ruby, JavaScript, etc.), and/or JavaScript libraries and frameworks</li><li>Participate in the creation or light editing of communication products for general audiences including content for internal and external websites or social media sites</li><li>Troubleshoot, diagnose and resolve application issues</li></ul><h2>Skills and Experience:</h2><ul><li>Some familiarity with using and maintaining content management systems</li><li>Some familiarity in Python (Django, Wagtail), PHP (WordPress, Drupal), JavaScript (Node, Vue, React, Angular), CSS, HTML</li><li>Some familiarity with web accessibility (WCAG 2.1, 508 compliance)</li><li>Proficient with Microsoft Office (Word, Excel, PowerPoint, Outlook).</li><li>Some familiarity with DevOps (preferred), AWS</li><li>Graphic design aptitude, knowledge of Photoshop, Illustrator, Premier, Figma (preferred)</li><li>Punctual, detail oriented, resourceful, and self-motivated</li><li>Strong communication skills and ability to effectively communicate with non-technical stakeholders</li><li>Knowledge and understanding of principles, theories, concepts and techniques in web design and development</li></ul><h2>Qualifications and requirements:</h2><ul><li>Must be currently enrolled at least half-time at an accredited college or university pursuing a Bachelor’s degree in Computer Science, Information Systems or related discipline with a graduation date of December 2023 or later</li><li>Must be able to work a minimum of 10 hours per week during school year, with up to 40 hours per week during the summer</li><li>Minimum GPA 3.0</li><li>Completed coursework with exposure to standard principles, theories, concepts and techniques in web design, support, and development</li><li>Prefer Sophomore or Junior</li><li>Prior internship experience in related programming and/or information technology areas</li><li>Participation in student organizations</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $16.11 as a freshman, $19 as a sophomore, $22 as a junior, $25 as a senior.</p><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Web-Design-and-Development-Academic-Part-Time-Undergraduate-Intern_R4412",
    "jobReqId": "R4412",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Yesterday",
    "startDate": "2023-06-07",
    "timeType": "Part time",
    "title": "Web Design and Development Academic Part-Time Undergraduate Intern"
  },
  "userAuthenticated": false
}
