{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Medium-Duty-Driver-II_R4360",
    "id": "7887ef81446a10011fa88b0fa2d80001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>In this role, you will <span>drive buses, forklifts, and other equipment to transport equipment, materials, and personnel</span>. You will do the following:</p><ul><li><p><span>Transport equipment, materials, and personnel to various locations on and off the Laboratory</span>.</p></li><li><p>Apply advanced knowledge of transport services to convey passengers, material and/or equipment; estimate time of arrival to destination.</p></li><li><p>Transport heavier items; will assist with transport of critical items (e.g., flight hardware).</p></li><li><p>Conduct routine vehicle checks prior to use, monitors performance of vehicles, repairs, fuels vehicles, and/or loads and unloads items.</p></li><li><p>Identify less obvious vehicle issues.</p></li><li><p>Record deliveries and other activities via scanner and other devices.</p></li><li><p>Troubleshoot basic issues (e.g., badge scanner not at the delivery site).</p></li><li><p><span>Perform work in accordance with Institute and regulatory agencies, safety standards, and industry and Laboratory best practices.</span></p></li></ul><p></p><p><b><span>Qualifications:</span></b></p><ul><li><p>Typically requires a High School diploma with a minimum of 6 years of related work experience; or a Associate&#39;s degree with a minimum of 1 year related experience; related required training.</p></li><li><p>Demonstrated experience operating a bus and passenger shuttle.</p></li><li><p>Experience with passenger transport (e.g., airport shuttle, student transport, city bus Operations) with ADA wheelchair lift training.</p></li><li><p>Maintains valid California Commercial driver’s license (Class B) to drive large vehicles with a gross weight rating of 26,000 pounds or more.</p></li><li><p>Maintains passenger endorsement to drive buses and other personnel transportation vehicles.</p></li><li><p>Maintains air brakes endorsement, hazardous endorsement, medical endorsement, and valid forklift certification for transportation duties.</p></li><li><p>Clean driving record.</p></li><li><p>Related required training (Safety, Hazmat, PPE).</p></li><li><p>Familiarity with inventory scanners and similar data collection devices.</p></li><li><p>Ability to use a computer, smart phones, GPS, etc.</p></li><li><p>Excellent verbal communication and customer service skills.</p></li></ul><p></p><p><b><span>******IMPORTANT******</span></b></p><p>This position, because of its associated job duties, has been determined by JPL to be safety-sensitive as defined in JPL’s Drug-Free Workplace Requirement.  An employee holding this position will be subject to periodic, unannounced, random drug testing.  Please refer to JPL’s Drug-Free Workplace Requirement for more information.  Candidates who are hired into designated safety-sensitive positions will be included in a pool from which individuals are randomly selected to participate in the unannounced drug testing.</p><p></p><p>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$47,112 - $61,672<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Medium-Duty-Driver-II_R4360",
    "jobReqId": "R4360",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "startDate": "2023-05-24",
    "timeType": "Full time",
    "title": "Medium Duty Driver II"
  },
  "userAuthenticated": false
}
