{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technologist-II_R4149",
    "id": "e69c71fb5b7e100159b0a7218cc10000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Tracking Systems and Application Section provides world-leading capability and expertise in a wide range of technologies that are critical to spacecraft tracking and related applications. The Section undertakes precise orbit determination (POD) of low Earth orbiter (LEO) missions using GNSS and other data, calibration and validation of NASA’s satellite altimeter missions supports NASA&#39;s deep-space missions by providing to the JPL navigators with unique and extremely precise radiometric sources and data types. The Section provides the Deep Space Network (DSN) with precision atomic frequency and time references and distribution systems. The Section also delivers to JPL navigators a host of other products that are required for deep space navigation such as celestial and terrestrial reference frame coordinates, Earth orientation parameters, and calibrations to account for the effects of the Earth&#39;s troposphere and ionosphere on radiofrequency metric tracking data-types.</p><p></p><p>For terrestrial and near-Earth users, the Section offers the highest accuracy Global Navigation Satellite System (GNSS)-based positioning and timing products and services. The Section also performs extensive scientific investigations using its technologies in the areas of terrestrial reference frames, planetary dynamics, astrophysics, astrometry and radio astronomy, gravitational waves, geophysics, and fundamental physics.</p><p></p><p><b><u>Responsibilities:</u></b></p><p>As a<b> Research Technologist</b> in the Near-Earth Tracking Applications (NETA) Group undertaking cutting-edge research and development related to precise orbit determination (POD) for a variety of Earth orbiting satellites as well as GNSS-based positioning of fixed and moving in-situ platforms (e.g., airplanes, boats, buoys, fixed stations). The satellites include both NASA and non-NASA supported satellite altimeter missions such as the Jason series (-1,-2,-3), Sentinel 3A/3B, Sentinel-6, SWOT, and CRISTAL. In this role the responsibilities include:</p><ul><li><p>Involvement with other aspects of calibration and validation of these altimetry missions, particularly those that relate to validation of the positioning estimates for both the orbiting satellites and in-situ platforms.</p></li><li><p>Contributing to research of the terrestrial reference frame using multi-technique geodetic tracking data.</p></li><li><p>Leading or contributing to publications in the peer-reviewed literature, as well as presentations at professional society and altimetry mission science team meetings.</p></li><li><p>Using skills in Python and C&#43;&#43; to develop new, or maintain existing precise orbit determination or in-situ positioning data analysis software.</p></li><li><p>Contributing to satellite altimeter measurement system calibration and validation tools.</p></li></ul><p></p><p>The NETA group performs cutting edge satellite altimetry calibration and validation in support of NASA’s satellite altimeter missions, as well as advanced research and applications in GNSS positioning and signal analysis. Come and join our dynamic team!</p><p></p><p><b><u>Qualifications:</u></b></p><ul><li><p>Bachelors degree in Engineering, Math, Physics, or related technical discipline with typically a minimum of 3 years of related experience; Masters degree in similar disciplines with a minimum of 1 year of related experience; or PhD in similar disciplines.</p></li><li><p>Broad knowledge in one or more of the following related fields: numerical analysis, data analysis, mathematical modeling, estimation theory, Kalman filtering, probability/statistics, linear algebra, large dataset analysis.</p></li><li><p>Proven ability to work independently and exercise independent judgment to evaluate various approaches and resources to accomplish assignments.</p></li></ul><ul><li><p>Extensive knowledge of applicable industry and/or academic practices and standards in Python and/or C&#43;&#43; programming languages.</p></li></ul><p></p><p><b><u>Preferred Skills:</u></b></p><ul><li><p>Extensive experience in applying the principles, theories, concepts and techniques in precise orbit determination of Earth-orbiting satellites.</p></li><li><p>Experience performing calibration and validation in satellite altimetry.</p></li><li><p>Experience developing data analysis software packages and analyzing global data sets.</p></li><li><p>Excellent oral and written communication skills.</p></li><li><p>Experience working in large teams.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$75,608 - $114,816<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Technologist-II_R4149",
    "jobReqId": "R4149",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 2 Days Ago",
    "startDate": "2023-03-29",
    "timeType": "Full time",
    "title": "Technologist II"
  },
  "userAuthenticated": false
}
