{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-Engineer-Part-Time-Graduate-Intern_R4323",
    "id": "129f4f4c50e9100116cd26fea5b90000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Application Consulting, Development and Engineering Section under the Information and Technology Solutions Directorate (ITSD) has a part-time opportunity for graduate student to join the team. As a JPL Academic Part-Time (APX), you can work full time in the Summer months and work part-time when university classes are in session. The graduate student will join and contribute to a technical team using agile development methodologies in order to write, test, and deploy data intensive applications, and provide supporting documentation and/or procedures for development and operations. </p><p><span> </span></p><p><span>This part-time student will also have the opportunity to gain hands-on IT experience in some of the following ways:</span></p><ul><li><p><span>Assist with the gathering of business requirements, design, development and testing of applications</span></p></li><li><p><span>Under supervision, perform research and conduct experiments on selected technology-oriented topics.</span></p></li><li><p><span>As a Systems Engineer Intern your task is to look at a system, or subsystem, and identify the requirements for and from it, make sure it meets those requirements, make sure it is built to those requirements, make sure it is integrated to those requirements, and make sure it operates to those requirements. </span></p></li><li><p><span>You will be the voice of the system throughout the product development life cycle, providing critical thinking about tradeoffs and compromises, about generalists view of the system versus specialist view.  </span></p></li><li><p><span>You will be helping in getting the right design for our customers and relay it to the Application Development team. </span></p></li><li><p><span>Help in developing prototypes and storyboards to validate user requirements</span></p></li><li><p><span>Help in leading design effort; establish design patterns and rules; research and apply best industry practices. </span></p></li><li><p><span>Serve as a liaison to the customer throughout the entire system life cycle; advice customer and management</span></p></li><li><p><span>Assist with the evaluation, modification and improvements to the testing processes and results for software systems and subsystems that have substantial impact.</span></p></li><li><p><span>Develop diagrams, workflows, and high-level architecture and integration diagrams</span></p></li></ul><p></p><p>Qualifications </p><ul><li><p><span>Enrolled in a graduate degree program studying computer science, software engineering, computer engineering, systems engineering or related major with a minimum cumulative GPA of a 3.0.</span></p></li><li><p><span>Must be enrolled in school full time in the next Semester or Quarter</span></p></li><li><p><span>Knowledge of the principles of collaborative software engineering and software development lifecycle</span></p></li><li><p><span>Completed coursework with exposure to standard principles, theories, concepts and techniques in computer science, information systems, software engineering or computer engineering</span></p></li><li><p><span>Strong analytical skills</span></p></li></ul><ul><li><p><span>Strong oral and written communication skills</span></p></li><li><p><span>Superior organization skills</span></p></li><li><p><span>Team player with strong collaboration skills</span></p></li><li><p><span>Participation in student/volunteer organizations</span></p></li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $36 in year 1, $38 in year 2, $41 in year 3, $43 in year 4</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Software-Engineer-Part-Time-Graduate-Intern_R4323",
    "jobReqId": "R4323",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 4 Days Ago",
    "startDate": "2023-06-20",
    "timeType": "Part time",
    "title": "Software System Engineer Part-Time Graduate Intern"
  },
  "userAuthenticated": false
}
