{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Research-Scientist-II--TMS_R4771",
    "id": "4112b9df97be1001b669d85651e30000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>With an unmatched history creating groundbreaking advances in science and technology, JPL has been in the space exploration business since the beginning. Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>We resonate with people who are looking for ways to go further and offer an opportunity to be part of a team of passionate and dedicated engineers working with some of the world’s best capabilities and cutting-edge technology in science, technology, and engineering. We offer a comprehensive benefits plan, tuition reimbursement, and generous Caltech retirement contributions.</p><p></p><p>The Radar Science and Engineering Section in the Communications, Tracking, and Radar Division conducts research, development, and flight mission development in the field of airborne and spaceborne remote sensing radar for NASA and other government agencies. This section specializes in systems and techniques related to synthetic aperture radar (SAR) imaging, radar interferometry, altimetry, subsurface sounders, scatterometry and atmospheric radars (clouds and precipitation, dynamics, and gaseous species). The section is also a leader in planetary landing radars. Our radar program focuses on Earth and planetary science missions, with emphasis on first-of-a-kind radar systems and cutting-edge technology.</p><p></p><p><b><u>Responsibilities</u></b></p><p></p><p>We invite you to join the Radar Science and Engineering Section within the Radar Science Group (334H) to serve as a Temporary Research Scientist II. You will report administratively to the Group Supervisor of the Radar Science Group.</p><p></p><p>The Radar Science Group helps provide the scientific motivations, data-interpretation algorithms, applications, and science-driven design specifications for the radars developed by the Radar Science and Engineering section at JPL. The group&#39;s principal tasks include designing observation strategies using radars and justifying the radar instrument requirements to meet quantitative scientific goals, developing the physical and mathematical algorithms to reach these goals using the radar data that is collected, and carrying out scientific research (including analysis and prediction) using the data from these algorithms. Our projects include analysis, research, design, development, test, and validation (including calibration) of radar processing algorithms and implementations for scatterometers, atmospheric profiling radars, sounders, synthetic aperture radars, and radar-interferometry observation strategies. We also use data from space-borne radars and other instruments to characterize, understand, and try to improve the predictability of a very broad range of atmospheric, surface, and solid earth phenomena.</p><p>Topics of on-going projects include tracking and understanding sea ice morphology and kinematics, improving the mesoscale modeling of severe storms including tropical cyclones, estimating forest fuel load and diagnosing forest fire damage, quantifying the variability of precipitation in polar regions, calculating and tracking the distribution of live biomass, estimating the mass balance of ice sheets and changes in glacier motion, and use of radar techniques for mapping surface deformation and understanding underlying processes related to tectonics, volcanic, subsidence and anthropogenic deformation.</p><p></p><p>Tasks Include:</p><ul><li>Developing standardized and GIS-friendly time series products derived from Synthetic Aperture Radar (SAR) and Optical sensors to map Earth surface water extent and Earth surface deformations at fine spatial resolution.</li><li>Analyzing seismic surface signatures and geophysical deformation to understand the underlying geophysical processes.</li><li>Interfacing between algorithm developers, data system managers, and application users to implement effective cloud-based processing workflows to generate optical and SAR derived application and science products.</li><li>Using virtual data processing to improve workflow and minimize data movement requirements.</li><li>Supporting software development of tropospheric ray-tracing, ocean and solid earth tide, and other InSAR noise reduction modules, as well as implementing the results in processing workflows.</li><li>Applying Bayesian and Machine-Learning methods to quantify the uncertainty in the derived InSAR products.</li><li>Integrating relative InSAR observations into absolute GNSS reference frame and propagating the uncertainties accordingly for generation of state and continental vertical land motion products.</li><li>Documenting all implementations in interactive Jupyter notebooks and providing illustrative examples for integration of the derived remote sensing products into end-user decision making.</li><li>Supporting NISAR Science Team solid earth validation activities.</li></ul><p></p><p><b><u>Requirements</u></b></p><ul><li>This position requires a PhD degree in geophysics, earth science, geodesy, remote sensing, or a related discipline. Postdoctoral research experience is strongly preferred.</li><li>Experience in radar remote sensing, in analyzing radar signatures including backscattering, and in making estimates of the relevant target physical properties.</li><li>Experience in Interferometric Synthetic Aperture Radar (InSAR) processing and in processing and analyzing time series of SAR and InSAR observations.</li><li>Experience in combining InSAR and GNSS observations for generation of Vertical Land motion products.</li><li>Experience with using optical remote datasets for retrieval analysis.</li><li>Excellent written and oral communications skills suitable for presentations at scientific conferences and writing scientific reports for publication in peer-reviewed journals.</li><li>Demonstrated ability for development of geophysics software packages for an application and science audience with demonstrated ability to train end-users in its use.</li><li>Demonstrated ability to establish efficient collaborations with diverse science teams.</li></ul><p></p><p><b><u>Preferred Skills</u></b></p><ul><li>Excellent knowledge of Python, C&#43;&#43;, and Jupyter Notebooks.</li><li>Familiarity with InSAR processing tools, including ISCE2 and ISCE3, tropospheric correction packages including RAiDER, and time-series InSAR processing methods including ISCE stack processors, MintPy and FRINGE.</li><li>Experience with GDAL and working familiarity with GIS (ArcGIS/QGIS).</li><li>Experience with radar signal processing and numerical solution of electromagnetic wave propagation problems.</li><li>Experience in statistical analysis and error propagation.</li><li>Experience with large scale Amazon Web Services (AWS) cloud processing.</li><li>Broad background and experience in application of optical, SAR, and InSAR for mapping water resources, floods, disturbance, and ground displacements.</li></ul><p></p><p><span><span>As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</span></span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$93,496 - $126,464<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Research-Scientist-II--TMS_R4771",
    "jobReqId": "R4771",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Yesterday",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-09-14",
    "timeType": "Full time",
    "title": "Research Scientist II, TMS"
  },
  "userAuthenticated": false
}
