{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Business-Administrator---Analyst-IV_R4096-1",
    "id": "8378305239101001594b8ad881b10000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL’s Instruments Division is seeking an experienced and motivated Business Administrator/Analyst IV. This is an exciting opportunity to be part of the Instruments Division, which crafts one-of-a-kind science instruments to explore Earth, planets, the cosmos and beyond!</p><p></p><p>You will be a member of the leadership team and provide independent financial data and schedule performance measurement and reporting expertise for our Instrument projects, as well as maintain and develop innovative business analytics products that enable data driven decision making. This position is well-suited for an individual who thrives balancing multiple priorities, applying data analytics to make logical inferences, and being part of a team. You will work in concert with the Division Business Administration Manager (BAM), Assistant Division Manager for Formulation and Technology (ADM FT), as well as the broader team.</p><p></p><p>Specific responsibilities include:</p><ul><li><p>Act as the principal business point of contact for the Instruments Division in the following areas:</p><ul><li><p>Partner with the Division BAM and ADM FT to refine and improve the current Division 38 cost history database.</p></li><li><p>Develop typical cost and workforce profiles for various Instruments Division products and services, including different instrument classes/types. Build a repository for these products and make them broadly available to Division personnel.</p></li><li><p>Partner with Instrument Managers and/or Product Delivery Managers to develop instrument budgets and schedules that are advised by historical cost and workforce profiles.</p></li><li><p>Maintain and improve the Division 38 Financial and Flight Instrument Scenario Workforce Dashboards (PowerBI) and improve the quality and efficiency of workforce forecasting in the Division. Conduct what-if scenarios for future business bring together.</p></li><li><p>Own the division’s efforts to improve instrument cost and schedule performance on instrument projects through development, socialization, and implementation of the products described above.</p></li><li><p>Conduct ad-hoc analyses as requested by the Division leadership team.</p></li></ul></li><li><p>Be an integral member of the Division’s business leadership team, significantly contributing to business-related decision making, identification of process improvements, and leading process change implementation.</p></li><li><p>Ensure successful line business functions in cost and schedule planning, forecasting, analysis, performance measurement, assessment and reporting in all phases of the instrument lifecycle, in partnership with the Program Business Management Division (PBMD), specifically, the Cost, Schedule Estimation and Evaluation and Project Controls sections.</p></li><li><p>Promote and foster best business practices in accordance with established Institutional processes and procedures and the Prime Contract.</p></li><li><p>Lead the development of key business processes, tools, and templates for the Division. Collaborate with technical staff to identify and develop sophisticated resource requirements for proposals.</p></li><li><p>May serve on cross-organizational committees and represent the needs of the Division and present the organization’s viewpoint on project business issues to both internal and external contacts.</p></li><li><p>Provide ad-hoc project management support on a variety of financial and operational projects, including planning, scheduling, tracking of deliverables, setting performance goals, and monitoring of performance.</p></li></ul><p></p><p><b>Required Skills:</b></p><ul><li><p>Typically requires a Bachelors degree in Business Administration, Finance, Computer/Business Information Systems, or related subject area with a minimum of 9 years of related experience; Master’s degree in similar disciplines with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years related experience.</p></li><li><p>Wide-ranging experience and sophisticated knowledge in one or more of the following areas: financial and workforce planning and analysis, project schedule analysis and business analytics.</p></li><li><p>Must be a self-starter, work independently and in a team; able to optimally lead teams of both business and technical personnel.</p></li><li><p>Strong analytical and problem-solving skills with the ability to resolve highly sophisticated issues independently.</p></li><li><p>Ability to communicate findings and recommendations in a clear, concise manner using graphics, tables, and high-level summarization.</p></li><li><p>A successful history of establishing trust with customers and working as a strong, collaborative business partner. Must exercise tact and discretion when working with sensitive or confidential data.</p></li><li><p>Advanced skills in MS Office Applications (M365).</p></li></ul><ul><li><p>Enterprise Edition, or similar business tools/applications.</p></li><li><p>Demonstrable ability to plan, prioritize, multi-task and complete assignments with minimal direction.</p></li><li><p>Excellent customer service, organizational, interpersonal, verbal, and written communication skills.</p></li></ul><p></p><p><b>Preferred Skills</b></p><ul><li><p>Complete knowledge of applicable Laboratory and/or NASA policies and procedures and government regulations, and exposure to JPL’s Institutional business processes and architecture.</p></li><li><p>Experience in the use of budgeting and reporting tools including the JPL Institutional Budgeting Tool (IBT), PowerBI, Oracle Business</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$120,536 - $151,528<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Business-Administrator---Analyst-IV_R4096-1",
    "jobReqId": "R4096",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 2 Days Ago",
    "startDate": "2023-06-07",
    "timeType": "Full time",
    "title": "Business Administrator / Analyst IV"
  },
  "userAuthenticated": false
}
