{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Group-Supervisor--Hardware-Quality-Assurance-_R4327",
    "id": "129f4f4c50e910016a4ebe66471c0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>We are looking for a Hardware Quality Assurance leader who will be responsible for leading a team of highly skilled quality professionals that are responsible for providing verification, validation, and oversight assurance on JPL Projects throughout procurement, build, test and launch activities.</span></b> This leader will be responsible for assigning work, providing training, and building personnel capability.  You will provide career coaching, growth, and personal development, and make decisions on hiring, promotions, salary changes, and performance appraisals.  In addition, they will be a member of the Section Leadership Team and participate in the development and management of the Quality Section Strategic Plan and manage related Tactical Operations Plans.</p><p></p><p>Opportunity: You will contribute to the creation of assurance processes, procedures, cost models, templates and other supporting infrastructure that directs and dispatches the work of the group and work directly with customers to negotiate appropriate levels of support, considering project resource levels, risk postures, and applicable institutional and NASA requirements. You will ensure the consistent execution of a defined set of assurance functions performed by the group, as well as initiate and manage process improvement efforts to increase organizational efficiency, improve customer/employee satisfaction and increase the likelihood of JPL mission success. You will provide the team with a solid foundation in quality principles and tools and develop metrics to measure and improve performance.  You will be responsible for building and maintaining an effective Hardware Quality Assurance Team and provide a healthy teaming culture.</p><p></p><p>You will represent the Quality Assurance (QA) organization on Laboratory committees and JPL on industry committees, will lead process development and improvement activities, and the development of systems and databases to support QA operations and improvement efforts. Partner with sections that are responsible to design, build and assemble products. Lead team to ensure the end-to-end assembly and integration of the spacecraft and its instruments.</p><p><br /><b><span>Required Qualifications: </span></b></p><ul><li><p>Bachelor&#39;s degree in Electrical, Mechanical or Industrial Engineering or related technical discipline with typically a minimum of 9 years of related experience; Master&#39;s degree in similar disciplines with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years related experience.</p></li><li><p>Minimum of 2 years’ experience as a technical lead.</p></li><li><p><b><span>Extensive knowledge of Hardware Quality Assurance with significant expertise in mechanical, electrical, subsystem and system level integration and test activities.</span></b></p></li><li><p>Wide-ranging experience and advanced knowledge in one or more related fields of knowledge in <b><span>mechanical and electrical quality assurance, component and spacecraft/instrument integration and test, quality principles and tools.</span></b></p></li><li><p>Experience or knowledge in <b>i</b><b><span>nspection processes (receiving, in-process and/or source inspections) </span></b>in support of a large aerospace company.</p></li><li><p>Knowledge of industry and/or academic practices and standards across a range of applications in both mechanical and electronic hardware assurance methods.</p></li><li><p>Experience in developing and maintaining Hardware Quality Assurance processes, plans and procedures. Ability to evaluate existing processes and lead process improvement initiatives.</p></li><li><p>Proficient in Microsoft Office (Excel, Word, PowerPoint, MS Project).</p></li><li><p>Demonstrated effective written and verbal communication skills and computer skills, alongside effective interpersonal, leadership and supervisory skills.</p></li><li><p>Occasional travel will be required.</p></li><li><p>Previous experience as a Quality Assurance Engineer, manufacturing engineer, process engineer, or Mission Assurance Manager is a plus.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$148,616 - $191,984<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Group-Supervisor--Hardware-Quality-Assurance-_R4327",
    "jobReqId": "R4327",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-05-17",
    "timeType": "Full time",
    "title": "Group Supervisor (Hardware Quality Assurance)"
  },
  "userAuthenticated": false
}
