{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Communications-Outreach-Specialist-for-Mars--Temporary-_R4142",
    "id": "e69c71fb5b7e1000cc6743a7e6f80000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>Working with the Manager of Mars Public Engagement, you will work with multiple teams of professional communicators and mission team members to share the story of Mars Exploration with the public. That work will include developing content for Mars missions and programs, websites, public events, products, social media and engaging public campaigns. This will include working on existing missions like the Mars Curiosity and Perseverance rover missions, including those associated with Mars Sample Return.</span></p><p><b><span> </span></b></p><p><b><b>Responsibilities: </b></b><span>As part of the Mars Public Engagement team you will:</span></p><p></p><p><b><b>Develop Plans, Campaigns, Strategies</b></b></p><ul><li><p><span>Work as a team lead with public engagement staff to innovate, sustain and grow the most successful existing public engagement initiatives, digital footprint and products.</span></p></li><li><p><span>Develop communications campaigns, including generating content (text, graphics, animations, videos, shareables, interactives, etc.) for the web, social media, and public events, in consultation with management, mission technical staff, and team members. </span></p></li><li><p><span>Develop communications plans, strategies and budgets. Envision communications strategies, proposes ideas and plans, presents to the Mars Public Engagement Manager and regularly presents to senior management, including to scientists and engineers.</span></p></li><li><p><span>Manage, edit, organize and implement the presentation of digital content through a wide variety of technologies using software for graphics, animation, text, multimedia, dynamic and/or interactive content presentation.</span></p></li><li><p><span>Work to connect our public with the essence of JPL/NASA space sciences, in authentic ways, with the needs of public audiences and stakeholders</span></p></li></ul><p></p><p><b><b>Work With Scientists and Engineers</b></b></p><ul><li><p><span>Be a communications liaison with scientists and engineers on the mission, helping leverage their expertise to tell their story to the public. </span></p></li><li><p><span>Develop deep content knowledge of mission science and engineering in order to translate the meaning of complex material from a storytelling perspective, with high visual and emotional impact. </span></p></li><li><p><span>Regularly present to mission personnel at weekly staff meetings, monthly meetings and quarterlies.  Requiring the development of reports, powerpoints and other presentations.</span></p></li></ul><p></p><p><b><b>Help Build Exhibits and Staff Events</b></b></p><ul><li><p><span>Coordinate event planning/execution and product dissemination (may include packing and shipping of materials, printing and storing of physical products).</span></p></li><li><p><span>Find innovative ideas to create exhibits and programming that spark imagination and leverage our mission science goals, themes, and content from NASA’s exploration.</span></p></li><li><p><span> </span><span>Represent JPL/NASA communication initiatives at professional conferences when necessary, including presenting papers and posters as a professional communicator.</span></p></li><li><p><span>Research industry best practice and provide ongoing improvements to public engagement programs and products.</span></p></li></ul><p></p><p><b><b>Work With a Highly Engaged Team of Professionals</b></b></p><ul><li><p><span>Support team members on collaborative efforts, creatively and effectively integrating public-engagement and media-relations goals into communications products for a range of space-science missions. </span></p></li><li><p><span>You will be levering the expertise of Mars team members to build new experiences and campaigns, working in a small, fun team of innovators, each with their own unique style.</span></p></li><li><p><span>Network and develop relationships with stakeholders and partners at JPL, NASA, and externally.</span></p></li><li><p><span>Work cross-teams to work with and leverage other groups within JPL and NASA.</span></p></li></ul><p></p><p><b>Qualifications - Here’s what you will bring:</b></p><ul><li><p><span>Typically requires a Bachelor&#39;s degree in Communications, Public Relations, Marketing, Journalism, or related subject area degree, with a minimum of 6 years of related experience; or Master&#39;s degree with at least 4 years of relevant experience</span></p></li><li><p><span>Ability to distill complex science and engineering topics into brief, colorful, and understandable materials for the public</span></p></li><li><p><span>Excellent writing, editing (web/photo/video/text), digital content creation, presentation and communication skills; Knowledge of online best practices</span></p></li><li><p><span>Consistent track record producing and delivering high impact events, experiences and products</span></p></li><li><p><span>Ability to establish partnerships and collaborate with high level stakeholders and handling a variety of strategic and budgetary planning</span></p></li><li><p><span>Experience developing and implementing large scale communications campaigns and reporting metrics</span></p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p><span>Demonstrated experience developing and implementing social media campaigns.</span></p></li><li><p><span>Proficiency with Microsoft Office, Google Suite, project management software, Adobe Creative Suite, Slack and social media platforms</span></p></li><li><p><span>Comfortable working in technical environments and interacting with scientists and engineers to translate their work to publicly-accessible content.</span></p></li><li><p><span>A team player, able to work with people of diverse backgrounds, personalities and expertise. Able to forge strong relationships and collaborate within team, and across departments.</span></p></li></ul><p></p><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$97,552 - $119,392<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Communications-Outreach-Specialist-for-Mars--Temporary-_R4142",
    "jobReqId": "R4142",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 13 Days Ago",
    "startDate": "2023-03-27",
    "timeType": "Full time",
    "title": "Communications Outreach Specialist for Mars (Temporary)"
  },
  "userAuthenticated": false
}
