{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technical-Learning-and-Development-Learning-Coordinator_R4496",
    "id": "731ce68d6c0b100158f3d37812d00000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Technical Learning and Development (TL&amp;D) team is responsible for the consultation, design, development, and delivery of learning solutions to equip JPL employees with the right skills and capabilities needed for their role. As a center of excellence (CoE), our vision is to engage our learners through adaptive, personalized learning experiences that target their continuous learning needs.</p><p></p><p>We currently have a full-time opportunity for a <b>Technical Learning and Development Learning Coordinator</b>, reporting to the Head of Technical Learning &amp; Development within Human Resources. As a Technical Learning Coordinator, your goal is to ensure a successful learning experience through smooth, effective delivery, on-going support and improvements of lab-wide learning programs and events. You will be supporting multiple programs simultaneously and working closely with the TL&amp;D team to achieve successful delivery and administration of JPL, NASA, and external learning solutions to a hybrid workforce. You will be responsible for coordinating the delivery of online and in person learning programs, including end-to-end production support, technical support, and customer support for your two client types - participants (employees) and the business (program owners, learning specialists, instructors). You play a key role in continuously improving the efficacy of our learning programs, working in partnership with your learning specialist team members to evaluate and improve learning solutions throughout the product lifecycle. You will also work closely with partners in Leadership and Organizational Development, HR information systems, IT, Product, and the business to effectively use technology to enable user-experience centered learning across JPL.  The primary systems you will be supporting include but are not limited to SumTotal LMS, Degreed, and LinkedIn Learning, while working very closely with WebEx, iContact, and Qualtrics.</p><p></p><p><b>Responsibilities:</b></p><ul><li><p>Work closely with subject matter experts, vendor representatives, presenters, and learning partners to deliver online and in-person instructor led courses, webinars, and events.</p></li><li><p>Manage learning program readiness, agenda, schedules, and delivery.</p></li><li><p>Work within JPL’s learning systems to create and manage learning activities, plans, enrollments, rosters, scheduling, notifications and learning metrics (reports).</p></li><li><p>Manage online and in-person classroom logistics including reservations, room setup, audio/visual support, technical setup, materials setup, and tear down.</p></li><li><p>Provide technical production support for live online classes via WebEx, Teams, Zoom or similar virtual conference tools.</p></li><li><p>Administer interactive tools throughout learning delivery including but not limited to polls, whiteboards, break-out sessions, and Q&amp;A.</p></li><li><p>Manage the acquisition process, lab and system access, and general support for learning vendors.</p></li><li><p>Facilitate usability studies and end-user testing of learning programs to continuously improve the learning experience of our programs.</p></li><li><p>Resolve customer questions and issues by acting as the first point of contact for TL&amp;D learning program support.</p></li><li><p>Market learning programs across multiple channels including but not limited to email, social platforms (e.g.: LinkedIn, Slack), websites, and intranet sites.</p></li><li><p>Manage and maintain on-premise training facilities and equipment.</p></li><li><p>Administer participant communication throughout the lifecycle of a learning program, including pre-work, reminders, agendas, surveys, post course information and ongoing communication.</p></li><li><p>Synthesize and prepare learning reports and status updates on programs to different levels of management.</p></li><li><p>Implement and deliver course evaluations, pre and post assessments, and learner insight reports for key stakeholders.</p></li><li><p>Manage learning program portals and websites.</p></li><li><p>Interface with all levels of management to plan and coordinate schedules and delivery of learning programs across multiple calendars.</p></li><li><p>Manage TL&amp;D’s learning delivery calendar.</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p><b>BA/BS degree and 3&#43; years of related human resources coordination experience – training focus preferred - or Masters with 1 year of related experience.</b></p></li><li><p>Proven skill and ability to coordinate multiple projects and tasks simultaneously.</p></li><li><p>Experience working with Learning Management systems.</p></li><li><p>Experience with Project Management; ability to develop and maintain a project plan for all aspects of assigned projects.</p></li><li><p>Working knowledge of online conference tools such as Webex, Zoom, and Teams.</p></li><li><p>Proven ability to research, gather information, and recommend solutions to fit the strategic vision and organizational needs.</p></li><li><p>Strong customer service skills with a focus on solutions and problem resolution.</p></li><li><p>Ability to maintain confidentiality and sensitivity while maintaining effective working relationships with trainers, management, and customers.</p></li><li><p>Excellent interpersonal skills, both oral and written required.</p></li><li><p>Ability to work in a strong team-oriented environment.</p></li><li><p>High level computer literacy skills in word processing systems and personal computer applications including Microsoft Office applications (Excel, Word, PowerPoint and Outlook)</p></li><li><p>Excellent time management skills, with the ability to lead multiple projects at once and work in a fast-paced, ever-changing environment.</p></li><li><p>Ability to exercise independent judgment, discretion, and confidentiality.</p></li><li><p>Ability to develop solid relationships and demonstrate collaboration skills at all levels of the organization.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Experience working with SumTotal LMS, Degreed and LinkedIn Learning.</p></li><li><p>Experience working with document repositories such as Wikis.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$75,920 - $98,904<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Technical-Learning-and-Development-Learning-Coordinator_R4496",
    "jobReqId": "R4496",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 27 Days Ago",
    "startDate": "2023-06-28",
    "timeType": "Full time",
    "title": "Technical Learning and Development Learning Coordinator"
  },
  "userAuthenticated": false
}
