{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Guidance-and-Control-Hardware-Engineer-IV_R4500",
    "id": "731ce68d6c0b100160d1dce4ecb10000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the <b>Autonomous Systems Division</b>, which is responsible for technology development, advanced concepts, design, development, delivery, integration and test, verification and validation, and operation of Command and Data Handling (C&amp;DH) Hardware, Flight Software, Power Systems, Robotic Systems, and Guidance and Control (G&amp;C).</p><p></p><p>As a <i>Guidance and Control Engineer</i> in the <b>Guidance, Navigation and Control (GN&amp;C) Hardware and Testbed Development Group</b>, you will be working for JPL’s <b>Guidance and Control Section</b>. We do system engineering, design and analysis, hardware development/procurement, testing, and operations support in G&amp;C areas for unique deep-space/earth-orbiting/astrophysics missions. We also do world class research and technology development in autonomous guidance, navigation and control systems including pin-point and safe landing, space rendezvous, formation flying, and precision pointing, among others.</p><p></p><p>The Guidance and Control Engineer will lead a team that is responsible for the procurement or design, development, integration and flight qualification of sensor systems for flight missions (including inertial and optical based GN&amp;C sensors). In this role, you will also independently propose and develop new sensor technologies for on-board spacecraft GN&amp;C systems, secure funding for technology development and lead effort to develop technology for infusion into future flight projects.</p><p></p><p>Other responsibilities include:</p><ul><li><p>Conceptualizing, designing, analyzing, simulating, overseeing, and assessing highly complex and critical performance of G&amp;C subsystems.</p></li><li><p>Ensuring the delivery of highly complex and critical hardware and/or software to G&amp;C subsystem integration and test.</p></li><li><p>Developing highly complex and critical G&amp;C subsystem budget and staffing plans to accomplish the objectives of a project.</p></li><li><p>Developing and implementing detailed test and verification plans from subsystem requirements.</p></li><li><p>Coordinating the work of specialist engineers to develop integrated concepts.</p></li></ul><p></p><p>This position will also have the role of Cognizant Engineer or Contract Technical Manager or Cost Account Manager and will assist the Product Delivery Manager (PDM) with planning, implementation and successful delivery to a project or program of a defined set of products<br />and/or services known as a project element. As the Delivery Lead you may negotiate budgets, deliverables and resources with the PDM and line organizations. You will also formally adjust assigned resource plans and may approve work agreements.</p><p></p><p><b>The following qualifications are required: </b></p><ul><li><p>Bachelor’s degree in Electrical Engineering, Aerospace Engineering, Computer Engineering or related technical discipline with typically a minimum of 9 years of related experience, a Master’s degree in similar discipline with a minimum of 7 years of related experience, or a PhD in similar discipline with a minimum of 5 years of related experience.</p></li><li><p><b>Extensive experience designing, analyzing, implementing, calibrating, verifying, and simulating complex and advanced GN&amp;C on-orbit systems.</b></p></li><li><p>Advanced knowledge in one or more of the following GN&amp;C sensor areas: <b>inertial sensors or optical sensors, such as lidars, star trackers, sun sensors, formation flying sensors, pin point and safe landing sensors, space rendezvous sensors, precision pointing sensors etc.</b></p></li><li><p>Advanced knowledge of applicable industry and/or academic practices and standards in spacecraft guidance navigation and control and spacecraft sensor systems.</p></li><li><p>Recent experience and proven track record developing new technology for GN&amp;C sensors.</p></li><li><p>Experience with contract technical management.</p></li><li><p>Proven ability to acquire new funding for technology development.</p></li><li><p>Innate team player and leader with excellent communication, interpersonal, verbal and presentation skills.</p></li></ul><p></p><p><b>The following qualifications are preferred:</b></p><ul><li><p>Strong technology development background.</p></li><li><p>Experience with the development of optical pointing systems and integrated GN&amp;C hardware and software systems.</p></li><li><p>Experience working with lasers, detectors, fiber optics, fast steering mirrors and high rate control systems.</p></li><li><p>Demonstrated experience managing cost and schedule to develop new technology.</p></li><li><p>Advanced knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</p></li><li><p>Experience with development of integrated GN&amp;C hardware and software systems.</p></li><li><p>Experience with flight qualification of spacecraft sensor systems.</p></li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$133,432 - $176,592<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Guidance-and-Control-Hardware-Engineer-IV_R4500",
    "jobReqId": "R4500",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30 Days Ago",
    "startDate": "2023-06-28",
    "timeType": "Full time",
    "title": "Guidance and Control Hardware Engineer IV"
  },
  "userAuthenticated": false
}
