{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Scientist-II---Remote-Sensing-of-Aquatic-Ecosystems_R4583",
    "id": "db763f83b2ba100118bd9f90341f0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>We seek a Scientist that will be a member of the Water and Ecosystems Group to focus on remote sensing for Aquatic Ecosystems.</p><p></p><p>The selected candidate will focus on the following responsibilities:</p><ul><li><p>Conduct research using existing airborne and spaceborne VSWIR and TIR data as<br />precursory SBG science and applications, specifically 1) use of PRISM airborne data and<br />in situ data collected as part of the S-MODE mission for aquatic ecosystems, and 2) use of<br />ECOSTRESS data for marine heatwaves of inland lakes</p></li><li><p>Develop and/or refine existing open-source aquatic algorithms for SBG, and lead their<br />validation</p></li><li><p>Lead SBG DEIA collaborations and activities with minority and underrepresented groups</p></li><li><p>Work with the JPL Office of Inclusion in researching DEIA issues related to indigenous<br />knowledge capture/collaboration/implementation and providing recommendations and<br />feedback to DEIA strategies within JPL missions</p></li><li><p>Publication in peer-reviewed literature</p></li></ul><p></p><p><b>The following qualifications are required:</b></p><ul><li><p>PhD in marine science, optical oceanography, or a related technical discipline</p></li><li><p>Experience in processing and analyzing imaging spectroscopic data through open-source software and programming languages (Python, R) as well as other software (Hydrolight, ACOLITE, SeaDAS)</p></li><li><p>Experience with collection of in situ optical radiometry data for validation of aquatic remote sensing derived products, such as Hyperpro, Spectral Evolution, pySAS, AC-9/-S</p></li><li><p>Track record of aquatic algorithm development, and potential utilization of state-of-the-art data science and machine learning methods for algorithm optimization</p></li><li><p>Track record of contributing to peer-reviewed publications in the area of ocean biology and biogeochemistry / ocean optics</p></li><li><p>Excellent oral (including public speaking) and written communication skills</p></li><li><p>Experience building and/or working in collaborative, diverse and inclusive team environments</p></li><li><p>Strong interpersonal skills, demonstrated through mentorship, listening and good communication</p></li><li><p>Track record in DEIA activities</p></li></ul><p></p><p><span>Complete applications will include a cover letter describing the applicant’s vision for this role at JPL, a curriculum vita including a bibliography of refereed and other work, a statement on research experience and research objectives, and contact information for at least three professional references. Please combine all documents into one PDF.  </span></p><p></p><p><b><span>Applications received by August 27, 2023 will receive full consideration.</span></b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$93,496 - $126,464<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Scientist-II---Remote-Sensing-of-Aquatic-Ecosystems_R4583",
    "jobReqId": "R4583",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "startDate": "2023-07-25",
    "timeType": "Full time",
    "title": "Scientist II - Remote Sensing of Aquatic Ecosystems"
  },
  "userAuthenticated": false
}
