{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Data-Scientist-IV_R4369",
    "id": "753d3026a57c1001147cfe18173a0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Do you excel in an environment that values exploration and discovery? We have a universe of opportunities waiting for you!</p><p></p><p>The Jet Propulsion Laboratory (JPL) is NASA’s lead center for robotic exploration of the solar system. Our core competency is the end-to-end implementation of unprecedented robotic space missions to study Earth, the Solar System, and the Universe.</p><p></p><p>The Instrument Software and Science Data Systems (Org. 398) Section within JPL consist of multidisciplinary teams of engineers and technologists who provide expertise across the domains of instrument operations and science data systems. </p><p></p><p>We are responsible for:</p><p><span><span>·<span>         </span></span></span>Safely controlling JPL remote sensing instruments.</p><p><span><span>·<span>         </span></span></span>Transforming data collected by these instruments into scientific measurements and preserving them for future analyses.</p><p><span><span>·<span>         </span></span></span>Providing context and understanding to the measurements.</p><p><span><span>·<span>         </span></span></span>Making the measurements and related information accessible to a broad and global user community: scientists, operations, decision makers and society at large.</p><p></p><p>Our engineering teams build and operate high performance data processing, management and analysis systems capable of handling petabyte scale datasets in support of science discovery, research, operations and applications.   They support JPL and NASA missions, as well as other science-based projects.  Our research and technology development teams create new onboard and ground based technologies for data processing, analysis, modeling, reasoning, visualization, management, access and analytics that are infused into our data systems.</p><p></p><p>JPL, located in Pasadena, California, has a casual, campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>We are proud to be part of NASA and Caltech, as we explore the universe and make history through new discoveries. </p><p></p><p>We aim to do things never done before and to go places few can go. We dare mighty things…do you?</p><p></p><p><b><u>Job Responsibilities</u>:</b></p><p>As a member of the Science Data Modeling and Computing Group (Org. 398K), you will report to the Technical Group Supervisor of 398K. You will be working on several research projects that involve the development, application, and publication of Earth System models and data assimilation systems. You will also develop new proposal ideas in the area of Earth System models and data assimilation systems.</p><p></p><p>You will contribute to a project that develops a data assimilation system that can support the design of a future Planetary Boundary Layer (PBL)-targeted observing system and can utilize the new observations for PBL parameterization improvements. You will contribute to a project that develops an Observing System Simulation Experiments (OSSE) system that thoroughly and efficiently explores the instrument trade space for PBL science and applications. You will contribute to a project that studies tropical storm behaviors and storm intensification processes. You will contribute to a project that develops and improves ECCO-Darwin, a global-ocean biogeochemistry model and applies ECCO-Darwin to study the physical, chemical, and biological drivers for the space-time variability of ocean carbon sources and sinks. You will contribute to a project that develops the capabilities to conduct comprehensive trade space analyses of space-based observations for 3D winds using global and regional atmospheric model simulations, instrument simulators, satellite orbit simulators, wind retrieval algorithms, uncertainty quantification and data fusion methods, and numerical weather prediction OSSEs.</p><p></p><p><b><u>Required Skills</u>:</b></p><p><span><span>·<span>         </span></span></span>Bachelor’s degree in Earth Science or related field with 9 years of related work experience, Master’s degree with 7 years of related work experience, or PhD with 5 years of related work experience</p><p><span><span>·<span>         </span></span></span>Extensive knowledge in Earth System Models and data assimilation systems (WRF, GEOS-5, ECCO-Darwin)</p><p><span><span>·<span>         </span></span></span>Extensive knowledge in Planetary Boundary Layer processes and their sub-grid model parameterizations</p><p><span><span>·<span>         </span></span></span>Proven capability to run the Earth System Models and data assimilation systems</p><p><span><span>·<span>         </span></span></span>Proven capability to develop global atmospheric models and ocean circulation models</p><p><span><span>·<span>         </span></span></span>Proven capability to develop Earth system data assimilation systems</p><p><span><span>·<span>         </span></span></span>Proven capability to develop new proposal ideas and write compelling proposals for NASA Research &amp; Analysis programs.</p><p><span><span>·<span>         </span></span></span>Experiences in analyzing satellite observation data for model development and data assimilation</p><p><span><span>·<span>         </span></span></span>Experiences in statistical analysis and algorithms</p><p><span><span>·<span>         </span></span></span>Expertise in working on high performance computing with parallelized codes</p><p><span><span>·<span>         </span></span></span>Capability to program algorithms for scientific data analysis using tools such as Python, Matlab, and R</p><p><span><span>·<span>         </span></span></span>Capability to program and update existing software with written requirements and interface changes</p><p><span><span>·<span>         </span></span></span>Proficiency in programming in FORTRAN, C&#43;&#43;, or Python for complex numerical models</p><p><span><span>·<span>         </span></span></span>Strong, professional skill in oral and written presentations and publications</p><p></p><p><b><u>Desired Skills</u>:</b></p><p><span><span>·<span>         </span></span></span>Independence of conducting daily research work with minimal supervision</p><p><span><span>·<span>         </span></span></span>Ability to interact with team members with different background/domain expertise</p><p><span><span>·<span>         </span></span></span>Ability to learn new data science methods and skills efficiently</p><p><span><span>·<span>         </span></span></span>Creativity to seek solutions to achieve desired outcomes</p><p><span><span>·<span>         </span></span></span>Familiarity with NASA research programs</p><p><span><span>·<span>         </span></span></span>Ability to present task status and findings clearly</p><p><span><span>·<span>         </span></span></span>Strong ownership of tasks</p><p><span><span>·<span>         </span></span></span>Driven to innovate ways to improve the current state of art in Earth Science</p><p><span><span>·<span>         </span></span></span>Ability to work efficiently in a tight delivery schedule</p><p><span><span>·<span>         </span></span></span>Ability to prioritize tasks and manage time to support multiple projects simultaneously</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$146,952 - $189,384<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Data-Scientist-IV_R4369",
    "jobReqId": "R4369",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "startDate": "2023-05-30",
    "timeType": "Full time",
    "title": "Data Scientist IV"
  },
  "userAuthenticated": false
}
