{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-III--EDL-_R4537-1",
    "id": "4e57a7183d181001b24720586d780001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><h2><b>Responsibilities:</b></h2><p>If you are passionate about spacecraft design, we invite you to join the Flight <b>Systems Engineering, Integration and Test Section.</b> We provide systems engineering for the design and implementation of spacecraft for the laboratory’s key flight projects. Our work spans spacecraft systems engineering, payload systems integration, electrical systems integration, fault protection and autonomy design, landing systems design, spacecraft assembly and test, systems verification and validation, and systems modeling.</p><p></p><p>We are seeking a highly motivated and experienced<b> Systems Engineer III </b>to join the <b>Entry, Descent, and Landing (EDL)</b> <b>Systems and Advanced Technologies Group </b>, reporting administratively to the Technical Group Supervisor and programmatically to the SRL EDL Phase Lead. Your initial assignment will be to serve as a<b> Verification and Validation (V&amp;V) Lead for the Mars Launch System Ascent Phase.</b> Your primary responsibility will be to design and execute a successful <b>V&amp;V program of the MLS Ascent Phase.</b> In addition, you will support the<b> SRL Parachute V&amp;V campaign</b> as a system engineer.</p><p></p><p>You will work independently and within a team environment, collaborating on tasks performed across a spectrum of disciplines and have excellent writing and oral presentation skills.</p><p></p><h2><b>Tasks may include but not limited to:</b></h2><ul><li><p>Lead the technical content of the MLS Ascent Phase V&amp;V program from the System Level through lower levels throughout the Project lifecycle.</p></li><li><p>Drive expectations for L3 and L4 EDL V&amp;V, including reviewing coverage/adequacy of plans and expected deliverables.</p></li><li><p>Analyze venue fidelity, including testbed validation cases, to ensure venue fidelity is sufficient for the EDL V&amp;V program; develop and flow requirements to the testbed venues to ensure they have the appropriate capability and fidelity.</p></li><li><p>Develop and manage the Success Tree, decomposing Verification Requirements and associated Verification Activities.</p></li><li><p>Develop and manage the Incompressible Test List and Project Test As You Fly Exceptions deliverables.</p></li><li><p>Audit and approve of V&amp;V evidence at major reviews for Ascent Phase requirements.</p></li><li><p>Organize and attend detailed V&amp;V-related reviews to ensure proper test plan, execution, and closure depth and breadth for Data Reviews and Anomaly resolution reports.</p></li><li><p>Have in-depth knowledge of the Ascent Phase V&amp;V program status, as reported to Project and Institutional management.</p></li><li><p>Support the SRL parachute verification and validation program as a system engineer.</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in Engineering, Physics, or related technical discipline with a minimum of 6 years of professional experience, or Master’s degree with a minimum of 4 years of experience, or Ph.D with a minimum of 2 years of experience.</p></li><li><p>Proven ability to conceive of and implement practical solutions to complex multi-disciplinary systems problems.</p></li><li><p>Demonstrated ability to successfully collaborate and interface with other technical organizations, including system contractors, in a multidisciplinary environment.</p></li><li><p>Be a self-motivated individual who can work independently and in a team environment.</p></li><li><p>Excellent communication (oral, written, presentation), interpersonal, negotiation, and organizational skills.</p></li><li><p>Availability for occasional domestic travel.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Experience on flight projects in requirements development, integration and test and/or verification and validation.</p></li><li><p>Experience leading tasks and coordinating working groups on large-scale projects in system development, test, and/or operations.</p></li><li><p>Experience with guidance and control aspects of system engineering, including system software specification, development, and test.</p></li><li><p>Experience with high altitude parachute testing.</p></li><li><p>Willingness to obtain a security clearance if asked.</p></li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$122,096 - $154,336<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Systems-Engineer-III--EDL-_R4537-1",
    "jobReqId": "R4537",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 4 Days Ago",
    "startDate": "2023-07-13",
    "timeType": "Full time",
    "title": "Systems Engineer III (EDL)"
  },
  "userAuthenticated": false
}
