{
  "jobPostingInfo": {
    "id": "f07bc8fafbcd1000cabda8552f960000",
    "title": "Cloud Data Platform Lead - IV",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Overview</b></p><p>Do you excel in an environment that values exploration and discovery? We have a universe of opportunities waiting for you!</p><p></p><p>The Jet Propulsion Laboratory (JPL) is NASA’s lead center for robotic exploration of the solar system. Our core competency is the end-to-end implementation of unprecedented robotic space missions to study Earth, the Solar System, and the Universe.</p><p></p><p>The Instrument Software and Science Data Systems (Org. 398) Section within JPL consist of multidisciplinary teams of engineers and technologists who provide expertise across the domains of instrument operations and science data systems.</p><p></p><p><b>Summary</b></p><p>Designs, develops, and/or modifies scientific applications for highly complex or specialized operations within science data and mission software systems including instruments and sensors. Utilizes extensive scientific expertise to understand the needs of the customer, translate needs into requirements, develop prototype applications, iterate with customers, and then deliver quality applications. Involved in entire life cycle of system, including planning, development, deployment, and maintenance. Responsible for understanding and meeting software operational and engineering requirements.</p><p></p><p><b>Job Description</b></p><p>Do you excel in an environment that values exploration and discovery? We have a universe of opportunities waiting for you!</p><p>The Jet Propulsion Laboratory (JPL) is NASA’s lead center for robotic exploration of the solar system. Our core competency is the end-to-end implementation of unprecedented robotic space missions to study Earth, the Solar System, and the Universe.</p><p>The Instrument Software and Science Data Systems (Org. 398) Section within JPL consist of multidisciplinary teams of engineers and technologists who provide expertise across the domains of instrument operations and science data systems.</p><p>We are responsible for:</p><ul><li>Safely controlling JPL remote sensing instruments.</li><li>Transforming data collected by these instruments into scientific measurements and preserving them for future analyses.</li><li>Providing context and understanding to the measurements.</li><li>Making the measurements and related information accessible to a broad and global user community: scientists, operations, decision makers and society at large.</li></ul><p>Our engineering teams build and operate high performance data processing, management, and analysis systems capable of handling petabyte scale datasets in support of science discovery, research, operations and applications.   They support JPL and NASA missions, as well as other science-based projects. Our research and technology development teams create new onboard and ground-based technologies for data processing, analysis, modeling, reasoning, visualization, management, access and analytics that are infused into our data systems.</p><p></p><p><b>Responsibilities</b></p><p>As a member of the Data Product Generation Software Group (Org. 398F) you will report to the Group Supervisor. As the Cloud Data Platform Lead, you will be the technical point of contact for the Cloud Data Platform teams at our Planetary and Earth science projects. You will report directly to the Product Delivery Managers (PDMs). Your contributions will make an impact across our institution and NASA:</p><ul><li>Contribute to the ongoing architectural design and modernization of our planetary data services and systems</li><li>Identify and recommend cloud-based solutions according to performance and operation requirements, and budget</li><li>Work directly with the project architect to ensure production infusion of the large-scale data platform into a Cloud environment</li><li>Develop efficient and high-performance software solutions</li><li>Design and develop web services to simplify search, discovery, access, and analytics capabilities</li><li>Design and develop high availability, load balancing and auto-scaling architecture</li><li>Perform highly complex software system verification and validation</li></ul><p></p><p><b>Required Qualifications</b></p><ul><li>Bachelor’s degree with typically 10 years of experience in Computer Science, Computer Engineering, Data Science or Mathematics. Masters with 8 years of related experience, or PhD with 6 years of related experience</li><li>Strong communication skills</li><li>Experience in technical project and team management</li><li>Strong development skill with Python and Java</li><li>5&#43; years’ experience working with Amazon Web Services (AWS) and solutions</li><li>Extensive experience in Application migrations to Cloud with Cloud Native Patterns and provide support for Applications running in Cloud</li><li>Experience in troubleshooting IAM Policies, Resource permissions issues during migrations of Applications</li><li>Experience working with AWS Services Technologies EC2, ALB/ELB, Elastic BeanStalk, RDS, S3, EBS, EFS, Glacier, LAMBDA, Step Functions, API Gateway, CloudFront, SNS, SQS, DynamoDB, CloudWatch, ECS, CloudFormation, ElastiCache, and Application Runtimes</li><li>Experience with ETL, Data Modeling, and Data Architecture.</li><li>Experience deploying and working with various relational or NoSQL databases </li><li>Experience deploying and working with index search solutions such as (Apache Solr and ElasticSearch)</li><li>Experience in Jupyter Notebooks and JupyterHub</li><li>Experience with Docker container and container orchestration with Kubernetes</li><li>Experience in agile development process (Git, JIRA, Artifactory, CI/CD tools)</li><li>Understanding of modern software architecture and patterns</li><li>Strong critical thinking and problem-solving abilities</li><li>Desire to learn new technologies and concepts</li></ul><p></p><p><b>Preferred Qualifications</b></p><ul><li>Experience with data science frameworks such as (scikit, Keras, and Tensorflow)</li><li>Experience with big data technologies such as (Apache, Kafka, Hadoop and Spark)</li><li>Experience with deployment technologies (infrastructure-as-code)</li><li>Experience with geospatial data management and applications</li><li>Familiar with NASA Planetary and Earth Science data and metadata standards</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$151,944 - $195,832<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-22",
    "timeType": "Full time",
    "jobReqId": "R2954",
    "jobPostingId": "Cloud-Data-Platform-Lead---IV_R2954",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Cloud-Data-Platform-Lead---IV_R2954"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
