{
  "jobPostingInfo": {
    "id": "16fcebb1c5d31001afe80e436a4a0000",
    "title": "Postdoc: Studying Tropospheric Ozone Trends and Variability using Satellite Observations, Ozonesondes and Model Reanalysis Products",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The postdocs at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</p><p></p><p>JPL is seeking a postdoc to join the Tropospheric Composition group in the Earth Science Section of the Science Division at JPL (<a href=\"https://science.jpl.nasa.gov/EarthScience/TroposphericComposition\" target=\"_blank\">https://science.jpl.nasa.gov/EarthScience/TroposphericComposition</a>).</p><p></p><p>Our group uses satellite and ground based measurements, data assimilation and modeling to study the composition of the Earth’s troposphere. Our research focuses on developing methods for remote sensing of atmospheric composition and on Earth system modeling to better understand the carbon, water and nitrogen cycles and impacts of emissions, chemistry, and transport on tropospheric ozone.</p><p></p><p>The successful candidate will support activities related to using, analyzing and validating satellite ozone data records from hyperspectral infrared sounders, UV/Vis spectrometers and combinations of these two categories of instrument. These include products generated by the JPL TRopopsheric Ozone and its Precursors from Earth System Sounding (TROPESS) project (<a href=\"https://tes.jpl.nasa.gov/tropess\" target=\"_blank\">https://tes.jpl.nasa.gov/tropess</a>) and by the Community Long-term Infrared Microwave Combined Atmospheric Product System (CLIMCAPS). The work will also entail applying ozonesonde data and model reanalysis products to evaluate the satellite estimates of tropospheric ozone. The goal of the project will be to identify the ability of the satellite data record to measure changes in tropospheric ozone and to understand biases in and the relative limitations of different satellite observations.</p><p></p><p>The results of the satellite analysis will be incorporated into a larger international community effort to understand tropospheric and surface ozone as part of the Tropospheric Ozone Assessment Report II (TOAR II) project. The work could also include analysis of the time record of ozone both globally and regionally, including looking at megacities and improving the understanding of the relationship between ozone at the surface and in the troposphere.</p><p></p><p>Depending on the candidate’s qualifications, interests, and area of expertise, the specific work will fall into one or more of the following broad categories:</p><p>•             Evaluation and validation of existing tropospheric ozone products from TROPESS and CLIMCAPS, as well as for possible new data products currently being developed</p><p>•             Analysis of TROPESS and CLIMCAPS ozone data records, across the full satellite time period and analyzing trends in the time series.</p><p>•             Developing new insight into the changes and evolution of tropospheric ozone in regional areas, transport studies of ozone and using model results to understand processes that affect tropospheric ozone in areas of interest.</p><p>•             Using other satellite data products from TROPESS and CLIMCAPS, such as methane, carbon monoxide, water vapor and peroxyacetyl nitrate in understanding changes in the time record of the chemical composition of the troposphere.</p><p></p><p><b>Requirements</b></p><p>A Ph.D. and experience with large atmospheric science data sets; comparison of atmospheric measurements to validation data sets; experience analyzing atmospheric measurements and publishing the results in scientific journals.</p><p></p><p>Desired skills: Experience doing science analysis in Python and/or Jupyter Notebooks; Experience using atmospheric chemistry data from satellite observations and familiarity with remote sensing and retrievals from satellite measurements.</p><p></p><p>The appointee will carry out research in collaboration with the JPL advisor, resulting in publications in the open literature.</p><p></p><p>Applicants may be subject to additional program requirements by NASA. Postdoctoral Scholar positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years. Candidates should submit the following to this site: CV, representative publications, contact information for three references, and a cover letter stating their research accomplishments and interests.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$82,180 - $82,180<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-26",
    "timeType": "Full time",
    "jobReqId": "R3829",
    "jobPostingId": "Postdoc--Studying-Tropospheric-Ozone-Trends-and-Variability-using-Satellite-Observations--Ozonesondes-and-Model-Reanalysis-Products_R3829",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Postdoc--Studying-Tropospheric-Ozone-Trends-and-Variability-using-Satellite-Observations--Ozonesondes-and-Model-Reanalysis-Products_R3829"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Ionosphere Phase Estimation for InSAR Time Series Analyses",
      "externalPath": "/job/JPL-Campus/Ionosphere-Phase-Estimation-for-InSAR-Time-Series-Analyses_R1336",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc Position in Arctic Methane",
      "externalPath": "/job/JPL-Campus/Postdoc-Position-in-Arctic-Methane_R2118",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc- Cloud and Precipitation Radar Signal Simulation and Analysis",
      "externalPath": "/job/JPL-Campus/Postdoc--Cloud-and-Precipitation-Radar-Signal-Simulation-and-Analysis_R3445",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc- Advancing Remote Imaging Spectroscopy for Earth Science",
      "externalPath": "/job/JPL-Campus/Postdoc--Advancing-Remote-Imaging-Spectroscopy-for-Earth-Science_R3884",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-03"
    },
    {
      "title": "Postdoctoral Research Opportunity to Study the General Interactions Between the Hydrosphere and Solid Earth",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Research-Opportunity-to-Study-the-General-Interactions-Between-the-Hydrosphere-and-Solid-Earth_R2232",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "JPL Postdoc Opportunity - Atom Interferometer for Microgravity",
      "externalPath": "/job/JPL-Campus/JPL-Postdoc-Opportunity---Atom-Interferometer-for-Microgravity_R1704",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoctoral Position in Pulsar/FRB Astrophysics",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Position-in-Pulsar-FRB-Astrophysics_R831",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc- Mass Spectrometer Technologist",
      "externalPath": "/job/JPL-Campus/Postdoc--Mass-Spectrometer-Technologist_R2567",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc Position in the areas of compact clocks and atom interferometers",
      "externalPath": "/job/JPL-Campus/Job-Posting-Title-JPL-Postdoctoral-Positions-in-the-areas-of-compact-clocks-and-atom-interferometers_R421",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc- Exoplanetary Sciences",
      "externalPath": "/job/JPL-Campus/Postdoc--Exoplanetary-Sciences_R3705",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-05"
    },
    {
      "title": "Postdoc in Geodynamics And Space Geodesy",
      "externalPath": "/job/JPL-Campus/Postdoc-in-Geodynamics-And-Space-Geodesy_R2348",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Satellite-Based Assessment of Relative Sea Level Change 2",
      "externalPath": "/job/JPL-Campus/Satellite-Based-Assessment-of-Relative-Sea-Level-Change-2_R730",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "JPL Postdoctoral Fellow - Mass Spectroscopy and Gas Chromatography",
      "externalPath": "/job/JPL-Campus/JPL-Postdoctoral-Fellow---Mass-Spectroscopy-and-Gas-Chromatography_R3237",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc: Lidar and PolinSAR/TomoSAR Data Fusion in Monitoring Changes of  Vegetation Structure and Surface Topography",
      "externalPath": "/job/JPL-Campus/Postdoc--Lidar-and-PolinSAR-TomoSAR-Data-Fusion-in-Monitoring-Changes-of--Vegetation-Structure-and-Surface-Topography_R2894",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc: Remote Sensing Data Analytics for Mapping and Monitoring Global Forest Carbon",
      "externalPath": "/job/JPL-Campus/Postdoc--Remote-Sensing-Data-Analytics-for-Mapping-and-Monitoring-Global-Forest-Carbon_R2896",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoctoral Fellowship Opportunity in Advancing Climate Information Decision Support in California",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Fellowship-Opportunity-in-Advancing-Climate-Information-Decision-Support-in-California_R3636",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc: Planetary Radio Science and Bistatic Radar",
      "externalPath": "/job/JPL-Campus/Postdoc--Planetary-Radio-Science-and-Bistatic-Radar_R3947",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 26 Days Ago",
      "startDate": "2023-02-14"
    },
    {
      "title": "Postdoc Position: NISAR Retrieval Algorithms Development",
      "externalPath": "/job/JPL-Campus/Postdoc-Position--NISAR-Retrieval-Algorithms-Development_R1089",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "“Postdoc Position: Interaction of Dust and Water Ice Clouds in the Martian Atmosphere”",
      "externalPath": "/job/JPL-Campus/XMLNAME--Postdoc-Position--Interaction-of-Dust-and-Water-Ice-Clouds-in-the-Martian-Atmosphere-_R3181",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-23"
    },
    {
      "title": "Postdoctoral Position -NISAR Solid Earth Algorithm Development",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Position--NISAR-Solid-Earth-Algorithm-Development_R2329-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    }
  ],
  "userAuthenticated": true
}
