{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Safety-and-Health-Engineer-II_R4338",
    "id": "7887ef81446a1001b8e6ad9f12a00000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Responsibilities:</u></b></p><p></p><p>As a member of the Occupational Safety Program Office, you will be responsible for all aspects of occupational safety within your assigned area of responsibility, which includes the following: code interpretation and application, identification and abatement of hazards, Facility and Laboratory Assessment of Safety Hazards, incident investigations and reporting, facility and laboratory inspections, and developing and providing safety training.</p><ul><li><p>As required, will attend pre-project meetings, and highlight/identify potential project related hazards, review project safety plans, IIPP and related compliance programs.</p></li><li><p>Will regularly and professionally perform facility and laboratory health &amp; safety inspections to ensure compliance with NASA prime contract requirements and with general industry safety orders (GISO) as found in Title 8 of the California Code of Regulations.</p></li><li><p>Make recommendations for workplace changes to ensure regulatory compliance and to mitigate risk.</p></li><li><p>Partner with other Subject Matter Experts (SME) to develop hazard mitigation and safety program, procedures and protocols related to space flight and non-space flight projects.</p></li><li><p>Support pre-task Job Hazard Analysis, planning, accident investigation root cause analysis, statistical analysis of injury trends as required.</p></li><li><p>Prepare and implement models for risk exposure and risk management.</p></li><li><p>Read and interpret federal, state, and local regulatory requirements, and NASA contract requirements, as they pertain to JPL’s space flight and non-space flight activities.</p></li><li><p>Will cross-train in other areas of safety and be willing to take on additional duties as determined necessary by management.</p></li></ul><p><br /><b><u>Required Qualifications: </u></b></p><ul><li><p>This position typically requires a <b>Bachelor’s, Master’s or Doctorate degree in Safety and Health, Industrial Hygiene, Environmental Science, Engineering.</b></p></li><li><p><b>Minimum 3 to 5 years of professional/practical experience.</b> Practical experience would include working in academic or industry settings, and exposure to general safety regulations related to asbestos or lead abatement, fall protection, excavation, confined space entry, scaffolding, trenching, hot work, welding, chemical management, or other areas of high-risk, occupational related exposure.</p></li><li><p>Academic and practical exposure related to developing and reviewing health &amp; safety project work plans. </p></li><li><p>Academic or practical exposure related to construction site safety.</p></li><li><p>Academic or practical familiarity with the California Code of Regulations (CCR) specifically with the Construction Safety Orders and the General Industry Safety Orders (GISO).</p></li><li><p>Academic or practical exposure to the science of safety engineers, industrial hygiene, hazardous materials, laboratory safety and health physics and Fire/Life Safety.</p></li><li><p>Knowledge and experience with MS Office Suite, (Word, Excel, PowerPoint, and Outlook).</p></li><li><p>Strong written and verbal communication skills with an ability to work cooperatively, collaboratively, professionally and in a civil manner within a strong team environment.</p></li><li><p>Excellent social awareness and interpersonal communication skills.</p></li></ul><p></p><p><b><u>Preferred Qualifications: </u></b></p><ul><li><p>Graduation from an ABET accredited university in Occupational Safety, Safety Engineering, Industrial Hygiene, or other engineering discipline, or other physical science such as chemistry, physics, biology, etc.</p></li><li><p>Personal initiative as demonstrated by academic and professional experience.</p></li><li><p>Possess sound judgment with a demonstrated ability to follow through on assignments.</p></li></ul><p></p><p><b><u>Physical Requirements:</u></b></p><ul><li><p>Frequent work in and movement across various work terrains, both in indoor and outdoor environments.</p></li><li><p>Occasional need to work at heights (climbing ladders of up to 50 feet, utilizing scaffolding, scissor lifts, etc.).</p></li><li><p>On occasion, may need to work in confined spaces (tunnels, trenches, etc.)</p></li><li><p>Candidate must complete mandatory JPL health and safety or other related training as necessary.</p></li><li><p>Ability to operate motorized vehicles and equipment.</p></li><li><p>Ability to lift and carry up to 25 lbs of equipment.</p></li></ul><p></p><p><b><u>Other Duties: </u></b></p><ul><li><p>Conducting Facility and Laboratory Assessments of Safety Hazards (FLASH), Pre-Operational Safety Reviews (Pre-OSRs), Job Safety Analysis (JSAs).</p></li><li><p>Serve as safety support to assigned engineering organizations.</p></li><li><p>Conduct and/or support industrial hygiene surveys.</p></li><li><p>Conduct mishap investigations.</p></li><li><p>Regular report writing.</p></li><li><p>Participate in lead and/or asbestos abatement activities, etc., as determined appropriate and necessary.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$85,800 - $107,016<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Safety-and-Health-Engineer-II_R4338",
    "jobReqId": "R4338",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 25 Days Ago",
    "startDate": "2023-05-25",
    "timeType": "Full time",
    "title": "Safety and Health Engineer II"
  },
  "userAuthenticated": false
}
