{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Procurement-Quality-Assurance-Engineer_R4606",
    "id": "db763f83b2ba10015b3cdf4acf890000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Quality Assurance Office provides confidence that hardware and software products work in the extreme conditions of space by providing independent verification that the critical requirements are implemented correctly during fabrication, integration, test and launch. As a Procurement Quality Assurance Engineer, you will be a member of the Procurement Quality Assurance Group (5127) and will report to the Group Supervisor.</p><p></p><p><b>Responsibilities:</b></p><ul><li><p>Perform onsite quality, manufacturing, process and electrostatic discharge assessments at numerous JPL suppliers of space flight hardware</p></li><li><p>Review requirements which include: drawings, technical standards and specifications and then auditing suppliers to ensure compliance is met, to document gaps in a clear and concise manner and to review proposed corrective actions</p></li><li><p>Lead a team of engineers, subject matter experts and quality personnel</p></li><li><p>Facilitate detailed preparations with the team prior to the audit, interfacing with the supplier, facilitating the onsite audit, and gathering all required post-audit reports for upload to the JPL Approved Supplier List (ASL) website</p></li><li><p>Conduct the following at suppliers, including (but are not limited to): hardware inspections, documentation reviews, test witnessing, non-conformance investigations as well as other flight hardware quality related activities with suppliers</p></li><li><p>Work with JPL flight projects to understand and apply procurement quality assurance methods and techniques as it pertains to associated suppliers, supporting efforts to identify and mitigate supplier risk</p></li><li><p>In partnership with JPL flight projects, serve as the Procurement Quality Assurance representative for flight project subcontracts reviews for risk identification and mitigation</p></li><li><p>Serve as a supplier quality engineering subject matter expert in supplier quality performance trouble shooting, supplier investigations and/or supplier performance improvement efforts</p></li><li><p>Lead and/or support various procurement quality assurance improvement initiatives</p></li><li><p>May be expected to travel up to 50%</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in Mechanical, Electrical, Manufacturing, Aerospace, Industrial Engineering, or related technical discipline with typically a minimum of 9 years of related experience; Master’s degree in similar disciplines with a minimum of 7 years related experience; PhD degree in similar disciplines with a minimum of 5 years related experience</p></li><li><p>Demonstrated experience in performing Supplier Quality Assurance in the aerospace industry or other comparable, highly regulated industries</p></li><li><p>Experience in one or more of the following areas: Quality Engineering, Configuration Management, Supplier Management, Supplier Quality Engineering, Supply Chain, Inspection techniques (non-destructive, electronics, mechanical), or Manufacturing processes</p></li><li><p><b><span>Extensive auditing experience along with experience performing auditor training and must hold the certification to AS9100D lead auditor</span></b></p></li><li><p><b><span>Extensive aerospace hardware quality inspection experience</span></b></p></li><li><p>Advanced knowledge of applicable industry standards in design, engineering, fabrication, integration, test and launch of space-flight hardware and supply chain.</p></li><li><p>Demonstrated proficiency in mechanical hardware assurance methods (inspection, test, analysis).</p></li><li><p>Experience in developing and maintaining Quality Assurance processes, plans and procedures.</p></li><li><p>Understanding of risks and risk management approaches.</p></li><li><p>Ability to write reports, analyze situations, and recommend solutions.</p></li><li><p>Demonstrated effective written and verbal communication skills, presentation skills and computer skills.</p></li><li><p>Demonstrated effective interpersonal and leadership skills, with demonstrated ability to lead strong cohesive teams and ability to interact with all levels of the organization in a diverse technical environment (design engineering, manufacturing, test, inspection).</p></li></ul><p></p><p><b>Desired Qualifications:</b></p><ul><li><p>Understanding of electronic/electrical/electromechanical, optical and/or mechanical manufacturing processes and associated inspection methods</p></li><li><p>Understanding of Process Variation, statistical process control and Deming’s approach to Systems</p></li><li><p>Experience as a quality assurance Engineer, manufacturing engineer, process engineer, supplier quality engineer, supply chain engineer</p></li><li><p>Experience in supply chain improvement efforts development and implementation</p></li><li><p>Experience in developing supplier quality/supply chain related metrics and identifying key performance indicators</p></li><li><p>Experience serving as an onsite QA resident at a supplier</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$127,816 - $157,560<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Procurement-Quality-Assurance-Engineer_R4606",
    "jobReqId": "R4606",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 9 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-07-26",
    "timeType": "Full time",
    "title": "Procurement Quality Assurance Engineer"
  },
  "userAuthenticated": false
}
