{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Academic-Part-Time-Thermal-Engineer-Intern_R4620",
    "id": "cae64fcd52b1100127d1b1d01f750000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Job Description<br /> </p><p>This position will be focused on the Mars Sample Return Lander mission working with the thermal engineering subsystem on thermal hardware, fluid system testing and development, and thermal design. Immediate tasks will include development testing in a thermal vacuum chamber, development testing of a check valve for the heat rejection system, and the inventory and delivery of flight temperature sensors.</p><p></p><p>Qualifications</p><ul><li>Must be currently enrolled at least half-time at a local accredited college or university pursuing a Bachelor&#39;s degree or Graduate degree in Mechanical Engineering, Aerospace Engineering, Thermal Engineering, Fluid Mechanics, Chemistry, Civil Engineering, Material/Science, Physics, Robotics, Structural Engineering, or related technical field.</li><li>Must be available to work part-time at JPL during the school year, 8-20 hours per week.</li><li>Knowledge in one or more of the following areas: mechanical design, computer-aided design (CAD), thermal analysis, thermal-fluids analysis, and mechanical analysis tool (FEA).</li><li>Coursework providing an understanding and application of standard principles, theories, concepts, and techniques in mechanical systems including structures, configuration, mechanisms, structural analysis, and integration and test.</li><li>Minimum GPA 3.0/4.0.</li></ul><p>What would help:</p><ul><li>General knowledge of applicable industry and/or academic practices and standards in mechanical design.</li><li>Experience with computer-aided design and drafting, and spacecraft flight hardware development and test. Working knowledge of mid-level CAD tools (i.e., Solidworks, Uni-graphics).</li><li>Testing experience with data acquisition systems, LabVIEW, and/or power supplies. Experience with thermal vacuum chambers.</li><li>Relevant internship experience</li><li>Demonstrated leadership abilities</li><li>Ability to solve mechanical design problems, perform trade studies, develop design requirements, perform piece part design, and coordinate fabrication, assembly, and qualification of hardware.</li><li>Good verbal and written communication skills with the ability to work in a team environment.</li></ul><p>The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Academic-Part-Time-Thermal-Engineer-Intern_R4620",
    "jobReqId": "R4620",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 25 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-01",
    "timeType": "Part time",
    "title": "Academic Part Time Thermal Engineer Intern"
  },
  "userAuthenticated": false
}
