{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Robotics-Technologist-V_R4400",
    "id": "753d3026a57c1001c453029013d80000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Wanted: A senior level <i>Robotics Technologist</i> with skills in software, machine vision and machine learning as they apply to robotic systems or remote sensing.</b></p><p></p><p><b>Opportunity:</b> To work with a world class multi-disciplinary team that originates and executes robotics technology development and space flight projects for terrestrial and planetary exploration applications. This role is focused on leading the development of highly complex algorithms and software to support robotics vehicles in aerospace, planetary and military applications in support of JPL (and other) missions. The candidate will work with various projects and translate their needs to configure the simulation and support any additional capabilities that the project might need.</p><p></p><p><b>Qualifications: </b></p><ul><li><p><b>Bachelor’s degree in Computer Science, Electrical Engineering, or related technical discipline with typically a minimum of 12 years related experience; Master’s degree in similar disciplines with a minimum of 10 years related experience; or a PhD in similar disciplines with a minimum of 8 years related experience.</b></p></li><li><p><b>Strong experience directing large groups of people in software, simulation and/or robotics</b></p></li><li><p>Able to direct and understand requirements for complex robotic or machine learning systems</p></li><li><p>Experience creating and approving plans for managing complex robotic engineering tasks</p></li><li><p>Experience establishing and/or negotiating requirements for robotic interfaces and systems</p></li><li><p>Experience leading the development of highly complex systems and teams or studies that impact NASA decision making</p></li><li><p>Have multidisciplinary and in-depth expertise that can be applied to the development on new systems or concepts</p></li><li><p>Experience being accountable for team results on all aspects of critical projects and assignments</p></li><li><p>Strong written and verbal communication skills to facilitate inter-team information flow and to support review of team products</p></li><li><p>Experience leading projects or activities that have many distinct components</p></li></ul><p></p><p><b>Preferred Qualifications: </b></p><ul><li><p>Management and/or Proposal Investigator experience</p></li><li><p>Strong, expert level knowledge in computer science, robotics and machine vision</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$203,424 - $254,176<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Robotics-Technologist-V_R4400",
    "jobReqId": "R4400",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "startDate": "2023-06-01",
    "timeType": "Full time",
    "title": "Robotics Technologist V"
  },
  "userAuthenticated": false
}
