{
  "jobPostingInfo": {
    "id": "8802291daa4e1000ca7eed8c364a0000",
    "title": "Engineering Applications Software Engineer III, SW Developer for DCD",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Be a software developer for Data Capture and Delivery (DCD) subsystem and other Telemetry, Tracking and Command (TTC) data delivery subsystems for NASA’s Deep Space Network (DSN).   These subsystems ensure that deep space flight mission telemetry, tracking, command and monitor data flow bidirectionally between the DSN subsystems and a flight projects ground data system reliably and on time.  Partner with DSN system engineering teams, DSN antenna tracking stations, flight mission customers and the DSN program office to design, implement and maintain new, improved and modified capabilities.  Participate in the planning, research and testing efforts for maintaining current computing hardware and selection of new hardware.  Following the DSN Service Capability Delivery process, participate in the design and implementation of next generation hardware and software for TTC and DCD subsystem deliveries. Incorporate best practices in software development processes and task quality measures and perform verification and validation of deliverables.  Will have responsibility for interfaces to other DSN subsystems, ensuring subsystem functional requirements are met, and system integration and deployment to the DSN antenna complexes (in California, Spain, and Australia) and the DSN Deep Space Operations Center (DSOC) at JPL.  Provide expertise to the operation and maintenance teams during delivery, installation, acceptance testing, training and operation of the Data Capture and Delivery subsystem and other TTC subsystems as needed. Participate in reviews and report to the section management and the DSN program office, as needed.</p><p></p><p><b><u>Skills</u></b></p><p><b>Required Skills</b>: BS degree in Computer Science, Electrical Engineering, Physics or a related discipline with 4-6 years of experience.   Extensive knowledge of C, C&#43;&#43;, Unix, Linux (Red Hat), scripting (Shell, Perl, Python) and networking.    Strong interpersonal skills with ability to interface with institutional and project management at all levels.  Excellent verbal and written communication skills and presentation skills.  Familiarity with system administration and tools, such as Oracle ILOM, and NetApp OnTap.</p><p></p><p><b>Desired Skills: </b>Understanding and advanced techniques in analyzing the Deep Space Network (DSN) subsystem problems and operational issues. Significant experience with DSN software development, especially in the areas of Data Capture and Delivery (DCD), and Downlink Telemetry Processing subsystems.  Proven ability using Harvest CM tool. Proven experience in developing and infusing new technology into DSN capabilities. Proven ability to partner with lead engineers to design and implement highly complex solutions for advanced telemetry data delivery. Knowledge of complete end-to-end development life-cycle process and competing concurrent engineering practices. Command of current industry and JPL software engineering standards and practices. Advanced knowledge in leading software system verification and validation. Some hardware knowledge or experience is a plus. Knowledge of YACC.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$121,368 - $156,624<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-22",
    "timeType": "Full time",
    "jobReqId": "R2580",
    "jobPostingId": "Engineering-Applications-Software-Engineer-III--SW-Developer-for-DCD_R2580-1",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "jobApplication": {
      "id": "4a13637d2a3e9000d1f16defd8520000",
      "dateCompleted": "August 29, 2022",
      "draft": false,
      "posted": false
    },
    "canApply": false,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Engineering-Applications-Software-Engineer-III--SW-Developer-for-DCD_R2580-1"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Software Engineer III for Small-body Ephemeris Development",
      "externalPath": "/job/JPL-Campus/Software-Engineer-III-for-Small-body-Ephemeris-Development_R3626-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-27"
    },
    {
      "title": "C++ Developer - Solar System Geometry Development Engineer",
      "externalPath": "/job/JPL-Campus/Solar-System-Geometry-Development-Engineer_R2037",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    }
  ],
  "userAuthenticated": true
}
