{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Senior-Oracle-DBA_R4546",
    "id": "c9a1e72849c11000d55150d7a5520000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Do you love problem solving, analyzing data and technical challenges? Do you like to squeeze the last bit of performance out of systems? Do you obsess about metrics and key performance indicators? Do you enjoy interacting with business partners and domain experts in building and maintaining high value IT solutions? We are looking for an Application DBA to do just that!</p><p><br />The Enterprise Business Information Services (EBIS) Division is undergoing a revolution in its information technology. We are moving to a cloud native architecture to respond quickly to JPL&#39;s current and future business needs. Our key organizational initiatives support the Laboratory in envisioning its future with the right set of business applications and tools, in a hybrid architecture encompassing multiple cloud and on premise services, with a balanced portfolio of open source and proprietary technologies, and middleware platforms to make it all work!</p><p><br />The Database &amp; Application Administration team within the EBIS Division is looking for a Database Administrator (DBA) to modernize its IT capabilities and solutions. This exciting opportunity focuses on supporting the database and middleware technologies for Oracle E-business suite and the ecosystems, as well as building out capabilities to automate support processes and optimize systems performance. The ideal candidate works independently and in collaboration with other team members in developing and supporting innovative solutions with agility and continuous improvement approach.</p><p><br />Candidates must exhibit JPL values of integrity, embrace innovation, build and operate an environment of openness and inclusion, and ensure quality in all that we do.</p><p><br /><u><b>Responsibilities</b></u></p><ul><li><p>Responsibilities include designing, configuring, and implementing databases as well as establishing standards, guidelines and procedures relating to database management and Oracle ERP implementation, maintaining system integrity, security, performance, availability and recoverability.</p></li></ul><p><br /><u><b>Job Requirements:</b></u></p><ul><li><p>Experienced in performing all facets of database administration activities including space management, backup &amp; recovery, performance monitoring, tuning, disaster recovery, risk mitigation, patching, and cloning.</p></li><li><p>Experienced in supporting FMW and application tier of Oracle EBS as well as the ecosystems, including software installation, upgrade, patching, cloning, concurrent processing, workflow management, performance tuning, troubleshooting and problem resolution.</p></li><li><p>Ability to create and maintain processes, standards, and documentation for various database activities and risk control to ensure database integrity and compliance.</p></li><li><p>Work closely with technical infrastructure and application development teams to design, develop, and implement Oracle Databases in support of development, test, and production environments.</p></li><li><p>Analyze project requirements and design solutions to ensure that databases are functionally appropriate, technically valid, and well-integrated in accordance with the business requirements, methods and standards throughout the project lifecycle.</p></li><li><p>Work with Storage Admins and other teams to establish and maintain backup policies and recovery procedures.</p></li><li><p>Work with Cybersecurity admins and/or relevant parties to implement and maintain database security policies, access privileges, and associated account provisioning.</p></li><li><p>Work with vendor support to resolve issues in an effective and timely manner. Perform incident and problem management and collaborate with Application Development and other support teams. Participate on-call duty and provide 24x7 support when required.</p></li></ul><p></p><p><u><b>Qualifications</b></u></p><ul><li>Bachelors with 9 years of related experience; Masters with 7 years of related experience; or PhD with 5 years of related experience.</li><li><p>Substantial Oracle Database Administration expertise.</p></li><li><p>Solid background in Oracle database as well as other 3rd party tool administration, configuration, load balancing, backup/recovery, sizing and space management, PL/SQL tuning, diagnostics.</p></li><li><p>Demonstrable experience in process automation with good knowledge of script development.</p></li><li><p>Experience with Informatica PowerCenter configuration or other ETL software.</p></li><li><p>Proficient use of Oracle&#39;s Enterprise Management (EM13c) tool.</p></li></ul><p></p><p><u><b>Preferred Qualifications</b></u></p><ul><li><p>Working experience with DevOps practice and CI/CD pipeline process.</p></li><li><p>Proven knowledge with Linux OS and VM infrastructure as well as NetApp storage. </p></li><li><p>Solid experience with Oracle&#39;s Single Sign-On, Identity and Access Management (SSO, OID, OAM) as well as ECC and other key E-business suite peripheral configurations.</p></li><li><p>Experience with Oracle OCI, Amazon AWS and/or other cloud providers.</p></li><li><p>Good scripting skills with Unix shell scripts, WLST, Ansible, Python and/or other scripting tools.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$136,864 - $171,080<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Senior-Oracle-DBA_R4546",
    "jobReqId": "R4546",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 7 Days Ago",
    "startDate": "2023-07-17",
    "timeType": "Full time",
    "title": "Senior Oracle DBA"
  },
  "userAuthenticated": false
}
