{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/RF-Microwave-Engineer-III--TMS-_R4650",
    "id": "7b80074bcd9710012586afed2e470000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>As an <b>RF Microwave Engineer III </b>you would be joining the <b>JPL’s </b><b>Electronics, Software, and Microwave Instruments Section</b>, which provides leadership and unique world-class expertise in instrument electronics, programmable logic, and software and is also home to 40 engineers, scientists, and technicians specializing in developing microwave, submillimeter wave, and THz instrumentation for remote sensing of the earth, the solar system, and deep space. You will report to the Group Supervisor of the <b>Submillimeter-Wave Advanced Technology Group.</b></p><p></p><h2><b>Tasks include but not limited to: </b></h2><ul><li><p>Develop codes and algorithms for inverse design leading to meta-surface and volumetric meta-optics based optical and terahertz components for submillimeter-wave instruments  </p></li><li><p>Support RF and microwave engineering tasks within the Submillimeter-Wave Advanced Technology Group.</p></li><li><p>Develop  millimeter wave and submillimeter wave components for technology demonstrations and for suborbital and space-based instruments</p></li><li><p>Develop operational and technology demonstration suborbital instruments.</p></li><li><p>Develop space-based instruments for a variety of missions including Earth atmospheric sounders, astrophysics imagers, and planetary sounders.</p></li><li><p>Perform analytic work, propose innovative concepts to technology research calls from various agencies and offices, and document work in technical reports.</p></li><li><p>As part of interdisciplinary teams, develop concepts and architectural studies for future space missions to answer questions important to science and society.</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in Electrical Engineering or related technical subject area with typically a minimum of 6 years of related work experience; Master’s degree in similar subject areas  with a minimum of 4 years of related work experience; or Ph.D. in similar fields with a minum of 2 years of related experience.</p></li></ul><ul><li><p>Experience in the design of submillimeter-wave components using advanced inverse design algorithms</p></li><li><p>Experience in the design and characterization of energy coupling structures such as meta-optical lenses and mirrors for THz frequencies</p></li><li><p>Experience in the design of submillimeter-wave components including use of circuit/EM simulation software tools</p></li><li><p>Experience in the characterization of millimeter and submillimeter-wave components, subsystem and systems utilizing vector network analyzers</p></li><li><p>Advanced technical knowledge and background in advanced Radio Frequency (RF) design, analysis and testing as related to passive and active millimeter and submillimeter wave components and subsystems.</p></li><li><p>Experience presenting technical topics to engineers and scientists in team meetings and scientific conferences.</p></li><li><p>Excellent analytical skills, with history of significant publications in the field.</p></li><li><p>Excellent interpersonal skills and the ability to work well in a team environment.</p></li></ul><p></p><p><b>Preferred Skills</b></p><ul><li><p>Experience in the development of codes and design algorithms for meta-surface and volumetric meta-optics based optical and terahertz components for phased-arrays at submillimeter-wave frequencies</p></li><li><p>Knowledgeable and able to work in the micro-fabrication laboratory for fabricating silicon based volumetric meta-optics components</p></li><li><p>Experience in developing microwave/millimeter/submillimeter wave spectrometers and characterization of their calibration stability and sensitivity</p></li><li><p>Experience with developing instrument requirements and conducting trade studies to balance cost, complexity, and science return</p></li><li><p>Ability to lead a multi-disciplinary, industry and/or academic team and working across a broad spectrum of technical subject areas to formulate concepts, requirements and designs.</p></li><li><p>Proven ability to write compelling and winning research proposals.</p></li></ul><p></p><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$126,568 - $153,816<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "RF-Microwave-Engineer-III--TMS-_R4650",
    "jobReqId": "R4650",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 2 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-08",
    "timeType": "Full time",
    "title": "RF Microwave Engineer III (TMS)"
  },
  "userAuthenticated": false
}
