{
  "jobPostingInfo": {
    "id": "32bbf743df7110015dc698d789860000",
    "title": "HR Generalist- Engineering & Science (Temporary)",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Your Mission</b></p><p>As part of a forward-looking <b>Human Resource team</b>, the <b>HR Generalist </b>will be focused on developing and retaining the talent needed for the workforce of the future. The Lab is flourishing and HR is empowered to help build and advance the business.  With flagship missions currently underway, you will model the future of business and HR partnership at JPL and shape what this important function will look like over the next decade.</p><p></p><p>You will partner with Management and employees to provide world-class human capital strategies, processes, and solutions and support the organization in developing and hiring the best talent in the world to explore the farthest reaches of space. Your client base includes <b>Science, Research, Technology, and Engineering focused employees within the Engineering &amp; Science Directorate (ESD),</b> at the Section level. ESD provides the specialists in every discipline required to enable and build one-of-a-kind space missions that yield scientific discoveries. We bring together the resources of a diverse community of people, equipment, and facilities in-work processes that are ingrained in the culture of the organization.</p><p></p><p><b>Tasks include but not limited to: </b></p><p></p><p>As an<b> HR Generalist </b>you will provide development, coordination and support to an ESD Section in the execution of talent development and support activities.  You will also partner with the <b>Head of HR Business Partners</b> on HR strategic projects in the areas of Career Development, Data Analytics, and Succession Planning, and focus on the following areas:</p><ul><li><p><b>Strategic Workforce Planning:</b>   Implement and execute an approach for both leadership and workforce planning that ensures the right talent in the right place at the right time within a highly matrixed environment. Execute capability, and partner with Recruiting and clients, to ensure the organization’s ability to attract, retain and develop the best talent at all levels. </p></li><li><p><b>JPL Relationship Building: </b>Develop strong working relationships with managers and employees across all departments, ascertaining their needs, and partnering with them as appropriate on HR related processes, and activities. Work through any resistance, establish credibility, demonstrate sensitivity to manager and employee’s needs, and make it easy for managers and employees to partner with HR in a productive manner.</p></li><li><p><b>Talent Management:</b>   Support succession planning, talent reviews, identification, and development of top talent and training needs.  Facilitate annual processes, including compensation decisions and communications to employees. Execute a structured process for high-potential identification and ensure a strategic approach to Rewards &amp; Recognition.</p></li><li><p><b>Learning and Development:</b>  Facilitate the identification and development of custom training (technical and developmental). Partner with our HR COEs to implement identified solutions. Support continuous coaching of employees by assessing content, timing, and effectiveness of conversations</p></li><li><p><b>Compliance: </b>Serve as the Subject Matter Expert for compliance and maintain in-depth knowledge of legal requirements related to day-to-day management of employees, reducing legal risks and ensuring regulatory compliance. Provide HR policy guidance and interpretation. Partner with employee relations, ethics, and the legal department as needed/required.<br /><b>Employee Relations</b>: Manage and resolve employee relations issues through coaching and advising. Partner to conduct effective, thorough, and objective investigations. Provide day-to-day performance management guidance to line management (e.g., coaching, counseling, career development, disciplinary actions).</p></li><li><p><b>Diversity: </b>Develop innovative solutions and approaches to ensure a culture that supports diversity and inclusion including development of diverse candidate pools, mentoring programs, and succession plans.</p></li><li><p><b>Metrics/Analytics:</b>  Develop human capital based predicative analytics/leading indicators, dashboards, and metrics that support action planning and decision making for the Section. Consult to use data in meaningful ways that impact decisions and the future direction of the organization. </p></li></ul><p></p><p><b>What you get to do in your first year at JPL</b></p><ul><li><p><b>Immerse yourself in JPL:</b> Proactively learn the organization structure, culture, HR programs and establish relationships with your team, HR leadership, and client group.</p></li><li><p><b>Model effective business partnership:</b> Advance the relationship of HR with the business by navigating the complex business environment, building credibility and identifying quick wins from which to build future successes.</p></li><li><p><b>Run your “Business:</b> Understand your client, their business, and partner with client leaders and employees to determine the right human capital strategy and project work to best support the business and their goals.</p></li></ul><p></p><p><b>Qualifications - Here’s what you will bring:</b></p><ul><li><p><b>Bachelor’s degree with an advanced degree preferred, 3&#43; years relevant HRBP or HR Generalist work experience; Masters degree with 1&#43; year relevant HRBP or HR Generalist work experience</b></p></li><li><p>Outstanding leadership and coaching skills and has experience interfacing and making presentations to senior management</p></li><li><p>Experience in consulting with business units about workforce planning, talent assessments, and performance management</p></li><li><p>Demonstrated success in developing and implementing a variety of human capital strategies in support of business objectives and goals</p></li><li><p>Strong influencing skills and ability to build and maintain highly effective working relationships across all areas of the business</p></li><li><p>A track record of leading and implementing organization-wide process improvement initiatives within a technical environment</p></li><li><p>Strong understanding of federal and state employment laws and regulations as it pertains to employment related matters</p></li><li><p>Excellent communication, problem solving, and negotiation skills</p></li><li><p>Ability to effectively navigate in a matrixed environment</p></li><li><p>Proven ability to develop, maintain, and deliver against a project plan for all aspects of assigned projects</p></li><li><p>Ability to exercise independent judgement, discretion, and confidentiality</p></li><li><p>Experience with an organization in the Aerospace/Defense Industry is a plus </p></li><li><p>Experience in an HRBP role supporting STEM talent in the fields of engineering or software is preferred</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Coaching and management communication training</p></li><li><p>Experience supporting science, technology, engineering, or mathematics (STEM) teams highly preferred</p></li><li><p>Degree(s) or experience in a technical area such as Engineering, Statistics or Software</p></li><li><p>Ability to incorporate industry best practices into an organization<br /> </p></li></ul><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$78,208 - $97,552<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 5 Days Ago",
    "startDate": "2023-03-15",
    "timeType": "Full time",
    "jobReqId": "R4072",
    "jobPostingId": "HR-Generalist--Engineering---Science--Temporary-_R4072",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/HR-Generalist--Engineering---Science--Temporary-_R4072"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "HR Generalist - Information Technology  (Temporary)",
      "externalPath": "/job/JPL-Campus/HR-Generalist---Information-Technology---Temporary-_R4071",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 5 Days Ago",
      "startDate": "2023-03-15"
    }
  ],
  "userAuthenticated": false
}
