{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Postdoc--Radar-Data-Analysis_R4576",
    "id": "c9a1e72849c110020120a79b2e290000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and on Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and in communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to both contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The Postdoctoral scholars at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</p><p></p><p>The Atmospheric Physics and Weather Group carries out weather and climate research, studying processes and phenomena related to moist thermodynamics and the hydrologic cycle in the atmosphere. These range from small-scale processes such as convection, clouds and precipitation to large-scale phenomena such as tropical cyclones, severe storms, atmospheric rivers, and climate-variability phenomena such as the Madden-Julian Oscillation, ENSO, and monsoons, as well as global climate trends.</p><p></p><p><b>Postdoc’s tasks: </b></p><p>The selected postdoc will join the Earth Science Section at JPL. There is an observational and modeling component to the research the candidate will perform. The observational component will involve the analysis of particle size distribution information from airborne campaigns, with the goal of incorporating this information into radar and microwave radiative transfer models. The modeling component involves use of radar and passive microwave radiative transfer models and instrument simulators, in concert with high resolution numerical simulations, to aid in the preparation for future spaceborne observing systems. The overall aim is to prepare for future synergistic retrievals of cloud and precipitation data, leveraging the spatial relationships among cloud and thermodynamic variables.</p><p>The selected individual will be working with other postdocs and research scientists in a highly collaborative research environment at JPL. The postdoc will be expected and encouraged to present the results of the research at conferences and in peer reviewed journal articles.</p><p></p><p><b>Qualifications: </b></p><p>Applicants must have a Ph.D. in atmospheric sciences, or a closely related field.</p><p>The successful candidate should be highly self-motivated and have excellent oral and written communication skills. They should have a strong background in analysis of satellite and/or surface-based radar remote sensing data and in the use of microwave and radar simulators, especially for the analysis of the structure, physics, and dynamics of clouds and precipitation. Particular expertise in cloud radar remote sensing and the use of Bayesian (e.g., optimal estimation) retrievals is desirable.</p><p></p><p>Applicants may be subject to additional program requirements by NASA. Postdoctoral Scholar positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years.</p><p>Candidates should submit the following to this site: CV, representative publications, contact information for three references, and a cover letter stating their research accomplishments and interests.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$82,180 - $82,180<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Postdoc--Radar-Data-Analysis_R4576",
    "jobReqId": "R4576",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 21 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-07-21",
    "timeType": "Full time",
    "title": "Postdoc: Radar Data Analysis"
  },
  "userAuthenticated": false
}
