{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Navigation-Engineer-II_R4286",
    "id": "91531aa0918f1000b9c09fe080a90000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p></p><p>Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>JPL’s Mission Design and Navigation Section 392 builds maps and tools for interplanetary navigation, designs efficient routes for spacecraft to reach remote solar system locations, and safely pilots spacecraft to their ultimate destination. We are responsible for: mapping the trajectory design and navigation trade-space to efficiently maximize science return while adhering to operational constraints and mitigating mission risks, science-based modeling, filtering and optimization, balancing trajectory knowledge and control, and quantifying observability and uncertainty.</p><h2></h2><h2>Responsibilities</h2><p>Want to be an interplanetary navigator? As a member of the Outer Planet Navigation Group (392J) and the Psyche and Dragonfly Navigation Teams, your primary responsibility will be performing orbit determination (OD) analysis during the development phase and operational OD after launch. This involves gathering various input files and parameters, processing simulated and flight radiometric tracking data using the section’s MONTE navigation software to compute the orbits and their uncertainties, reporting the results both internal and external to the navigation teams, and disseminating the trajectory during operations. You will work with team members to analyze and evaluate the results. In addition, as a member of 392J, you will also have the opportunity to work on future proposals (e.g., New Frontiers and Discovery), collaborate with external partners, for existing and projected missions to the outer planets, asteroids, and comets, as well as perform research in the areas of Optical and Autonomous Navigation. You will report administratively to the 392J Group Supervisor and will programmatically report to the Psyche and Dragonfly Navigation Team Chiefs.</p><h2></h2><h2>Required Skills</h2><ul><li>Bachelor’s with 3 years of related experience, Master’s with 1 year of related experience, or PhD with 0 years of related experience in Aerospace Engineering, Astronautical/Aeronautical Engineering, Physics, Mathematics, or related major.</li><li>Broad knowledge of astrodynamics and spacecraft navigation.</li><li>Expertise in statistics, probability, and random processes.</li><li>Must have excellent analytical and interpersonal skills.</li><li>Must thrive in a team environment as well as perform independent studies with little direct supervision.</li></ul><h2></h2><h2>Desired Skills</h2><ul><li>Operational experience with statistical Orbit Determination and the MONTE software set.</li><li>Experience with Optical Navigation algorithms, tools, and processes.</li><li>Proficiency in Python and/or C&#43;&#43;.</li><li>Familiarity with software development, git-based development, and unit testing.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$101,920 - $117,416<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Navigation-Engineer-II_R4286",
    "jobReqId": "R4286",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-05-08",
    "timeType": "Full time",
    "title": "Navigation Engineer II"
  },
  "userAuthenticated": false
}
