{
  "jobPostingInfo": {
    "id": "5c2e0fc91b14100171c5dae18d060000",
    "title": "Executive Communications Content Specialist",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is seeking an Executive Communications Content Specialist to support in the creation of Executive Communications materials on behalf of JPL’s Director, Deputy Director, and Associate Directors. You will have demonstrated experience in working with multiple technical stakeholders to collate information and build out narratives based upon a given direction. You will be responsible for creating a central repository of materials to ensure internal and external communications are consistent, accurate, are easily accessible and align with JPL brand guidelines. You will report to the Executive Communications Manager, part of JPL’s Communications and Education Directorate.</p><p></p><p><b>Key Responsibilities:</b></p><ul><li><p>Coordinates and curates technical materials and inputs to aid in the creation of communications materials including PowerPoint presentations, speaker notes, social media content, internal memos and employee events</p></li><li><p>Partners with JPL’s technical leads, scientists, engineers and JPL’s Office of Strategic Integration to ensure communication materials are current and accurately reflect JPL’s missions and wider business strategy</p></li><li><p>Works closely with other Communications disciplines including Employee Engagement, Media Relations, VIP visits, and JPL’s in-house design team to aid in the creation of content and ensure visibility</p></li><li><p>Shapes complex technical information into easily digestible formats</p></li><li><p>Manages multiple deliverables, inputs, and accuracy of information for final products</p></li><li><p>Builds PowerPoint narratives and slides suitable for senior level presentation and consumption </p></li><li><p>Ensures central repository of content detailing JPL’s missions and strategic positioning are up-to-date, accurate and consistent</p></li><li><p>Utilizes cloud and/or data storage and architecture for expert content management</p></li><li><p>Is a go-to point of contact for approved communication materials and templates related to Director, Deputy Director and Associate Directors engagement</p></li><li><p>Supports the Senior Executive Communications Strategist and Writer to amplify the voice of JPL’s Director in alignment with the Lab’s Strategic Plan</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in Communications, Advertising/Marketing, Public Administration , Public Policy, Business Development/Management, or related discipline with a minimum of 6 years of related experience. Technical/STEM-related degrees will also be considered. Advanced degrees or certificates in communications or public policy or similar fields desired but not required</p></li><li><p>Previous experience engaging, collaborating with, or supporting JPL science, engineering, or technology teams and missions and/or communication or education teams working with missions or research projects at JPL</p></li><li><p>Demonstrated experience and skill with setting up a repository and archive of communication materials/documents – to include version control, discretion and confidential handling</p></li><li><p>Previous experience with cloud or data storage and architecture for expert file and content management</p></li><li><p>Previous experience engaging with senior leadership to ensure effective delivery of required materials</p></li><li><p>Demonstrated skills in developing, managing, and organizing content for use by various stakeholders</p></li><li><p>Excellent collaboration skills and demonstrated experience in distilling complex information to make it accessible</p></li><li><p>Proven ability to partner at all levels within an organization</p></li><li><p>Excellent writing, producing and presentation skills, including developing and editing PowerPoint presentations</p></li><li><p>Exceptional attention to detail with good analytics skills</p></li><li><p>Highly organized, delivers materials with accuracy and on time</p></li></ul><p></p><p><b>Preferred Skills: </b></p><ul><li><p>Has good knowledge of strategic Lab-wide policies and procedures, NASA policies and procedures, and government regulations</p></li><li><p>Solid understanding of the Communications ecosystem of channels (events, media, social/digital, internal Town Halls etc…) and tactics</p></li><li><p>Ability to take initiative balanced with effective team collaboration</p></li><li><p>Experience in working with stakeholders in a highly technical organization</p></li><li><p>JPL experience a plus</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$81,432 - $103,896<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-22",
    "timeType": "Full time",
    "jobReqId": "R3133",
    "jobPostingId": "Executive-Communications-Content-Specialist_R3133",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Executive-Communications-Content-Specialist_R3133"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
