{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/SW-Cmptg-Sys-Undergraduate-Student-IV-3_R3930",
    "id": "870347114ed71001c58f8ea4fcbb0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><div><div><div><div><div><ul><li><div><div><div><div>Responsibilities:<br />As a summer intern for the Small-Scale Flight Software Group, you will be working for JPL&#39;s Flight Software and Avionics Systems Section that provides leadership and unique world-class expertise in Avionics Systems Engineering, Flight Software, and Avionics Integration, Test, and Operations. One of the Small-Scale Flight Software Group products is a reusable open-source software framework called F Prime (F´) that was developed with the goal of providing low-cost embedded flight software for many different small spacecraft and testbed projects. F´ is delivered in three major parts: a C&#43;&#43; reusable component framework, a code generation tool set, and a Ground Data System (GDS). The GDS is written in Python. It consists of a socket server to enable communications with a target C&#43;&#43; F´ based system, and client graphical user interface applications to enable control and monitoring of the embedded target. There are client APIs to provide a framework for performing integration testing. The F´ open-source distribution is located at <span>https://github.com/nasa/fprime.</span><br /><br />The intern will have the opportunity to enhance our F´ open-source product line by performing feature enhancements, resolving known bugs, and updating and creating documentation. The position involves software development to maintain legacy tools and C&#43;&#43; code bases and potentially create new capabilities. The intern will contribute in one or more of the following ways:<br />• Perform software development and test utilizing Python, Flask, Javascript, HTML and CSS.<br />• Learn about embedded middleware and improve our C&#43;&#43; component framework code base.<br />• Work with the CMAKE build system to enhance and develop new build system features<br />• Implement new advanced telemetry filtering, search, analysis, and visualization capabilities utilizing technologies such as Elastic Search, Google Charts, etc.<br />• Enhance and refactor the F´ code generation capability, which generates C&#43;&#43; and various other products from our domain specific XML.<br />• Enhance and refactor the front-end software modeling language (F”) and associated visualization and editing tools<br />• Develop tools for software testing at the unit and integration test levels.<br />• Present work for peer reviews to mentors and the Small-Scale Flight Software group.</div></div></div></div></li></ul></div></div></div></div><div><div><div><h2></h2></div></div><div><div><div><div><h2></h2></div></div></div></div></div></div><ul><li><div><div><div><div><p>Required Qualifications:</p><ul><li>Must be currently enrolled at an accredited college or university studying Computer Science, Software Engineering, or related subject matter;</li><li>Must be available to work full-time (40 hrs/wk) for 10 to 12 weeks;</li><li>Must have completed minimum two years of an accredited engineering or science undergraduate course of study;</li><li>Must have a minimum cumulative GPA of 3.0 out of 4.0;</li><li>Must be able to learn new technologies quickly and work independently;</li><li>Basic software courses and have working knowledge of Git, Python, Java, Javascript, HTML, CSS, XML, JSON and Linux shell scripts are necessary.</li></ul><p></p><p>Preferred Qualifications:</p><ul><li>A working knowledge of C&#43;&#43; language useful in understanding the F´ framework;</li><li>Understanding of CMake and GNU Make build systems;</li><li>An interest and some exposure to embedded systems including a basic understanding of C programming and microprocessors;</li><li>Knowledge of software design patterns such as: Singleton, Observer, Mediator, etc. useful;</li><li>Knowledge of concepts used within declarative interface definition languages.</li><li>Familiarity with Unified Modeling Language or at least one other method of software modeling and code generation desirable;</li><li>Knowledge of a techniques and frameworks used for unit and integration test (e.g. JUnit, etc.) desirable;</li><li>Knowledge of continuous build integration and test concepts;</li><li>Model View Controller (MVC) architecture familiarity is a plus;</li><li>Knowledge of a web framework such as Flask, VUE, etc. is desirable;</li><li>Knowledge of basic middleware concepts (i.e., broadcast, publish-subscribe, etc.).</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior</p></div></div></div></div></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "SW-Cmptg-Sys-Undergraduate-Student-IV-3_R3930",
    "jobReqId": "R3930",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-02-14",
    "timeType": "Full time",
    "title": "SW Cmptg Sys Undergraduate Student IV"
  },
  "userAuthenticated": false
}
