{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Group-Supervisor-for-Artificial-Intelligence--Observation-Planning-and-Analysis-Group--397K-_R2466",
    "id": "d410e3de0df21001b2786f69eb0d0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Planning and Execution System Section is looking for a Technical Group Supervisor to lead the Artificial Intelligence, Observation Planning and Analysis Group, 397K. You&#39;ll work with Section Management as well as other Group Supervisors in the continuous evolution and improvement of Section capabilities, services and workforce expertise.</p><p></p><p>The Artificial Intelligence, Observation Planning and Analysis Group develops, deploys and operates observation planning and analysis technologies used in flight and ground systems. The group specializes in developing AI technologies that automate and support scientists and engineers in geometry-intensive planning and analysis of remote and in-situ observations. Application areas include, but are not limited to, observation planning and analysis for flyby, orbital, tour, surface and underwater observing systems and the network there of. The group researches, develops, deploys and operates geometry-intensive planning systems and technologies as well as partners with other organizations to integrate and deploy geometry-intensive planning systems into flight and ground systems.</p><p></p><p>The Section Management, working with the 397K Group Supervisor and the Group Supervisor of the sister group, Artificial Intelligence, Integrated Planning and Execution Group, 397I, may also consider future opportunities to reorganize the two groups and their charters based on the strategic needs.</p><p></p><p><b>What a Group Supervisor does in 397:</b></p><p><b>Personnel Management</b></p><ul><li>Manages a team of approximately 15 data science and systems engineers</li><li>Hires and retains a diverse, highly qualified staff,</li><li>Provides career mentoring, growth, and personal development for direct report JPL employees.</li></ul><p></p><p><b>Technical Management</b></p><ul><li>Stays in sync with and improving relevant mission operations processes and standards.</li><li>Quality of technical work produced by members of the group (including supporting proposals in formulation, flight project implementation and operations), and will serve on review boards and participate in peer reviews when as needed</li><li>Supports Section objectives to advance the state of the art in planning and execution systems</li><li>You&#39;ll be responsible for the local procedures and cost models relevant to the group’s work.</li></ul><p></p><p><b>Qualifications – </b></p><p>Typically requires a Bachelor&#39;s degree in Data Science, Computer Science, or related discipline with a minimum of 9 years of related experience; Master&#39;s degree in similar subject areas with a minimum of 7 years of related experience; or PhD in similar fields with a minimum of 5 years related experience. Minimum of 2 years of lead experience.</p><ul><li>Broad experience in automation and analysis systems for time series data or robotic autonomous systems.</li><li>Extensive knowledge of Artificial Intelligence, Optimization, Scheduling, Resource Allocation, Operations Research, or related fields.</li><li>Experience in wide application of principles, theories, concepts and techniques in modern programming languages such as C&#43;&#43;, Python, Java, Hadoop map-reduce, R, Ruby, SAS, Artificial Intelligence Techniques and concepts.</li><li>Significant knowledge in one or more related fields of the following areas: software development, artificial intelligence, operations research, resource allocation mechanisms, quantitative modeling, machine learning, computer vision, risk models and probabilistic methods.</li><li>Excellent communication skills including verbal, written, and presentation.</li><li>Demonstrated leadership and team-building skills commensurate with a dynamic work environment.</li><li>Demonstrated ability to lead systems engineering activities; successful track record in a Principal Investigator, PDM, Cog-E, or task leadership role in planning and execution systems.</li><li>Ability to attract, develop and retain high-performance members for the group.</li><li>Ability to develop and communicate a group strategy based on organizational goals.</li></ul><p></p><p><b><span>NOTE: This position may be classified at a level higher than the posted level. A determination will be made once the final candidate has been identified.</span></b><span> The typical full time equivalent annual hiring range for this job at a level higher in Pasadena, California.</span> <span>$169,208 - $220,896</span></p><p></p><p><b>Preferred Skills: </b></p><ul><li>Considered an expert in the automation and analysis systems from development through operations.</li><li>Extensive experience in all phases of project life cycle, especially implementation and operations.</li><li>Experience in the development of planning and execution operations concepts, operations plans, processes and infusion of automation operations technology into missions.</li><li>Has complete knowledge of Laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications.</li><li>Knowledge of JPL Project and Program Offices.</li><li>Familiarity with NASA&#39;s Advanced Multi-Mission Operations System (AMMOS) tools.</li><li>Experience in building relationships with other NASA centers, Universities, industry partners, or other entities related to JPL&#39;s expertise in Artificial Intelligence.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$140,920 - $178,464<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Group-Supervisor-for-Artificial-Intelligence--Observation-Planning-and-Analysis-Group--397K-_R2466",
    "jobReqId": "R2466",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 17 Days Ago",
    "startDate": "2023-07-07",
    "timeType": "Full time",
    "title": "Group Supervisor for Artificial Intelligence, Observation Planning and Analysis Group (397K)"
  },
  "userAuthenticated": false
}
