{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Facilities--Electrical-Construction-Manager-II--Individual-Contributor-_R4534",
    "id": "4e57a7183d181001590f20bcdeb50000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This position is an integral part of the Facilities Division at JPL. You will be part of the Division that supports missions through facility modifications and upgrades, to continue to do the science at this preeminent institution.  You <b>will manage a diverse range of electrical construction projects,</b> all to bring our office and laboratory spaces up to world-class standards with the goal of making work areas future-thinking to support the Missions of JPL. By successfully applying your expertise in electrical construction of buildings and facility infrastructure, you will directly impact JPL’s continued success in the exploration of space.</p><p></p><p><b>The Construction Manager at JPL will:</b></p><ul><li><p>Report to the Group Supervisor for Construction Administration within the Engineering and Construction Section of the Facilities and Logistics Division.</p></li><li><p>Execute electrical construction projects. </p></li><li><p>Using your expertise and experience, provide technical, management and oversight of the installation/construction contractors that you are assigned.</p></li><li><p>Support all facets of the installation/construction process of capital improvement projects; such as during development, study, concept/schematic design, construction document development, procurement, construction, and close-out phases.  Project values range from $10K to greater than $1M.</p></li><li><p>Manage multiple projects running in parallel, sometimes with competing priorities.</p></li><li><p>Develop and maintain professional working relationships with project stakeholders at JPL.  Interface and coordinate with JPL clients and partner with JPL organizations on the development and execution of construction projects.</p></li><li><p>Support managing contracts, budgets, schedules, output quality and relationships with external design and consulting professionals, key suppliers, and construction subcontractors for assigned projects.</p></li><li><p>Report project status (safety, cost, schedule, and quality) and issues/problems to management.</p></li><li><p>Develop scopes of work for time and material construction projects based on user requirements.</p></li><li><p>Perform detailed investigations of existing sites/buildings including availability of utilities, environmental and safety hazards, and impacts to occupants in or near the proposed project work area. Identify and make recommendations for how to address any issues.</p></li></ul><p></p><p><b>The following qualifications are required:</b></p><ul><li><p>Typically requires a Bachelor’s degree in Construction Management, Electrical Engineering or relevant discipline with a minimum of 3 years related experience or Master’s degree in similar disciplines with a minimum of 1 year related experience.</p></li><li><p>Demonstrated construction management experience on electrical installation/construction projects.</p></li><li><p>Some experience leading electrical construction management projects.</p></li><li><p>Knowledge in the Facilities construction management field with focus on electrical construction projects.</p></li><li><p>Demonstrated experience coordinating internal and external work groups and individuals associated with the completion of facilities construction projects.</p></li><li><p>Construction Management experience associated with institutional infrastructure, site structures, utility systems, low and medium-voltage infrastructure and equipment.</p></li><li><p>Work with and support Project Managers assigned to the Facilities Engineering and Construction Division.</p></li><li><p>Working knowledge and experience with the latest safety practices and requirements in the facilities design and construction industry.</p></li><li><p>Excellent verbal and written communication skills.  Ability to effectively communicate with supervisor, Facilities Project Administrators, other Facilities Construction Managers, as well as contractors, consultants and customers.</p></li><li><p>Understanding and experience with construction contracting methods (design-bid-build, design-build, fixed-price, task order, time &amp; materials) and evaluation methods (low bid, best value, evaluated procurement). </p></li><li><p>Good working knowledge and experience with developing engineering and construction schedules, RFP packages, SOWs, estimates, budgets, spend plans and management of RFIs and change orders. </p></li><li><p>Working knowledge and experience with the CBC, NFPA70, and NEC.</p></li><li><p>Proficient with Microsoft Office suite of programs including MS Project, and familiarity with project management software.</p></li></ul><p></p><p><b>The following qualifications are preferred:</b></p><ul><li><p>Experience working in a Federal government setting, familiarity with NASA/JPL policies and procedures.</p></li><li><p>Construction management experience as owner’s rep for a multi-facility campus or property.</p></li><li><p>Experience with redundant power systems, generators and UPS.</p></li><li><p>Knowledge of utilizing Bluebeam Software as a review and documentation tool. </p></li><li><p>Working knowledge of TRIRIGA and Meridian Facilities management programs.</p></li><li><p>Working knowledge of the Americans with Disabilities Act (ADA) requirements.</p></li><li><p>Electrical Inspection certification</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$82,264 - $115,024<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Facilities--Electrical-Construction-Manager-II--Individual-Contributor-_R4534",
    "jobReqId": "R4534",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 29 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-07-12",
    "timeType": "Full time",
    "title": "Facilities, Electrical Construction Manager II (Individual Contributor)"
  },
  "userAuthenticated": false
}
