{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Senior-Human-Resources-Business-Partner_R4561",
    "id": "c9a1e72849c110016bdcb0cd9dc70000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Imagine being a <b>Senior ​</b><b>HR Business Partner</b> in an environment where Talent Management is at the forefront. Where Workforce 2025 isn’t just a buzzword but an executive mandate and the next generation of leaders is being developed to tackle quests that push the boundaries of our imaginations. Bring your passion for building talent strategies and put your stamp on initiatives that will make an immediate and far reaching impact. JPL is a world-class organization, performing world-class work. On the cutting edge of space exploration technology and science, you are working with the best and brightest creative and technical minds, at all levels across the laboratory.</p><p></p><p>As part of a forward-looking <b>Human Resource team</b>, you are focused on developing and retaining the talent needed for the workforce of the future. The Lab is flourishing and HR is empowered to help build and advance the business.  There are no lay-offs or restructurings to navigate. With five flagship missions currently underway, you will model the future of business partnership at JPL and shape what this important function will look like over the next decade.</p><p></p><p><b>Your Mission</b></p><p>Partner with Management and employees at all levels to provide world-class human capital strategies, processes, and solutions and support the organization in developing and hiring the best talent in the world to explore the farthest reaches of space. Your client base for this role is approximately 900 Engineering focused employees. You will also partner with the Head of Talent Management on HR strategic projects in the area of Career Development, Data Analytics, and Succession Planning.</p><p></p><p>To achieve the mission for this position, you must produce the following critical actions and results:</p><ul><li><p><b><u>Develop &amp; Support Strategy:</u></b> Define a strong human capital strategy, process, and capability that will ensure the organizations ability to attract, retain and develop the best talent at all levels and is scalable to address surges and dips in talent needs across the Lab. </p></li><li><p><b><u>JPL Relationship Building:</u></b> Develop strong working relationships with managers and employees across all departments, ascertaining their needs, and partnering with them as appropriate on HR related processes, and activities. Work through any resistance, establish credibility, demonstrate sensitivity to manager and employee’s needs, and make it easy for managers and employees to partner with HR in a productive manner.</p></li><li><p><b><u>Talent Management:</u></b> Partner with Business Administration Managers (BAM), compensation specialists, and other key HR team members, to plan for the future needs of the JPL workforce, in alignment with the strategy and goals of the organization. Support succession planning, talent reviews, identification and development of top talent and training needs.</p></li><li><p>Serve as the Subject Matter Expert for compliance and maintain in-depth knowledge of legal requirements related to day-to-day management of employees, reducing legal risks and ensuring regulatory compliance. Provide HR policy guidance and interpretation. Partner with the legal department as needed/required.</p></li><li><p><b><u>Employee Relations:</u></b> Manage and resolve employee relations issues through coaching and advising. Conduct effective, thorough and objective investigations ensuring open yet discreet communications and an unbiased disposition. Provide day-to-day performance management guidance to line management (e.g., coaching, counseling, career development, disciplinary actions).</p></li><li><p>Develop innovative solutions and approaches to ensure a culture that supports diversity and inclusion including development of diverse candidate pools, mentoring programs and succession plans.</p></li><li><p>Improve the gathering of information on key human capital indicators to support effective decision-making.  Ensure that the department is measuring its human capital in meaningful ways that impact decisions and the future direction of the organization.</p></li></ul><p></p><p><b><u>What you get to do in your first year at JPL</u></b></p><ul><li><p><b>Immerse yourself in JPL</b>: Proactively learn the organization structure, culture, HR programs and establish relationships with your team, HR leadership and client group.</p></li><li><p><b>Model effective business partnership</b>: Advance the relationship of HR with the business by navigating the complex business environment, building credibility and identifying quick wins from which to build future successes.</p></li><li><p><b>Run your “Business&#34;</b>: Each Division at JPL is like it’s own small business. Understand your client and their business and partner with your client leaders and employees to determine the right human capital strategy and project work to best support the business and their goals.</p></li></ul><p></p><p><b>Qualifications:</b></p><p></p><p><b>Here’s what you will bring:</b></p><ul><li><p><b>Bachelor’s degree with an advanced degree preferred.</b></p></li><li><p><b>10&#43; years relevant HRBP or Sr. HR Generalist experience.</b></p></li><li><p>In addition to HRBP experience, you must have significant experience in one or more of the following: compensation, employee relations, talent management, continuous process improvement, change management, training, D &amp; I, and OD.</p></li><li><p>Outstanding leadership and coaching skills and has experience interfacing and making presentations to senior management.</p></li><li><p>Experience in consulting with business units about workforce planning, talent assessments and performance management.</p></li><li><p>Demonstrated success in developing and implementing a variety of human capital strategies in support of business objectives and goals.</p></li><li><p>Strong understanding of federal and state employment laws and regulations as it pertains to employment related matters.</p></li><li><p>Excellent communication, problem solving, and negotiation skills.</p></li><li><p>Strong collaboration skills with all levels within the organization.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Experience with an organization in the Aerospace/Defense Industry is a plus </p></li><li><p>Experience in an HRBP role supporting STEM talent in the fields of engineering or software is preferred</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$118,248 - $146,328<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Senior-Human-Resources-Business-Partner_R4561",
    "jobReqId": "R4561",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "startDate": "2023-07-19",
    "timeType": "Full time",
    "title": "Senior Human Resources Business Partner"
  },
  "userAuthenticated": false
}
