{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Electronics-Engineer-APX-Intern_R4734",
    "id": "eedf8c71f1f110010a73fc639c220000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>With an unmatched history creating groundbreaking advances in science and technology, JPL has been in the space exploration business since the beginning. Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>We resonate with people who are looking for ways to go further and offer an opportunity to be part of a team of passionate and dedicated engineers working with some of the world’s best capabilities and cutting- edge technology in science, technology, and engineering. The pride of working at JPL’s (NASA and Caltech) innovative work culture; we offer a comprehensive benefits plan, relocation, tuition reimbursement and generous Caltech retirement contributions.</p><p></p><p>The Radar Science and Engineering Section in the Communications, Tracking, and Radar Division conducts research, development, and flight mission development in the field of airborne and space borne remote sensing radar for NASA and other government agencies. This section specializes in systems and techniques related to synthetic aperture radar (SAR) imaging, radar interferometry, altimetry, Earth and planetary subsurface sounders, scatterometry, and atmospheric radars (clouds and precipitation, dynamics and gaseous species).</p><p></p><p>The section is also a leader in the area of planetary landing radars. Our radar program focuses on Earth and planetary science missions, with emphasis on first-of-a-kind radar systems and cutting-edge technology.</p><p></p><p><b><u>Responsibilities:</u></b></p><p>The candidate will develop Python, C, C&#43;&#43; and SCPI programs in Linux, ethernet network environment, and embedded systems to communicate with INCUS radar via a Zynq FPGA microprocessor that is acting as a space craft command/telemetry simulator, control test equipment and execute radar test operations. The task may also require FPGA firmware development. The intern will develop scripts based on SCPI commands, Python based libraries and programs, and then builds upon them to expand the software to run test cases for testing the radar at different stages of its integration and test activities. This task will require the intern to work with other team members on a) electronics components/PCB test, b) EGSE development and test, c) I&amp;T activities, d) and write test procedures and IBATS.  He will work in clean room, thermal ambient test, TVAC, and EMC labs to test and validate the operation of the radar. The test equipment used for this task include but are not limited to oscilloscope, signal generator, arbitrary waveform generator, power meters, power supplies, network analyzer, etc.….</p><p><b> <u> Requirements </u></b></p><p>Electrical Engineering Graduate student from a local university who is in good standing, is near end of his terminal degree (MS or Ph.D.) and is experienced in the following: Linux, ethernet network set up environment, Xilinx Zynq FPGA microprocessor based embedded system development, python (C, and C&#43;&#43;) software development, MATLAB software, working with test equipment, and electronics testing. Willing to work in person (not remote) at JPL as intern more than 25 hours per week.</p><p></p><p></p><p><b>Preferred Skills:</b></p><p>Prefer a student who had some leadership experience.</p><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Electronics-Engineer-APX-Intern_R4734",
    "jobReqId": "R4734",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-29",
    "timeType": "Part time",
    "title": "Electronics Engineer APX Intern"
  },
  "userAuthenticated": false
}
