{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Robotics-Manipulation-Controls-Technologist_R4637",
    "id": "cae64fcd52b1100200ab69a017af0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Wanted: A <i>Robotics Manipulation Controls Technologist</i> with a range of skills related to robotic manipulation kinematics, dynamics, controls, and autonomy.</b></p><p></p><p><b>Opportunity:</b> To work with a multi-disciplinary workforce that originates and implements robotics technology development and space flight projects for terrestrial and planetary exploration applications. This role is focused on supporting and leading the development of robotic manipulation controls and autonomy in the Mobility and Robotic Systems section at JPL.  Example projects include autonomous manipulation for Mars missions and an Ocean Worlds lander to Enceladus.</p><p></p><p>Responsibilities:</p><ul><li><p>The engineer will support one or more technology development or flight projects.</p></li><li><p>These projects will span research systems for NASA and non-NASA sponsors as well as NASA missions destined for space. </p></li><li><p>Standard duties for these projects include the development of manipulation kinematics, dynamics, controls, and autonomy algorithms and implementation in software for real time systems. </p></li><li><p>The roles could include robotic system concept development, publication of novel concepts, and proposal writing for NASA and non-NASA programs.</p></li><li><p>You may be working at the individual level with some oversite, as a part of a larger team, or leading a small technical team.</p></li></ul><p></p><p><b>Qualifications </b></p><p>What it takes:</p><ul><li><p><b>Bachelor&#39;s degree in Robotics, Aerospace Engineering, or related technical discipline with typically a minimum of 3&#43; of related experience; or </b><b>Master’s degree in Robotics, Aerospace Engineering, or related technical discipline with typically a minimum of 1&#43; years of related experience; or PhD with 0&#43; years of experience in similar disciplines.</b></p></li><li><p>Expertise related to kinematics, dynamics, control, and autonomy for manipulation and sampling systems.</p></li><li><p>General understanding and application of standard principles, theories, concepts and techniques in robotics concepts and software systems.</p></li></ul><p>What would help:</p><ul><li><p>General knowledge of applicable industry and/or academic practices and standards in software development and use of C programming language. </p></li><li><p>Development of software for embedded applications.</p></li><li><p>Demonstrated innovation, initiative, and leadership.</p></li><li><p>System engineering and software integration experience</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$109,408 - $139,672<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Robotics-Manipulation-Controls-Technologist_R4637",
    "jobReqId": "R4637",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 14 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-04",
    "timeType": "Full time",
    "title": "Robotics Manipulation Controls Technologist"
  },
  "userAuthenticated": false
}
