{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-Computing-Engineering-Academic-Part-Time--Undergrad-Intern_R4407",
    "id": "8378305239101000d18b8ba485e90000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Our missions are complex, long-lasting, far-reaching, and each one is unique. We’re constantly developing new mission-specific technologies. For engineers, researchers, scientists, and technologists who like to test the limits, JPL is a constant source of new stimulating challenges.</p><p></p><p>JPL is seeking highly motivated college and university students with intellectual curiosity to join our team and aid in our quest to ensure mission success. In this role you would be a vital team member in a JPL software or computing engineering group. You will partner with lead engineers to design, code, and develop secure software applications and interface solutions that power JPL’s spacecraft, science instruments, mission control systems, science analysis pipelines and IT services. You will integrate algorithms and models into software components for production and analysis of mission and enterprise data. You will use general understanding of the complexity and interdependence involved with integrating multiple applications with complex data sources, and deploying the resulting systems at sites worldwide and beyond.</p><p></p><h2><b>Responsibilities</b></h2><p>You will be working with the Aerie team as a software developer. The team completing a next generation activity planning application. The team&#39;s success is vital to the success operation of JPL&#39;s upcoming Europa Clipper mission. The team&#39;s work ranges from building a sequence and command expansion editor, simulation engine, developing capabilities to check mission flight rules, to designing and implementing new APIs.</p><p></p><h2>Task Deliveries:</h2><p>The task deliveries will follow the Aerie road map. The team follows an AGILE development methodology with frequent customer interaction. Task assignments may change as progress is made across the tool. Being comfortable with a dynamic timeline will help a new member succeed.</p><p></p><h2><b>Qualifications</b></h2><ul><li>Student is enrolled at least half-time at an accredited local college or university pursuing a Bachelor&#39;s Degree in a technical or engineering major related to work assignment with a graduation date of December 2023 or later</li><li>Must be available to work a minimum of 8 hours per week, with a maximum of 30 hours per week during the academic school year</li><li>Must be available to work during the Summer Full time (40 hours per week).</li><li>Minimum cumulative GPA 3.0 out of 4.0 or equivalent</li><li>Recently completed coursework providing an understanding and application of standard principles, theories, concepts and techniques in related work assignment</li><li>General knowledge of applicable industry and/or academic practices and standards in related work assignment</li><li>Relevant internship experience</li><li>Demonstrated leadership abilities</li><li>Good verbal and written communications skills with ability to work in a team environment</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Software-Computing-Engineering-Academic-Part-Time--Undergrad-Intern_R4407",
    "jobReqId": "R4407",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 5 Days Ago",
    "startDate": "2023-06-05",
    "timeType": "Part time",
    "title": "Software Computing Engineering Academic Part-Time, Undergrad Intern"
  },
  "userAuthenticated": false
}
