{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technologist-III_R4303",
    "id": "91531aa0918f10013a6be8bff8810000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p></p><p><b>The Microwave Instrument Science Group (386G)</b> develops microwave remote sensing instrument concepts, transforms science needs into performance specifications, calibrates sensors in the laboratory and in-operation, and fosters the scientific utilization of data from spaceborne, airborne, and ground-based systems. We develop novel algorithms to turn remote sensing observations in to science discoveries and maintain and improve existing algorithms in our operating fleet of Earth-based and planetary microwave radiometer systems. </p><p></p><p>We seek an individual with a passion for science and curiosity for discovery to join the Microwave Instrument Science Group (386G) as a <b>Technologist III </b>within JPL’s<b> Electronics, Software, and Microwave Instruments Section</b>. You will have an opportunity to be involved in the end-to-end development of ground-based, airborne and spaceborne sensors during all phases from the initial concept to operations. Responsibilities may include radiometer instrument development, calibration and retrieval algorithm development; assembly and test of space borne, airborne and ground based radiometer instruments; scientific analysis of radiometer data seeking new results in the areas of Earth-based atmospheric, oceanic and climate science as well as planetary science. You will work with various data sources including other satellite data and in situ data and will be expected to publish work in peer reviewed journals, attend and present work at conferences and seek new work by writing proposals to internal and external sponsors. </p><p></p><p><b>Specific Responsibilities Include:</b></p><ul><li><p>Develop, evaluate and continuously improve upon passive and active microwave retrieval algorithms for products such as ocean vector winds, precipitable water vapor and cloud liquid water</p></li><li><p>Validate satellite-based microwave retrieval products using ancillary fields from in situ or model sources</p></li><li><p>Work with scientists to develop new passive microwave radiometer technologies</p></li><li><p>Evaluate and improve upon retrieval algorithms for airborne and satellite microwave radiometers</p></li><li><p>Development new and innovative remote sensing approaches and products utilizing microwave radiometer sensors</p></li><li><p>Collaborate with scientists across many disciplines to support scientific utilization of radiometer data</p></li><li><p>Work with a variety of disparate datasets to support calibration and algorithm improvement</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in atmospheric science, electrical engineering, remote sensing or related technical discipline with typically a minimum of 6 years of related experience; Master’s degree in similar disciplines with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years of related experience.</p></li><li><p>Advanced knowledge in one or more of the following areas: atmospheric science, electrical engineering, microwave radiometer instruments, radiative transfer, satellite calibration techniques, inversion theory.</p></li><li><p>Experience with radiometric instruments, retrievals, or calibration in the microwave to sub-millimeter wave domain</p></li><li><p>Extensive understanding and wide application of principles, theories, concepts and techniques of microwave instrument design principals.</p></li><li><p>Strong interest in applying efforts to investigation of the Earth system, including atmospheric and ocean processes and climate variability.</p></li><li><p>Proven history of using some combination of analytical, experimental, and theoretical approaches to solving problems in the sub-disciplines of microwave radiometer science, radiative transfer and inversion theory.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Experience with developing airborne and ground-based radiometer instrumentation</p></li><li><p>Advanced knowledge of spaceborne radiometer development</p></li><li><p>Advanced knowledge of Laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications.</p></li><li><p>Advanced knowledge in C&#43;&#43;, Matlab, Python</p></li></ul><p></p><p></p><p><b>Note- A preferred candidate has been identified</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$103,064 - $141,648<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Technologist-III_R4303",
    "jobReqId": "R4303",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 22 Days Ago",
    "startDate": "2023-05-09",
    "timeType": "Full time",
    "title": "Technologist III"
  },
  "userAuthenticated": false
}
