{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Auditor-II_R4155",
    "id": "e69c71fb5b7e10015afcb85d3f150000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>We are seeking a motivated and analytical individual that can work well, both independently and in a team environment, to serve as an </span><b><span>Auditor II </span></b><span>in our Subcontractor Audit &amp; Compliance Office (SACO).  This unique opportunity is part of the Controller &amp; Financial Planning Office which supports the exploration and innovation of the laboratory&#39;s missions by working with our colleagues and subcontractors to guarantee compliance to the Prime Contract and maintain the integrity of JPL&#39;s financials.  The Office&#39;s functions encompass Institutional Accounting, Travel and Invoice Management, Financial Planning, Analysis &amp; Compliance, and the CFP Strategic Planning Office.  The Office ensures that the finance and accounting policy and procedures of the laboratory are efficient, effective, and compliant with relevant regulations so that JPL can &#34;Dare Mighty Things.&#34;  We pride ourselves on providing innovative solutions to overcome business challenges facing JPL on a regular basis.  Our collaborative teaming approach ensures us a unique window into the amazing work being accomplished at JPL.</span></p><p><span> </span></p><p><span>As an </span><b><span>Auditor II</span></b><span>, you will be responsible for performing and reporting on a wide range of complex subcontract related audits in connection with procurement and contracting activities between JPL and its various <span><span><span>subcontractors. </span></span></span> These audits will be conducted in accordance with the JPL business practices and the Government Auditing Standards (GAS).  You will provide audit support, accounting and financial analysis, and advisory services.</span></p><p><span> </span></p><p><b><u><span>Some Challenges You Will Tackle:</span></u></b></p><ul><li><p>Perform complex JPL subcontractor audits for multiple functions that cover a variety of areas.</p></li><li><p>Validate the costs incurred and billed, including final invoices, to ensure consistency and accuracy.</p></li><li><p>Analyze accounting, estimating, billing and timekeeping systems and related internal controls to ensure adequacy.</p></li><li><p>Evaluate proposed rates and factors.</p></li><li><p>Assess regulatory and contractual compliance.</p></li><li><p>Utilize risk-based assessment techniques to determine audit scope.</p></li><li><p>Assist in special ad-hoc audits and assignments for JPL Senior Management as requested.</p></li><li><p>Frequent interactions with customers and peers internal and external of the organization.</p></li><li><p>Exercise discretion and independent judgement in evaluating potential audit issues and recommending solutions.</p></li><li><p>Contribute as a key team member on teams inside or outside own organization, project, activity, or function.</p></li></ul><p></p><p><b><u>You Must Have:</u></b></p><ul><li><p>A Bachelor&#39;s degree in Accounting, Finance, or related discipline, with a minimum of 3 years of related experience; Master&#39;s degree in similar disciplines with a minimum of 1 year of related experience.</p></li><li><p>A complete understanding and wide application of principles, theories, and concepts in accounting and/or auditing.</p></li><li><p>Design mindset with the ability to represent and develop task and work processes for desired outcomes.</p></li><li><p>Ability to coordinate, write, edit, and produce a wide range of technical reports on subcontract audits and compliance with applicable regulatory requirements.</p></li><li><p>Demonstrated ability to work under pressure and meet commitments, including deadlines and budgets.</p></li><li><p>Advanced skills in PC/Windows platform and Microsoft Office.</p></li><li><p>Willingness to travel up to 30%.</p></li></ul><p></p><p><b><u>Got These?  Even Better:</u></b></p><ul><li><p>Basic knowledge or some exposure to one or more related fields of:  Cost Accounting Standards (CAS), Federal Acquisition Regulations (FAR), OMB Uniform Guidance and Government Auditing Standards (GAS) as it pertains to Government Contract Compliance and/or Government Procurement.</p></li><li><p>Desire to lead a multi-functional team for a project, activity, or function within scope of assigned responsibility.</p></li><li><p>Relish in developing creative and innovative solutions.</p></li><li><p>Ability to leverage new media literacy for efficient and persuasive communication.</p></li><li><p>Possess strong presentation skills and a working knowledge with supporting visual aids.</p></li><li><p>Some knowledge of Laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications including the NASA FAR Supplement.</p></li><li><p>Demonstrated ability to be adaptable, flexible, and resilient.</p></li><li><p>Possess sound business judgement and is detailed oriented in analyzing information and problems.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$79,352 - $93,288<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Auditor-II_R4155",
    "jobReqId": "R4155",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 15 Days Ago",
    "startDate": "2023-03-29",
    "timeType": "Full time",
    "title": "Auditor II"
  },
  "userAuthenticated": false
}
