{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-II---TS-SCI_R4445",
    "id": "bbec4f87682d1001b2ab42dea4d40000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>We are seeking a <b>Mission System Systems Engineer </b>to support the<b> National Security Program Office (NSPO)</b>. As a part of the <b>Special Programs Mission System</b> <b>Engineering Group (394Z),</b> you report administratively to the Technical Group Supervisor and programmatically to the Systems Engineering Lead.</p><p>You will be a Systems Engineer responsible for the supporting the development, implementation, and deployment of the Ground Data System (GDS), Science Data System (SDS), and Mission Operations System (MOS). This role ensures the Mission System meets the project needs and objectives. You will work with a multidisciplinary, cross-organizational teams inside and outside JPL.</p><p></p><p><b>Tasks include but not limited to:</b></p><ul><li>Support development and testing of mission operations processes and procedures</li><li>Participation in Verification &amp; Validation (V&amp;V) activities</li><li>Collaboration with subject matter experts (SME) to meet program objectives</li><li>Contribute to system trade studies and resolution of anomalies, discrepancies, and problems reported</li><li>Provide inputs to engineering and management reviews</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>Bachelor’s degree in engineering or related technical field with at least 3 years of related experience or a Master’s degree with at least 1 year of related experience</li><li>Expertise in Mission Systems and Operations</li><li>Ability to conduct, manage and complete technical and organizational trades involving mission science returns, mission design and risk.</li><li>Collaboration skills with all levels of institutional and operations personnel.</li><li>Understanding of ground systems and their use in mission operations</li><li><b>Must be a U.S. Citizen with an active Top Secret (TS) clearance based upon Single Scope Background investigation (SBBI) within a 5-year scope and must be approved for Sensitive Compartmented Information (SCI) accesses.</b></li></ul><p></p><p><b>Desired Qualifications:</b></p><ul><li>Understanding of JPL and DoD organizations</li><li>Knowledge of high-level programming languages such as Java, C&#43;&#43;, Python, etc.</li><li>Aerospace industry experience.</li><li>Strong analytical skills</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$102,752 - $125,216<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Systems-Engineer-II---TS-SCI_R4445",
    "jobReqId": "R4445",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 3 Days Ago",
    "startDate": "2023-06-15",
    "timeType": "Full time",
    "title": "Systems Engineer II - TS/SCI"
  },
  "userAuthenticated": false
}
