{
  "jobPostingInfo": {
    "id": "5fba210fbccb10020b9a04dcce6d0001",
    "title": "Software Systems Engineer III",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Are you passionate about discovering and implementing new technology to improve software testing and space exploration? If so, we invite you to join our dynamic team as a member of the Mission Control Systems (MCS) System Integration, Test &amp; Deployment Group (393B).</p><p>As a part of this team, you will play a crucial role in ensuring the successful delivery of the Mission Control Systems. Responsibilities involve detailing, planning, and implementing Verification and Validation (V&amp;V) processes to ensure that requirements are thoroughly verified and that a verification method exists for each.</p><p>Join our team and help to drive innovation in the exciting fields of software verification and space exploration. Apply now to become a participant of this multifaceted and rewarding opportunity!</p><p></p><p>We are an equal opportunity employer and welcome applicants from all backgrounds and walks of life to apply for this phenomenal opportunity. As a Software Systems Engineer, your primary responsibility will be to trace requirements and their corresponding verification methods to certify that mission control solutions are tested in all scenarios, ensuring that key performance parameters are met. In doing so, you will contribute to the certification that our systems are functioning optimally, and we can achieve our mission objectives, creating an environment where everyone has an equal opportunity to succeed.</p><p>This team is engaged on continuously improving the V&amp;V system and process by incorporating industry practices and innovative solutions to optimize existing and future testing practices. Your technical expertise and keen attention to detail will be essential in ensuring successful releases of the TTC Central system. Join us in this great opportunity to work on groundbreaking in a multifaceted and exciting environment!</p><p></p><ul><li>Prepare Test Design and Procedure (TDP) and report documents. This includes preparing test cases based and tracing to requirements</li><li>Prepare and perform end-to-end system level tests.</li><li>Prepare bug reports with detail bug description.</li><li>Maintain automated regression tests and incorporate them in continuous integration jobs.</li><li>Interact frequently with software development teams to provide feedback for products.</li><li>Maintain the test environment.</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>Typically a Bachelor&#39;s degree in Computer Science or related engineering field with 6 years of experience, Master&#39;s with 4 years of related experience or PhD with 2 years of related experience</li><li>Knowledge in two or more of the following areas: software development process, continuous integration and test automation methodology.</li><li>3&#43; years hands-on software quality assurance testing experience in the software development industry.</li><li>3&#43; years of in-depth experience developing test automation.</li><li>Proven experience Python scripting language &amp; Unix/Linux shell scripting with bash.</li><li>Detail oriented and must be self-motivated and know when to seek mentorship</li><li>Excellent written and verbal communications skills.</li></ul><p></p><p><b>Preferred Qualifications:</b></p><ul><li>Knowledge of modern software development tools and practices: GitHub, JIRA, Jenkins, TestRail, Agile methodology, DevOps, etc.</li><li>Practical knowledge of Linux and cloud computing environment; experience with Red Hat and Amazon Web Services (AWS) is a big plus.</li><li>Knowledge of software configuration and test automation tools: Ansible, Puppet, etc.</li><li>1&#43; years of hands-on experience in Automated Tests using Selenium.</li><li>1&#43; years of hands-on experience in Automated Tests using Robot Framework.</li><li>Prior experience with MySQL, and NoSQL databases (e.g., Elasticsearch).</li><li>Knowledge of message bus/broker technology (e.g., ActiveMQ, Kafka, etc.)</li><li>Knowledge of spacecraft systems and telemetry data packaging and processing.</li><li>Knowledge of object-oriented design patterns.</li><li>Knowledge of JPL Software Development Standard Practices (SDSPs).</li><li>Experience in JPL flight project support and continuous flight operations improvement.</li><li>Ability to rapidly learn third party development / QA tools.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$124,384 - $155,688<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 16 Days Ago",
    "startDate": "2023-03-03",
    "timeType": "Full time",
    "jobReqId": "R4050",
    "jobPostingId": "Software-Systems-Engineer-III_R4050-1",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-Systems-Engineer-III_R4050-1"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Software Systems Engineer III - TS/SCI",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-III---TS-SCI_R3194",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-30"
    },
    {
      "title": "Software Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-III_R3798",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-20"
    },
    {
      "title": "GDS System Engineering Support - Near Earth (L3)",
      "externalPath": "/job/JPL-Campus/GDS-System-Engineering-Support---Near-Earth--L3-_R3762",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-18"
    }
  ],
  "userAuthenticated": false
}
