{
  "jobPostingInfo": {
    "id": "5fba210fbccb1000931d341fb9bf0000",
    "title": "Senior Technical Manager (Technical Group Supervisor  (I/II)",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>The <b>Project Systems Engineering &amp; Formulation Section </b>provides lifecycle leadership in the formulation, planning and execution of the project systems engineering function for JPL space flight missions from concept development through completion of post-Launch checkout and commissioning. We provide formulation services from concept ideation, to the full expression of that concept in formulation phase products. The creative and innovative personnel in our Section are responsible for the leadership for project-wide systems engineering efforts, and the delivery of project-level systems engineering products. Our expertise spans a wide array of project products and disciplines, including: Project system and mission architectures, Project-Level trade studies, Risk Management, System Model development and analysis, and Identification and evaluation of advanced technologies, among others.</p><p></p><p>Innovation drives so much of what we do at JPL, and our inclusiveness helps drive that innovation.</p><p></p><p></p><p>We are seeking a highly motivated and experienced engineer to serve as the <b>Technical Group Supervisor </b>for the <b>Systems Modeling, Analysis and Architectures Group </b>reporting to the Project Systems Engineering &amp; Formulation Section Manager. The ideal leadership candidate will be passionate enough to value the success of others above their own, and be willing to serve for at least 36 months in a full-time capacity.</p><p></p><p>The <b>Systems Modeling, Analysis and Architectures Group </b>is responsible for:</p><ul><li><p>Early formulation and concept design space system cost estimating tools, which includes data collection, data regression, algorithm development, and data-driven model and tool development. Applications range from CubeSats through flag-ship class missions.</p></li><li><p>Cost assessments and analysis for missions in concept development and formulation, including support to Team X concurrent engineering studies, individual ad-hoc mission studies, and special application studies.</p></li><li><p>Development, maintenance and validation of JPL’s institutional cost models used in early formulation and concept development.</p></li><li><p>Development and use of portfolio-level strategic planning tools, addressing cost, risk and workforce</p></li><li><p>Application of uncertainty quantification to systems engineering problems to assist in the definition of requirements, assessing project scope, performance, cost and risk.</p></li></ul><p></p><p>The Technical Group Supervisor position has roles in technical management, people management, acquiring new work and tasks for the group.</p><p></p><p><b>The Technical management role includes</b></p><ul><li><p>Leading and supporting early and mid-career employees on technical task planning, guiding and advising during task execution, and guiding the planning and development and delivery of final products, including study reports and briefings, modeling and simulation tools, and data collection and algorithm development approaches.</p></li><li><p>Responsibility for the technical work quality produced by group members and assuring that products are delivered to performance, schedule, and cost requirements; actively engaging line, project, and program sponsors to resolve conflicts</p></li><li><p>Maintaining frequent interaction with customers to convey information, establish needs, and evaluate performance.</p></li><li><p>Working with project customers to resolve technical and staffing needs; communicating section methodology for engineering; facilitating application of project system engineering design practices on flight projects; supporting cost exercise, and working with customers to negotiate personnel needs and staffing commitments.</p></li><li><p>Participating in line management peer and project reviews</p></li><li><p>Advancing the practice of quantitative data-driven systems modeling and analysis for group members, developing and evolving processes to be used by the group, and assuring that all projects benefit from best systems engineering practices</p></li></ul><p></p><p><b>The acquiring new work role includes</b></p><ul><li><p>Interest in expanding the role and application of the group’s technical capabilities to broader systems applications.</p></li><li><p>Identifying and capturing systems and programmatic analysis and assessment work that utilizes the group’s robust set of statistical and analytical modeling methods</p></li><li><p>Cross-organizational engagement, developing and delivering capabilities presentations to prospective customers.</p></li><li><p>Leading the development and capture of uncertainty quantification work, and other mathematical and statistical analyses supporting concept and architecture decisions on CONOPS, system reliability, and mission and system design during formulation and implementation.</p></li></ul><p></p><p><b>The people management role includes </b></p><ul><li><p>Responsibility for hiring, managing, developing, and maintaining a high-performance and diverse group consisting of approximately 15 engineers, focused on data analytics and data science engaged in supporting formulation, systems architecture, and projects systems engineering across the section and customers across the institution, and providing career path and technical guidance to group members, including learning &amp; mentoring activities.</p></li><li><p>Participating as a member of the section management team in implementing vision and goals; developing and evolving methods used by group members for project system engineering and spacecraft design; contributing to system engineering capability improvements; advancing the practice of project systems engineering in the section and in other collaborating organizations</p></li><li><p>Ensuring fair and equitable treatment of all employees; maintaining a safe working environment; enforcing JPL and section rules and guidelines; ensuring that group members have taken required training</p></li></ul><p></p><p><b>Qualifications:</b></p><p>The qualified Technical Group supervisor has significant expertise in space system cost estimating, concept development, data driven and physics based mathematical modeling, early formulation and concept modeling and simulation tool development, system architecting systems engineering.</p><ul><li><p>Bachelor’s degree in engineering, physical sciences, mathematics, or statistics with a minimum of 9 years of professional experience, or Master’s degree with a minimum of 7 years of experience, or Doctorate with a <u>minimum</u> of 5 years of experience</p></li><li><p>Knowledge in the systems engineering field with significant expertise within at least one of the following areas: space system cost estimating, project modeling or systems trade analyses; data science and data analytics, project risk assessment and decision making; engineering data analysis and optimization</p></li><li><p>Excellent organizational and team building skills; aptitude to work with difficult colleagues in a productive manner; written skills honed enough to publish in a refereed journal; verbal clarity sufficient to explain difficult technical topics to those external to the field</p></li><li><p>Proven ability to work effectively with all levels of engineers and managers; commitment to customer satisfaction; ability to team effectively across section boundaries; ability to team with institutional management to creatively solve complex enterprise-level issues; ability to resolve complex technical and managerial problems</p></li><li><p>Proven ability to be entrepreneurial developing proposals for new tasks</p></li><li><p>Demonstrated aptitude and genuine commitment to success of others beyond merely helping with technical tasks; experience with mentoring and counseling; unwavering commitment to the development of and advancement of other’s careers</p></li></ul><p></p><p><b>The most competitive candidates will satisfy most of the following:</b></p><ul><li><p>Considered an expert in space systems modeling, cost and risk analysis within own organization. Strong understanding of statistical analysis and complex mathematical modeling as applied at the systems level.</p></li><li><p>Prior demonstrated experience as a team lead, and/or line people manager in a related technical field.</p></li><li><p>Detailed knowledge of statistical analysis and data analytics and the applications of Data Science to help develop the necessary tools and techniques to better assess measurable trends and extract information from disparate datasets.</p></li><li><p>Familiarity with JPL line management practices and procedures, including experience with effective line-project interaction; experience collaborating with a wide variety of customers, including program and project offices, and other technical divisions and sections; experience with risk balancing and communication in cost and schedule constrained environments</p></li><li><p>Some familiarity in the applications and principles of model-based systems engineering methodologies and tool sets; expertise in the development and/or application of performance models, behavioral models, or advanced simulation techniques.</p></li><li><p>Experience with and willingness to teach system engineering principles and practices in the groups area of expertise; ability to motivate group members to enhance system engineering practices; basic understanding in the preparation, delivery, and/or review of project and flight systems engineering gate products.</p></li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$148,616 - $191,984<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 14 Days Ago",
    "startDate": "2023-02-26",
    "timeType": "Full time",
    "jobReqId": "R4019",
    "jobPostingId": "Senior-Technical-Manager--Technical-Group-Supervisor---I-II-_R4019",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Senior-Technical-Manager--Technical-Group-Supervisor---I-II-_R4019"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
