{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Additive-Manufacturing-Engineer_R4371-1",
    "id": "7887ef81446a1001a9a21115fe210001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the<b> Mechanical Systems Engineering, Fabrication and Test Division</b> which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breath of mechanical disciplines and is applied from architectural concept development through operations.</p><p></p><p>As the <i>Mechanical Engineer </i>you will be working for JPL&#39;s <b>Mechanical Fabrication and Test Section</b> which maintains technical support facilities and resources that provide the services required to fabricate, assemble, and test electro-mechanical developmental and flight hardware.  This Section develops and matures equipment and technologies, which enable and enhance our fabrication and environmental test capability for current and future missions. In this roll you will:</p><p></p><ul><li>Collaborate with cognizant engineers, researchers, and scientists to design, develop and manufacturer hardware in support of JPL technology development and space flight applications.</li><li>Develop a deep knowledge of the additive manufacturing process so you can push the boundaries in developing and manufacturing geometrically complex and fine featured innovative hardware.</li><li>Operation and maintenance of Additive Manufacturing (AM) machines including laser powder bed fusion and directed energy deposition metal printing systems</li><li>Evaluate the latest advancements in Additive Manufacturing machines; assess the machines and process standards for both polymers and metals for suitability for JPL applications.</li><li>Support the process of locating, evaluating, and establishing new vendors as a laboratory resource for AM fabrication.</li><li>Participating in &#34;Make or Buy&#34; decisions and provide oversight for selected vendors.</li><li>Utilizing multiple modules in the Oracle Discrete Manufacturing suite; develop the bill of operations and estimates; monitor WIP activities and resolve any technical, cost or schedule issues as they arise.</li><li>Acting as a Contract Technical Manager in collaborating with Acquisition and Subcontractors, regarding out of house fabrication requirements. </li></ul><p><b>Required Qualifications:</b></p><ul><li>Bachelor’s degree in Mechanical Engineering, Aerospace Engineering or related technical discipline with typically a minimum of 3 years of related experience or a Master’s degree in similar disciplines with a minimum of 1 years of related experience.</li><li>Must have engineering experience in at least four of the following technical areas:<ul><li>Experience in spacecraft mechanical systems development including structures, mechanisms or robotics.</li><li>Proficient using engineering and analysis tools and software, i.e. UG/NX or other CAD tools (Pro/E, Solidworks, Matlab, Adams) as well as GD&amp;T.</li><li>Proficient in using the Magics and other software modules focusing on Design and File Preparation for AM.</li><li>Process knowledge for metal Additive Manufacturing (3D Printing) to make a successful build, preferably experienced with titanium or aluminum alloys.</li><li>Knowledge of material and part qualification for space craft applications including NASA-STD-6030</li><li>Knowledge and application of post printing processes for metal 3D printed parts. including support removal, heat treatment and surface finishing methods</li><li>Knowledge of AM powders and the recycling process for re-use.</li><li>Experience in optimizing Additive Manufacturing hardware designs to achieve significant mass reduction or minimize part count (e.g. topology optimization methods).</li><li>Experience in tailoring support structure design to achieve unique Additively Manufactured geometries.</li><li>Experience in developing laser powder bed fusion directed energy deposition printing parameters and tool code for new and novel materials and alloys</li><li>Hands on operational knowledge of laser powder bed fusion and directed energy deposition printers.</li></ul></li></ul><ul><li>Collaborate effectively with engineers/customers concerning feasibility, design, and evaluation of complex equipment and experiments.</li><li>Excellent verbal and written communication, computer skills and be able to work independently with minimal supervision.</li></ul><p><b>Desired Qualifications:                                  </b></p><ul><li>Prefer a minimum of 2 years prior experience developing designing, fabricating and qualifying hardware for flight and quality critical applications.</li><li>Proven ability to take verbal and incomplete design elements and recommending to engineering personnel solutions for the manufacture and assembly of prototype hardware.</li><li>Highly energized, self-motivated, with the ability to work on multiple assignments that are complex in nature using considerable practical judgment.</li><li>Minimum 5 years prior experience in an AM shop environment, specializing in 3D printing operation and maintenance of AM machines including Fused Deposition Modeling (FDM), Polyjet, lost wax castings and multi-jet-modeling processes, printing of complex parts, finishing and assembly of models.</li><li>Experience with NDE methods for AM hardware</li><li>Knowledge of Oracle Discrete Manufacturing modules including: estimating, bills of materials, routers, scheduling, resource allocation, and Work In Process (WIP) monitoring</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$96,096 - $117,104<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Additive-Manufacturing-Engineer_R4371-1",
    "jobReqId": "R4371",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 3 Days Ago",
    "startDate": "2023-05-25",
    "timeType": "Full time",
    "title": "Additive Manufacturing Engineer"
  },
  "userAuthenticated": false
}
