{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-IV-National-Programs-Office-Threads--TS-SCI-_R4729",
    "id": "eedf8c71f1f11000c4c786113d6b0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Overview:</b></p><p>The Project Systems Engineering &amp; Formulation Section (312) provides lifecycle leadership in the formulation, planning and execution of the project systems engineering function for JPL space flight missions from concept development through completion of post-Launch checkout and commissioning. We provide formulation services from concept ideation, to the full expression of that concept in formulation phase products. The creative and innovative personnel in our Section are responsible for the leadership for project-wide systems engineering efforts, and the delivery of project-level systems engineering products. Our expertise spans a wide array of project products and disciplines, including Project system and mission architectures, identification and evaluation of advanced technologies, Project-level requirements, Project-level trade studies, and Risk Management. Innovation drives so much of what we do at JPL, and our inclusiveness helps drive that innovation.</p><p></p><p><b><u>Responsibilities: </u></b></p><p>We are currently seeking an experienced Systems Engineer IV to join our Defense and Commercial Programs Systems Engineering Group (312H) and serve as a Systems Engineer on the Project Systems Engineering Team for a technology demonstration. In this position, you will ensure fulfillment of science objectives by participating in the definition, specification, and validation of system function and behaviors. </p><p></p><p>Specific Responsibilities will include:</p><ul><li><b>Functional decomposition and utility assessment for end-to-end system functions, evaluation of requirements against thread functional decomposition, and coordination with user community on implementation options.</b></li><li>Responsible for the coordination and development of products that include, but are not limited to: DODAF architecture documentation, model-based definition of use cases, validation that the requirements set matches the envisioned use cases, <b>verification and validation (V&amp;V)</b> plans and test procedures.</li><li><b>Participate in multidisciplinary and multi-organizational working groups across government and non-government agencies; excellent communication skills are vital.</b></li><li><b>Engage, communicate, and collaborate</b> with the stakeholders to complete utility analyses, and will own major program milestone review strategy, scope, and content</li></ul><p></p><p><b>Required Skills:</b></p><ul><li>Bachelors degree in Engineering, Physics, or related technical discipline with typically a minimum of 9 years of related experience; Masters degree in similar disciplines with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years related experience.</li><li>Wide-ranging experience and advanced knowledge in one or more of the following areas: systems engineering of space, ground, or instrument systems; architecture and functional decomposition of systems.</li><li>Proven understanding of advanced principles, concepts, and techniques used in system engineering of space and ground systems. </li><li>Must have recent systems engineering experience and significant knowledge and experience in flight operations, integration and test, ground systems, and/or the function of spacecraft subsystems and instruments.</li><li>Must be a self-motivated individual who can work independently and inspire teams. Requires availability for domestic travel.  Must have excellent verbal, written, and presentation skills, comfortable communicating with all levels of seniority in partners and vendors.</li></ul><p></p><p><b>Must be a U.S. Citizen with an active Top Secret (TS) clearance based upon Single Scope Background Investigation (SSBI) within a 5 year scope and must be approved for Sensitive Compartmented Information (SCI) accesses.</b></p><p></p><p><b>Desired Skills:</b></p><ul><li>Thorough understanding of systems engineering methods and applications</li><li>Experience in all phases of the design, development, system integration, test and operation of spacecraft and/or scientific payloads</li><li>Ability to work on major project assignments without appreciable direction, with accountability for technical performance, budget, and schedule</li><li>Excellent problem solving skills</li><li>Proven ability to deal with multiple issues, tasks, and priorities concurrently</li><li>Proven ability to interact effectively across multiple disciplines with government and non-government agencies</li><li>Experience leading tasks and coordinating working groups on large-scale projects in system development, test, and/or operations</li><li>Experience with development and delivery of system documentation, such as requirements documents, test plans, and release description documents.  </li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$143,312 - $183,248<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Systems-Engineer-IV-National-Programs-Office-Threads--TS-SCI-_R4729",
    "jobReqId": "R4729",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 2 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-28",
    "timeType": "Full time",
    "title": "Systems Engineer IV National Programs Office Threads (TS/SCI)"
  },
  "userAuthenticated": false
}
