{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Postdoc--Hydrologist-Specializing-in-Coastal-Regions-with-Remote-Sensing-Expertise_R4250",
    "id": "aae9edf4a2b2100172c287a5669d0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and on Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and in communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to both contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The Postdoctoral scholars at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</p><p></p><p>Delta-X is a NASA funded airborne mission to study the resilience and vulnerability of the Mississippi River Delta to relative sea level rise (RSLR) (<a href=\"https://deltax.jpl.nasa.gov\" target=\"_blank\"><span>https://deltax.jpl.nasa.gov</span></a> ). There were two airborne and field campaigns to collect data used to calibrate hydrodynamic and ecological models. The hydrodynamic model is a means to estimate the amount of sediment being delivered to wetlands through channel-island connectivity. The ecological model produces plant growth estimates to estimate its impact on flow and contribution to soil elevation from root production. The calibrated models are then used to predict which part of the delta will survive or sink within the next century.</p><p></p><p>We seek a candidate with hydrodynamic modeling skills with focus on wetlands or coastal hydrology, as well as good remote sensing skills. </p><p></p><p>Strong Python programming skills is a requirement for the candidate. The hydrodynamic model is implemented in ANUGA, and the ecological model is implemented in Python. The calibration of the hydrodynamic models is iterative by comparison to remote sensing measurements and fine tuning input parameters such as depth and friction. The Delta-X team will provide information about seasonal changes in vegetation structure, which impacts the friction. Thus, the model can simulate seasonality to improve annual sediment delivery estimates. The models have been built and are generally ready to run.</p><p></p><p><b>Responsibilities: </b></p><p>The candidate will use in situ and remote sensing data to improve calibration. Then, s/he/they will support development of the framework to combine the hydrodynamic and ecological models to forecast the fate of different areas within the Mississippi River Delta. </p><p></p><p>Delta-X collected a very large amount of remote sensing data using the AirSWOT, UAVSAR and AVIRISNG instruments. The radars, UAVSAR and AirSWOT, measure the water surface slope in open water channels and the change in water level within the marshes, respectively. They are used to estimate the flow of water across the landscape. This project will make use of several additional spaceborne datasets which include Lidar-derived DEMs, TanDEM-X, Landsat, Sentinel-1/2, ALOS/PALSAR-1/2, along with available GIS layer.</p><p></p><p><b>Qualifications:</b></p><ul><li><p>Ph.D.</p></li><li><p>Hydrodynamic modeling skills with a focus on wetlands or coastal hydrology, as well as good remote sensing skills</p></li><li><p>Strong Python programming skills</p></li></ul><p></p><p>The appointee will carry out research in collaboration with the JPL advisor, resulting in publications in the open literature.</p><p></p><p>Applicants may be subject to additional program requirements by NASA. Postdoctoral Scholar positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years. Candidates should submit the following to this site: CV, representative publications, contact information for three references, and a cover letter stating their research accomplishments and interests.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$82,180 - $82,180<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Postdoc--Hydrologist-Specializing-in-Coastal-Regions-with-Remote-Sensing-Expertise_R4250",
    "jobReqId": "R4250",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 14 Days Ago",
    "startDate": "2023-05-03",
    "timeType": "Full time",
    "title": "Postdoc: Hydrologist Specializing in Coastal Regions with Remote Sensing Expertise"
  },
  "userAuthenticated": false
}
