{
  "jobPostingInfo": {
    "id": "7de9fca8ea36100112c13b539d930000",
    "title": "JPL Postdoctoral Fellow - Mass Spectroscopy and Gas Chromatography",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The postdocs at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</p><p></p><p>Opportunities exist for both basic and applied research in the fields of mass spectroscopy and both gas and liquid chromatography. Research opportunities also exist for modeling the fields and trajectories of charged particles within radio frequency ion traps, with an emphasis on developing multi-threaded coding related to space charge interactions, collisional cooling, ion injection/ejection phenomenon and novel ionization techniques. Research involving answering basic planetary science measurements are also required in the fields of, for example, geochronology, atmospheric constituents, and life detection. Instrumentation currently under research and development are MEMS-based gas and liquid chromatographs and their interface to a variety of mass spectrometers. Areas of applied technology development are in next-generation sensors for future manned and robotic planetary missions. </p><p></p><p>In support of human exploration, the group is currently building and operating the Spacecraft Atmosphere Monitor (S.A.M), a miniature gas chromatograph mass spectrometer (GCMS) based instrument that analyzes the International Space Station (ISS) cabin atmosphere for the concentrations of the major constituents (e.g. N2, O2, CO2) and trace organics (e.g. benzene, alcohols).  The S.A.M. instrument is a technology demonstration of an instrument that is road mapped for all future human spacecraft.  The first SAM Technology Demonstration Unit (TDU) #1 successfully operated on-board the ISS as an experiment in the EXPRESS rack from Aug/2019 through July/2021.  Work is currently being performed in building additional TDU for the ISS for re-flights to the ISS starting in 2023.  Opportunities also exist in the research and development of a GCMS instrument for analyzing the constituents of astronaut drinking water and fluids connected with In-Situ Resource Utilization on the moon and Mars.</p><p></p><p>Opportunities within the group also exist in support of planetary investigations.  Currently there is research being performed on developing the instrumentation and associated scientific investigations for:</p><p>• Planetary exospheres (e.g. lunar and primitive moons)</p><p>• Planetary atmospheres (e.g. Uranus and Neptune). </p><p>• Life detection through mass spectroscopic analysis of cyro-plumes and aerosols</p><p></p><p><b>References:</b></p><p>• Hill, Denise (2019-07-23). &#34;S.A.M. Goes to Work Aboard ISS&#34;. NASA. Retrieved 2019-07-30.</p><p>• &#34;NASA&#39;s Spacecraft Atmosphere Monitor Goes to Work Aboard the International Space Station&#34;. Technology Org. 2019-07-30. Retrieved 2019-07-31.</p><p>• The Spacecraft Atmosphere Monitor <a href=\"https://en.wikipedia.org/wiki/Spacecraft_Atmosphere_Monitor\" target=\"_blank\">https://en.wikipedia.org/wiki/Spacecraft_Atmosphere_Monitor</a></p><p></p><p><b>Responsibilities:</b></p><p>We seek a postdoc researcher with potential contributions to one or more of the following areas:</p><p>• Modeling the fields and trajectories of charged particles within a radio-frequency ion trap</p><p>• Performing basic measurements and the associated instrumentation and techniques that support science investigations for planetary atmospheres, exospheres, and life detection.</p><p>• Contribute to the development of instrumentation and measurement techniques that support human spaceflight.</p><p></p><p><b>Qualifications:</b></p><p>Ph.D. in physics, chemistry, applied engineering or related field</p><p>Direct experience in one or more of the following:  mass spectroscopy, gas chromatography, liquid chromatography, and planetary atmospheric research.</p><p>Strong communication, writing, and organizational skills will be needed.</p><p>C&#43;&#43;, Python, and Linux computer skills are strongly advised.</p><p>The appointee will carry out research in collaboration with staff members in the JPL Science (32) and Instrumentation Divisions (38) resulting in publications in the open literature.</p><p></p><p>Applicants may be subject to <a href=\"http://postdocs.jpl.nasa.gov/prospective-postdocs/eligibility/\" target=\"_blank\">additional program requirements</a> by NASA. Postdoc positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years. Candidates should submit the following to this site: CV, representative publications, contact information for three references, and a cover letter stating their research accomplishments and interests.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$82,180 - $82,180<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-28",
    "timeType": "Full time",
    "jobReqId": "R3237",
    "jobPostingId": "JPL-Postdoctoral-Fellow---Mass-Spectroscopy-and-Gas-Chromatography_R3237",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/JPL-Postdoctoral-Fellow---Mass-Spectroscopy-and-Gas-Chromatography_R3237"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Ionosphere Phase Estimation for InSAR Time Series Analyses",
      "externalPath": "/job/JPL-Campus/Ionosphere-Phase-Estimation-for-InSAR-Time-Series-Analyses_R1336",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc Position in Arctic Methane",
      "externalPath": "/job/JPL-Campus/Postdoc-Position-in-Arctic-Methane_R2118",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc- Cloud and Precipitation Radar Signal Simulation and Analysis",
      "externalPath": "/job/JPL-Campus/Postdoc--Cloud-and-Precipitation-Radar-Signal-Simulation-and-Analysis_R3445",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc- Advancing Remote Imaging Spectroscopy for Earth Science",
      "externalPath": "/job/JPL-Campus/Postdoc--Advancing-Remote-Imaging-Spectroscopy-for-Earth-Science_R3884",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-03"
    },
    {
      "title": "Postdoctoral Research Opportunity to Study the General Interactions Between the Hydrosphere and Solid Earth",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Research-Opportunity-to-Study-the-General-Interactions-Between-the-Hydrosphere-and-Solid-Earth_R2232",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "JPL Postdoc Opportunity - Atom Interferometer for Microgravity",
      "externalPath": "/job/JPL-Campus/JPL-Postdoc-Opportunity---Atom-Interferometer-for-Microgravity_R1704",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc: Studying Tropospheric Ozone Trends and Variability using Satellite Observations, Ozonesondes and Model Reanalysis Products",
      "externalPath": "/job/JPL-Campus/Postdoc--Studying-Tropospheric-Ozone-Trends-and-Variability-using-Satellite-Observations--Ozonesondes-and-Model-Reanalysis-Products_R3829",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-26"
    },
    {
      "title": "Postdoctoral Position in Pulsar/FRB Astrophysics",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Position-in-Pulsar-FRB-Astrophysics_R831",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc- Mass Spectrometer Technologist",
      "externalPath": "/job/JPL-Campus/Postdoc--Mass-Spectrometer-Technologist_R2567",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc Position in the areas of compact clocks and atom interferometers",
      "externalPath": "/job/JPL-Campus/Job-Posting-Title-JPL-Postdoctoral-Positions-in-the-areas-of-compact-clocks-and-atom-interferometers_R421",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc- Exoplanetary Sciences",
      "externalPath": "/job/JPL-Campus/Postdoc--Exoplanetary-Sciences_R3705",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-05"
    },
    {
      "title": "Postdoc in Geodynamics And Space Geodesy",
      "externalPath": "/job/JPL-Campus/Postdoc-in-Geodynamics-And-Space-Geodesy_R2348",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Satellite-Based Assessment of Relative Sea Level Change 2",
      "externalPath": "/job/JPL-Campus/Satellite-Based-Assessment-of-Relative-Sea-Level-Change-2_R730",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc: Lidar and PolinSAR/TomoSAR Data Fusion in Monitoring Changes of  Vegetation Structure and Surface Topography",
      "externalPath": "/job/JPL-Campus/Postdoc--Lidar-and-PolinSAR-TomoSAR-Data-Fusion-in-Monitoring-Changes-of--Vegetation-Structure-and-Surface-Topography_R2894",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc: Retrieval of ice sheet and ice shelf properties using spaceborne multi-frequency microwave radiometry-1",
      "externalPath": "/job/JPL-Campus/Postdoc--Retrieval-of-ice-sheet-and-ice-shelf-properties-using-spaceborne-multi-frequency-microwave-radiometry-1_R4102",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted Today",
      "startDate": "2023-03-16"
    },
    {
      "title": "Postdoc: Remote Sensing Data Analytics for Mapping and Monitoring Global Forest Carbon",
      "externalPath": "/job/JPL-Campus/Postdoc--Remote-Sensing-Data-Analytics-for-Mapping-and-Monitoring-Global-Forest-Carbon_R2896",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoctoral Fellowship Opportunity in Advancing Climate Information Decision Support in California",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Fellowship-Opportunity-in-Advancing-Climate-Information-Decision-Support-in-California_R3636",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc: Planetary Radio Science and Bistatic Radar",
      "externalPath": "/job/JPL-Campus/Postdoc--Planetary-Radio-Science-and-Bistatic-Radar_R3947",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30 Days Ago",
      "startDate": "2023-02-14"
    },
    {
      "title": "Postdoc Position: NISAR Retrieval Algorithms Development",
      "externalPath": "/job/JPL-Campus/Postdoc-Position--NISAR-Retrieval-Algorithms-Development_R1089",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "“Postdoc Position: Interaction of Dust and Water Ice Clouds in the Martian Atmosphere”",
      "externalPath": "/job/JPL-Campus/XMLNAME--Postdoc-Position--Interaction-of-Dust-and-Water-Ice-Clouds-in-the-Martian-Atmosphere-_R3181",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-23"
    }
  ],
  "userAuthenticated": false
}
