{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Postdoc--Exploring-small-scale-ocean-dynamics-with-SWOT_R4719",
    "id": "df7d6edb0709100160cad937948c0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and on Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and in communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to both contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The Postdoctoral scholars at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</p><p></p><p>The oceanography team of the Surface Water and Ocean Topography (SWOT) mission at JPL invites motivated postdoctoral candidates to join the team to work on SWOT-related oceanography projects.</p><p></p><p>The SWOT mission successfully launched the satellite in December 2022. This is the first satellite mission that produces wide-swath altimetry measurements with a high spatial resolution. Early results show very promising measurements that can be used to significantly advance various areas including submesoscale ocean processes over the open ocean as well as coastal and crosphere boundaries.</p><p></p><p>However, challenges lie ahead. Being a pathfinder mission, SWOT requires rigorous measurement validation. In addition, high-resolution swaths with a long revisit time (~10 days in mid-latitude), results in challenges in the application of SWOT SSH to ocean and climate sciences. Validating, analyzing, and applying SWOT SSH will require innovative approaches that involve applying geospatial analyses, data assimilation and machine learning in combination with other remote sensing and in-situ data, and the insights into geophysical fluid dynamics.</p><p></p><p>The project will be defined in the context of SWOT and sea surface height, but the specific topic will depend on the candidate&#39;s interest and expertise. Candidates are encouraged to propose new ideas. In addition to the postdoc advisor, the postdoc researcher will be working in close collaboration with a group of satellite oceanographers, modelers and machine learning experts.</p><p></p><p>Qualifications:</p><p>Ideal candidates will have the following:</p><ul><li>Doctoral degree in physical oceanography or relevant fields and a publication record that illustrates the ability to conduct and communicate independent research. Candidates with a Ph.D. from computer/data science are also welcome to apply, given a record of interest in geoscience and physical oceanography.</li><li>General interests in satellite altimetry and remote sensing, and is willing to work with low-level SWOT data and other oceanographic in-situ measurements such as those from moorings, gliders and Argos. Work experience with machine learning, data assimilation, or geophysical fluid dynamics is a plus.</li></ul><p></p><p>The appointee will carry out research in collaboration with the JPL advisor resulting in publications in the open literature and developing open software.</p><p></p><p>Please submit a CV, including a publication list, and a cover letter that contains a brief description of your current and future research interests, along with the names and contact information of three references. The position will remain open until filled. Applications should be sent as a single PDF file to this site.</p><p></p><p>Applicants may be subject to additional program requirements by NASA. Postdoctoral Scholar positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$82,180 - $82,180<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Postdoc--Exploring-small-scale-ocean-dynamics-with-SWOT_R4719",
    "jobReqId": "R4719",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 7 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-23",
    "timeType": "Full time",
    "title": "Postdoc: Exploring small-scale ocean dynamics with SWOT"
  },
  "userAuthenticated": false
}
