{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-V--RAD750-CogE_R4735",
    "id": "eedf8c71f1f11001fb07ef2e1ada0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As the BAE RAD750 Cognizant Engineer in JPL&#39;s <b>Autonomous Systems Division&#39;s Flight Electronics Section </b>which crafted the electronics for Europa Clipper and Psyche, and the latest Mars rover and helicopter (Perseverance &amp; Ingenuity), your primary responsibility will be to serve as the laboratory expert for BAE’s RAD750 single board computer.</p><p></p><p><b>Tasks may include but not limited to:</b></p><ul><li>Technical ownership of RAD750 functional behaviors, capabilities, and performance.</li><li>Serve as the in-house technical support for any questions or issues that arise.</li><li>Serve as the go-to lab expert initially for all things RAD750, and then for other computing technologies used by JPL as they start getting used by flight projects.</li><li>Understand the detailed feature sets of each computer, and the fault tolerance features of various computers.</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>Bachelors in an engineering or appropriate science discipline, with 12&#43; years of related experience, Masters with 10&#43; years of related experience or PhD with 8&#43; years of related experience.</li><li>Strong familiarity with the BAE RAD750 along with other computing technologies.</li><li>Strong background in computer architecture/organization concepts, especially for space applications.</li><li>Excellent communications skills, ability to work in interdisciplinary teams and meet deadlines.</li><li>Ability to organize large complex tasks</li></ul><p></p><p><b>Desired Skills and Experience:</b></p><ul><li>Up to date with latest space flight computer products being developed and used.</li><li>Deep understanding of the BAE RAD750 including:<ul><li>RAD750 architecture</li><li>Idiosyncrasies and errata</li><li>Differences between V1, V2, and V3.</li><li>Options when purchasing a RAD750</li><li>How it is being used across NASA/JPL and other aerospace companies.</li></ul></li><li>Ability to handle a large amount of asynchronous requests for support by various teams.</li><li>Electrical engineering or computer science background.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$177,944 - $227,656<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Systems-Engineer-V--RAD750-CogE_R4735",
    "jobReqId": "R4735",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-09-01",
    "timeType": "Full time",
    "title": "Systems Engineer V, RAD750 CogE"
  },
  "userAuthenticated": false
}
