{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Configuration-Management-Engineer-III-TS-SCI_R4084",
    "id": "32bbf743df71100115f0eb43ae500000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>We invite you to join the <b>Project Information and Configuration Management Group</b> to serve as a <b>Configuration Management Engineer III.</b> Reporting functionally to the Project Information and Configuration Management Group Supervisor and programmatically to the Project Systems Engineer.</p><p></p><p>JPL’s Information and Configuration Management Engineer (ICME) is responsible for tailoring and implementing the institutional Configuration Management (CM) process requirements on assigned JPL missions.</p><p></p><p>As a member of the Project Information &amp; Configuration Management group, the ICME will:</p><ul><li><p>Provide Hardware Configuration and Information Management support for JPL Project System Engineers, using software and information management tools and standard methodologies.</p></li><li><p>Identify documentation required for systems design, development, test, launch, and operations, and define and implement the applicable level of configuration management for these products.</p></li><li><p>Be responsible for the planning and implementation of complex tasks including identifying, collecting, cataloging, releasing, reporting, and controlling documentation; handling changes; coordinating waivers; and supporting schedules.</p></li><li><p>Administer information throughout the project&#39;s lifecycle, including archiving and project closeout.</p></li><li><p>Investigate alternate methods/procedures for information and configuration management. Recommend improvements to project personnel and management.</p></li><li><p>Apply knowledge of standards and practices to integrate partner information and develop processes and procedures.</p></li><li><p>Serve as the project’s technical point of contact to implement and manage the appropriate level of access control to protect export controlled, proprietary, and sensitive project information.</p></li><li><p>Plan, document, manage and execute the project change control process. Establish change control through application of distributed change processing authority by providing for project, system, and subsystem Change Control Board (CCB) administration and support including Engineer Change Request (ECR) processing, action item capture/tracking/closure using Jira or similar tool, coordination of impact assessments, and change incorporation verification.</p></li><li><p>Manage the Dynamic Object Oriented Requirements System Next Generation (DOORS NG) database by verifying changes in the system. Ensure the traceability of the design by linking/delinking requirements across multiple artifacts. Import/export deliverables to/from DOORS NG and format in preparation for delivery.</p></li><li><p>Prepare CM activity/status reports and metrics for project meetings and reviews.</p></li><li><p>Audit configuration items to verify conformance to specifications, drawings and interface control documents, and other contractual requirements.</p></li><li><p>Ensure projects follow institutional information and configuration management policies, processes, and procedures (e.g. JPL Information Access, Records Management, and Marking and Handling requirements; JPL Flight Project Practices, JPL Design Principles; AS9100, NPR 7120.5, International Traffic in Arms Regulations [ITAR], and Export Administration Regulations [EAR]).</p></li></ul><p></p><p><b>Qualifications</b></p><ul><li><p>Typically requires a Bachelor’s degree in with a minimum of 6 years of related experience or a Master’s degree with a minimum of 4 years of related experience.</p></li><li><p>Multifaceted experience and advanced knowledge in one or more related fields of knowledge including Systems Engineering, Drawing and Model Release Management, Configuration Management, Information Management, and/or Records Management.</p></li><li><p>Ability to work effectively in highly dynamic environments.</p></li><li><p>Ability to coordinate and collaborate efficiently in a diverse team environment.</p></li><li><p>Excellent verbal and written communication and computer skills.</p></li><li><p>Experience with management of project data using an enterprise Product Data Management (PDM) system (e.g. Siemens Teamcenter, SAP PLM, or PTC Windchill).</p></li></ul><p></p><p><b><span>Note: Must have an active Top Secret (TS) clearance based upon Single Scope Background Investigation (SSBI) within a 5 year scope and</span><span> must be approved for Sensitive Compartmented Information (SCI) accesses</span></b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$102,752 - $128,544<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Configuration-Management-Engineer-III-TS-SCI_R4084",
    "jobReqId": "R4084",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 29 Days Ago",
    "startDate": "2023-03-14",
    "timeType": "Full time",
    "title": "Configuration Management Engineer III TS/SCI"
  },
  "userAuthenticated": false
}
