{
  "jobPostingInfo": {
    "id": "32bbf743df711001727da03315c30000",
    "title": "Robotics Technologist II, Aerial Mobility Group",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>We invite you to apply for this outstanding opportunity within the Autonomous Systems Division. This division is responsible for technology development, advanced concepts, design, development, delivery, integration and test, verification and validation, and operation of Command and Data Handling (C&amp;DH) Hardware, Flight Software, Power Systems, Robotic Systems, and Guidance and Control. The opportunity is being offered by the <b>Robotics and Autonomous Systems Section (347).</b></p><p></p><p><b>Wanted: A Robotics Technologist</b> who will be responsible for supporting and leading robotics autonomy, planning, estimation, localization, mapping, and perception development efforts. These activities will cover research projects, with a goal to mature technology for future missions and development on flight projects. In this role you will be encouraged to contribute technically, produce software, participate in planning and coordination, as well as proposing and leading new research projects. You will report to the Group Supervisor for the <b>Aerial Mobility Group (347T)</b>. The group provides robotic solutions tailored to the unique challenges associated with aerial robots, with a focus on estimation, control, planning, perception and autonomy on systems constrained by their limited size, weight and power.</p><p></p><p><b>Responsibilities may include but are not limited to</b>:</p><ul><li>Conducting complex design, analysis, characterization, simulation, test and/or verification of robotics subsystems and/or components.</li><li>Developing new technologies and concepts for improvement of existing and future products.</li><li>Working as a key member in a team with other engineers to accomplish robotics complex engineering tasks.</li><li>Applying broad knowledge in the robotics field to evaluate customer engineering requirements and devising approaches to meet requirements.</li><li>Performing complex data analysis and/or fundamental research.</li><li>Adapting complex technical models to build improved cutting-edge designs for complex systems.</li><li>Participating in test plan development; developing unit tests; participating in testing of software components; evaluating unit test results.</li><li>Frequent interaction with customers and peers inside and outside organization on significant matters.</li><li>Approving others’ work and ensuring compliance with requirements on significant projects and assignments.</li><li>Completing significant project or assignment milestones.</li><li>Publishing own work at conference proceedings, and contributing to team publications.</li></ul><p></p><p>Potential future work may include both research and flight projects such as</p><ul><li>Mars Sample Recovery Helicopters</li><li>High speed off-road autonomous vehicles</li><li>Autonomous search and rescue robots</li><li>Unmanned aerial vehicles</li><li>Autonomous underwater vehicles</li><li>Advanced robotic simulation tools</li></ul><p></p><h2><b>Qualifications:  </b></h2><ul><li>Bachelor’s degree in Mechanical Engineering, Mechatronics, Robotics, or related technical field with typically a minimum of 3 years related experience; Master’s degree with a minimum of 1 years related experience; or Ph.D. in similar disciplines with typically a minimum of 0 years of experience.</li></ul><ul><li>General understanding and application of advanced principles, theories, concepts and techniques in robotic algorithms, software, systems and hardware.</li><li>Advanced knowledge in one or more of the following robotic subsystems: estimation, localization, mapping, perception, planning or autonomy.</li><li>Autonomy software development experience including one or more of the following: sensor interfacing, embedded software, estimation, localization, mapping, semantic perception, local and global planning and state machines.</li><li>Ability to work independently on important assignments and projects with only limited supervision, typically receiving only general instructions.</li><li>Strong written and verbal communication skills to facilitate inter-team information flow and to support review of team products</li></ul><p></p><h2><b>Desired qualifications:</b></h2><h2>●Hands on experience working with one or more of the following:</h2><ul><li>Robotic Mobility Systems</li><li>Aerial Mobility Systems</li><li>Sensors</li><li>Machine Vision Systems</li><li>Robotic Motion Planning</li><li>Applications of Machine Learning to robotics</li></ul><ul><li>Experience integrating and testing autonomy software on robotic hardware.</li><li>Experience in preparing and deploying robotic systems in the field.</li><li>General knowledge of robotics industry standards, including robotic software development in C/C&#43;&#43; and Python, familiarity with software development lifecycles, and experience with code management tools.</li><li>Familiarity with Linux operating systems.</li><li>Regular use of creativity and innovation to address critical issues</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$109,408 - $139,672<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted Today",
    "startDate": "2023-03-15",
    "timeType": "Full time",
    "jobReqId": "R4100",
    "jobPostingId": "Robotics-Technologist-II--Aerial-Mobility-Group_R4100",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Robotics-Technologist-II--Aerial-Mobility-Group_R4100"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Robotics Technologist II",
      "externalPath": "/job/JPL-Campus/Robotics-Technologist-II_R2838",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-23"
    },
    {
      "title": "Robotics Controls Engineer II",
      "externalPath": "/job/JPL-Campus/Robotics-Controls-Engineer-II_R2726",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-23"
    }
  ],
  "userAuthenticated": false
}
