{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Data-Scientist-II--TS-SCI-clearance_R3190",
    "id": "e96fff9cfb321001232d6f5d92c70000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Wanted:  Engineer with a range of skills related to Data Science including Signal/Image Processing, Analysis of Large Datasets and Machine Learning.  Candidate must hold an active Top Secret / SCI clearance.</b></p><p></p><p>Members of this team use existing data analysis techniques and develop novel techniques to enable understanding of large volumes of image data acquired from overhead.</p><p></p><p>In this position you will both employ existing methods and develop new ones to understand image data at varying resolutions and under varying sensing modalities. Typical applications include understanding patterns of life and tracking ensembles of ground objects, either over wide physical extent or for extended durations. You will use general analytic methods and, where applicable, image processing and machine learning methods and tools, to accomplish your objectives.</p><p></p><p>Designated work includes:</p><ul><li><p>Primary support of classified projects of varying sizes</p></li><li><p>Secondary support for software and algorithm development across unclassified NASA and non-NASA projects</p></li></ul><p></p><p><b>The following qualifications are required:</b></p><ul><li><p>Bachelor’s degree in computer science or related technical discipline with typically a minimum of 3 years related experience; Master’s degree in similar disciplines with a minimum of 1 year related experience; or PhD in similar disciplines.</p></li><li><p>Strong knowledge of <b>data science methods and data analysis</b>, ideally on relevant types of high volume data</p></li><li><p>Familiarity with <b>Machine Learning</b>, including standard libraries</p></li><li><p>Strong software programming skills in <b>Matlab</b> and <b>C/C&#43;&#43; and/or Python</b></p></li><li><p>Experience in solving challenging problems</p></li><li><p><b>Active Top Secret / SCI clearance</b></p></li></ul><p></p><p><b>Desired qualifications:</b></p><ul><li><p>Strong communications skills</p></li><li><p>Strong teamwork skills</p></li><li><p>Familiarity with Robotic Hardware and/or Software</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$112,070 - $128,544<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Data-Scientist-II--TS-SCI-clearance_R3190",
    "jobReqId": "R3190",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-28",
    "timeType": "Full time",
    "title": "Data Scientist II, TS/SCI clearance"
  },
  "userAuthenticated": false
}
