{
  "jobPostingInfo": {
    "id": "ddf5bd0d8fa21001829edd2c5cdd0000",
    "title": "Systems Engineer III (Sample Retrieval Lander Payload Avionics Engineer)- Project Discovery",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Formed in 1936, the NASA Jet Propulsion Laboratory is a federally funded research and development center managed for NASA by the California Institute of Technology (Caltech.) JPL joined NASA as an FFRDC when the agency was founded in 1958.<br /> <br />JPL helped open the Space Age by developing America’s first Earth-orbiting science satellite, creating the first successful interplanetary spacecraft, and sending robotic missions to the solar system.<br /> <br />Today JPL continues its world-leading innovation, implementing programs in planetary exploration, Earth science, space-based astronomy and technology development while applying its capabilities to technical and scientific problems of national significance.<br /> <br />Above all, we are explorers. At JPL we promote collaboration, innovation, integrity, and excellence in distinct academic areas. We turn ideas for science investigation into the reality of groundbreaking space missions, partnering with our strategic business teams to guide JPL into the future.</p><p></p><p><b>Project Discovery Reentry Program Description</b></p><p></p><p>JPL understands that we all have different life and career journeys, and we invite you to make us your next step. The Project Discovery reentry program marks the next milestone of inclusivity at JPL as a commitment to equitable career development and advancement opportunities. If you have taken a career break and are ready to return to work – this program is for you!</p><p></p><p>JPL and Project Discovery are part of the STEM Reentry Task Force, the groundbreaking career reentry initiative co-led by the Society of Women Engineers and iRelaunch.</p><p></p><p>The JPL Project Discovery Re-Entry program is looking for talented professionals who are looking to restart their careers after an absence from the workforce for one or more years. This paid one-year returnship role will enable you to work on projects that match your expertise, interests and abilities and could lead to full-time employment. During the returnship program you will have the opportunity to update your skills in a contemporary work environment. You will have access to the latest tools and technologies available and work alongside multidisciplinary teams to hone your expertise and deliver on client-critical solutions. You’ll be able to experience the breadth of JPL resources while developing new skills and building new relationships.</p><p></p><p><b>Note: As a temporary position, this assignment may last up to 12-months.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice. </b></p><p></p><p><b>Responsibilities:</b></p><p></p><p>We are seeking a highly motivated and experienced <b>Systems Engineer III</b> to join the <b>Payload Systems Group</b>, reporting administratively to the Technical Group Supervisor and programmatically to the Mars Sample Retrieval Lander (SRL) Payload Lead Systems Engineer (PLSE). Your initial assignment will be to serve as a cross cutting avionics payload systems engineer on the SRL Payload Systems Engineering Team. Some of your initial tasks may include requirements development, functional design, and verification and validation (V&amp;V) of payload avionics-related functionality.</p><p></p><p>You will work independently and within a team environment, collaborating on tasks performed across a spectrum of disciplines and have excellent writing and oral presentation skills.</p><p></p><p><b>Tasks may include but not limited to:</b></p><ul><li><p>Working with avionics subject-matter experts and subsystem engineers to develop system and interface requirements across payload elements including the Sample Transfer Handling System (STHS), Sample Retrieval System (SRS), and the Mars Launch System (MLS)</p></li><li><p>Lead definition and coordination of payload avionics-related documents, deliverables, and products (if standalone from other deliverables)</p></li><li><p>Develop/manage payload avionics technical resource budgets and analyses, manage/close issues and risks, and manage/close trades</p></li><li><p>Develop payload avionics V&amp;V approaches and plans</p></li><li><p>Develop and execute test plans for payload avionics functionality at the interface and/or on the integrated flight system</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in Engineering, Physics, or related technical discipline with a minimum of 6 years of professional experience, or Master’s degree with a minimum of 4 years of experience, or Ph.D with a minimum of 2 years of experience</p></li><li><p>Systems engineering of avionics, specifically communication and motor control, interfaces and functionality. Including requirement and interface definition, flow-down, verification and validation planning and execution, and <span>identification/management</span> of technical risks</p></li><li><p>Practical experience of testbed or I&amp;T planning and execution related to communication and motor control interfaces and systems</p></li><li><p>Practical experience of applying system engineering principles to payload requirements development, risk management, technical analysis, configuration control, waivers and exceptions, and resource tracking</p></li><li><p>Availability for occasional domestic and possibly international travel</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Direct experience with JPL in-house system engineering</p></li><li><p>Experience in system communication and motor control interface design and development</p></li><li><p>Familiarity with surface sampling/robotic operations</p></li><li><p>Proven knowledge of system engineering standards, processes, and tools</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$122,096 - $154,336<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-02-07",
    "timeType": "Full time",
    "jobReqId": "R3655",
    "jobPostingId": "Microdevices-Engineer-II---Project-Discovery_R3655",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Microdevices-Engineer-II---Project-Discovery_R3655"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Embedded Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Embedded-Systems-Engineer-III_R3825",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-10"
    },
    {
      "title": "Cable Harness Engineer III",
      "externalPath": "/job/JPL-Campus/Cable-Harness-Engineer-III_R3514",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer III (Verification & Validation) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III---Project-Discovery_R3663",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Flight Systems Engineer III (Sample Retrieval Lander) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Flight-Systems-Engineer-III--Sample-Retrieval-Lander----Project-Discovery_R3660",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Systems Engineer III (TS/SCI)",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III--TS-SCI-_R4066",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 6 Days Ago",
      "startDate": "2023-03-09"
    },
    {
      "title": "Systems Engineer III (Clipper Project V&V Engineer)  - Project Discovery",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III--Clipper-Project-V-V-Engineer-----Project-Discovery_R3658",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Aerospace Nuclear Safety Engineer III",
      "externalPath": "/job/JPL-Campus/Aerospace-Nuclear-Safety-Engineer-III_R3142",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer III(Sample Retrieval Lander Payload Avionics Engineer)",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III-Sample-Retrieval-Lander-Payload-Avionics-Engineer-_R3368",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "System Engineer III- (Fault Protection) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Flight-System-Engineer-III---Project-Discovery_R3653",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Science Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Science-Systems-Engineer-III_R1748",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Flight Systems Engineer III, Verification and Validation",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III_R3753",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30 Days Ago",
      "startDate": "2023-02-13"
    },
    {
      "title": "Technical Program Manager of Mechanical Systems",
      "externalPath": "/job/JPL-Campus/Technical-Program-Manager-of-Mechanical-Systems_R3768-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-11"
    },
    {
      "title": "Thermal Engineer III",
      "externalPath": "/job/JPL-Campus/Thermal-Engineer-III_R2987",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer III - Fault Protection",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III---Fault-Protection_R3754",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-11"
    }
  ],
  "userAuthenticated": false
}
