{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Staff-Assistant-III_R4287-1",
    "id": "aae9edf4a2b21001f27770c4286f0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally! We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p></p><p>Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>This unique opportunity is part of the Mechanical Systems Engineering, Fabrication and Test Division which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breadth of mechanical disciplines and is applied from architectural concept development through operations.</p><p></p><p>As a Staff Assistant III, you will be supporting the Electronic Manufacturing, Packaging, &amp; Technical Services Section, which provides engineering services that include the following: fabrication of electronics (boards and cables/harnesses), microelectronic and photonic hardware; electronic packaging, manufacturing engineering and electronic hardware thermal/structural analysis; advanced electronic packaging engineering, technology development and process engineering; technical facilities management and cleanroom services/certification; custom measurement systems development and instrumentation services; calibration services, test equipment loan pool and metrology engineering, and technical inventory management, cryogenics services and Flight Hardware Logistics Program (FHLP).</p><p></p><p><b><u>Responsibilities:</u></b></p><ul><li><p>Provide secretarial support to Section Management, the Business Administration Manager, and technical staff. </p></li><li><p>Manage sophisticated calendars for Section management and conference room schedules.</p></li><li><p>Coordinate meetings via Microsoft Outlook and Teams.</p></li><li><p>Prepare and process foreign and domestic travel, generating travel reports, processing affiliate badge requests for domestic and foreign visitors and escorting visitors as necessary.</p></li><li><p>Answer phones, process visitor requests, update the Section’s organization charts and perform ad-hoc assignments as necessary.</p></li><li><p>Manage P-card purchasing, requisitions, and iProcurement orders.</p></li><li><p>Assist with the preparation of presentations, graphics, and website inputs, including proofreading and editing, coordinating office moves, and new hire preparations.</p></li><li><p>May assist in performing ergonomic evaluations, updating Work Authorization Memos (WAMs), and coordinating onsite and offsite workshops.</p></li><li><p>Assist with Early Career / Experienced / Contractor hire interviews. Includes but is not limited to interview schedule preparations, candidate escorting, etc.</p></li><li><p>Provide oﬃce support to multiple technical groups as well as backup support to the Division office and other groups as needed.</p></li><li><p>Demonstrate professional customer service, outstanding organization skills, and ﬂexibility in the performance of the job.</p></li><li><p>Prioritize work and assignment completions in an accurate and timely manner.</p></li><li><p>Regular support of multiple and multifaceted ad hoc assignments.</p></li></ul><p></p><p><b><u>Qualifications</u></b></p><ul><li><p>Typically requires a High School diploma with a minimum of 8 years of related experience; Associates degree with a minimum of 4 years of related experience; or Bachelors degree with a minimum of 1 year of related experience; related required training.</p></li><li><p>Advanced understanding of both general and detailed aspects of job and work techniques in the area of secretarial or administrative assistant; as well as practical applications to problems and situations ordinarily encountered.</p></li><li><p>Advanced understanding of office procedures and personal computer applications (Microsoft Word, Excel, Power Point, Outlook, Adobe Acrobat, and Visio).</p></li><li><p>Excellent planning and scheduling skills.</p></li><li><p>Demonstrated ability to work effectively under pressure on multiple complex tasks, and work independently with minimal direction to meet commitments with high quality products.</p></li><li><p>Willingness to learn new technologies and tools to enhance and/or improve oﬃce procedures and processes.</p></li><li><p>Motivated self-starter who takes the initiative to establish and implement process improvements.</p></li><li><p>Ability to evaluate situations and apply good judgement.</p></li><li><p>Great teammate with excellent written and oral communication skills.</p></li><li><p>Ability to interact effectively with all levels of personnel and provide excellent customer service.</p></li><li><p>Must exercise proper discretion when handling assignments of a discreet nature and when dealing with critical material.</p></li><li><p>Proven success in the administrative support profession with the ability to maintain patience and composure in a dynamic work environment that includes interruptions and changing priorities.</p></li></ul><p></p><p><b><u>Preferred Skills:</u></b></p><ul><li><p>Highly organized and extensive experience calendaring complex schedules.</p></li><li><p>Subject Matter Expert in Timekeeping.</p></li><li><p>Extensive understanding of JPL/ESD policies, procedures, and practices.</p></li><li><p>Staff Assistant experience in a technical section office environment.</p></li><li><p>Experience using JPL-based tools such as Concur, Service Order Modules, Timekeeping, Requisitions, P-card, UCS, WAMs, Property Manager Gateway Administrator, and JPL-ID.</p></li><li><p>Experience with the JPL-ID process and the onboarding of volunteers, affiliates, and foreign nationals.</p></li><li><p>Experience with JPL foreign and domestic travel policies and procedures.</p></li><li><p>Familiarity with Microsoft Project, Access, SharePoint, Photoshop, Publisher.</p></li><li><p>Ability to identify, learn, and apply new processes to improve oﬃce operations.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$69,576 - $88,608<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Staff-Assistant-III_R4287-1",
    "jobReqId": "R4287",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 4 Days Ago",
    "startDate": "2023-05-10",
    "timeType": "Full time",
    "title": "Staff Assistant III (Section 356 - Electronic Manufacturing, Packaging & Tech Services)"
  },
  "userAuthenticated": false
}
