{
  "jobPostingInfo": {
    "id": "d2416af1eefe1001595aa668b1400000",
    "title": "Institutional Program Business Manager IV",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><u>Overview</u></p><p>As an Institutional Program Business Manager IV, you will be a member of the Program Business Management Division (PBMD), reporting administratively to the Manager of Office 2502, Cost Management Implementation Office (CMIO).</p><p></p><p><u>Responsibilities</u></p><p>In this role you will:</p><ul><li><span>Collaborate with the Manager of Office 2502 to achieve Division 25’s business goals, utilizing the Institution’s business framework and processes.</span></li><li><span>Lead, prepare, and conduct Earned Value Management (EVM) surveillance (compliance) reviews of JPL projects with minimal supervision.</span></li><li><span>Analyze project EVM cost and schedule data to identify non-compliances and discrepancies between projects’ implementation of EVM and requirements such as those described in the JPL EVM System Description and the EIA-748 EVM standard.</span></li><li><span>Conduct data analysis, prepare findings, and brief project teams as part of Integrated Baseline Reviews (IBRs).  Lead IBRs conducted on subcontractors.</span></li><li><span>Perform ad hoc special projects, analyses, and reviews of Division policies and processes related to EVM and related project controls topics.</span></li><li><span>Lead EVM training for Control Account Managers and other project business team members.  Modify/develop EVM training materials as needed.</span></li><li><span>Present EVM surveillance findings to Division 25 Management, Project Management, and Project Business Teams as required.</span></li><li>Act as a CMIO principal Point of Contact (POC) to projects and provide oversight over these activities:<ul><li><span>Communicate key EVM matters to appropriate programmatic and line directorates, including institutional leadership</span></li><li><span>Provide EVM surveillance and compliance interface with business contacts within JPL, NASA HQ, and other organizations</span></li><li>Develop and maintain effective working relationships across the JPL business community</li></ul></li><li><span>Promote and foster best business practices in accordance with established Institutional processes and procedures and in accordance with the Prime Contract</span><ul><li>Develop and implement business processes and products as required by PBMD and the Institution</li><li>Promote employee awareness of best business practices and standards</li><li>Understand performing Center command media and any impact to JPL project controls and EVM processes</li><li>Contribute to, and actively support, long-range institutional initiatives, including Enterprise 2.0</li></ul></li><li>Foster and model JPL’s Leadership Capabilities</li></ul><p></p><p><u>Qualifications </u></p><p>Typically requires a Bachelor degree in Business Administration or similar discipline with a minimum of 9 years of related experience; Master’s degree in similar discipline with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years related experience.</p><ul><li>Significant experience in analyzing large, complex data sets, interpreting results, and developing recommendations</li><li>Breadth of experience in managing and implementing cost and schedule planning, forecasting, analysis, earned value performance measurement, assessment and reporting, project controls, cost estimation &amp; pricing, contracts, subcontracts, and procurements.</li><li>Demonstrated ability to meet rapidly changing project needs and manage competing priorities.</li><li>Ability to maintain an objective perspective in assessment and communication of performance.</li><li>Proven leadership skills and demonstrated ability to develop, motivate, coach, and maintain a high performing team.</li><li>Significant experience providing management, direction, and expertise to activities of a multifunctional organization through managers and/or staff positions that have responsibility for results.</li><li>Effective communication skills in verbal, written, and presentation forms.</li><li>Demonstrated ability to influence sponsors, partners, subcontractors, and peers in a large project environment.</li><li>Ability to travel up to 10% based on business requirements.</li></ul><p></p><p><u>Preferred Qualifications</u></p><ul><li>Thorough knowledge of EVM as defined by the 32 Guidelines of the EIA-748 standard, and familiarity with interpreting the Guidelines in terms of EVM compliance</li><li>Hands-on experience with advanced EVM tools (e.g., Cobra, Empower, MS Project, and similar applications), processes, and techniques</li><li>Advanced knowledge of Excel and MS Office applications</li><li>Thorough knowledge of Laboratory policies and procedures, applicable prime contract requirements, NASA procedural requirements, and government regulations across a range of applications.</li><li>Sustained successful demonstration of expertise, ability, and authority in performing in a business leadership role on a complex technical development.</li><li>Interest in, and experience with, organizational change management, process definition, and process improvement</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$121,680 - $154,440<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 26 Days Ago",
    "startDate": "2023-02-15",
    "timeType": "Full time",
    "jobReqId": "R3399",
    "jobPostingId": "Institutional-Program-Business-Manager-IV_R3399",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Institutional-Program-Business-Manager-IV_R3399"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Institutional Program Business Manager IV, Performance Assessment and Analysis Office",
      "externalPath": "/job/JPL-Campus/Institutional-Program-Business-Manager-IV--Performance-Assessment-and-Analysis-Office_R1940",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    }
  ],
  "userAuthenticated": false
}
