{
  "jobPostingInfo": {
    "id": "ddf5bd0d8fa21000c97d7017a5910000",
    "title": "Staff Assistant II",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p></p><p>The <b>JPL Communications, Tracking and Radar Division </b>performs scientific investigations, advanced technology research, engineering developments and system implementations encompassing space telecommunications, tracking and active remote sensing using electromagnetic waves.</p><p></p><p>Within the Communications, Tracking and Radar Division, the Flight Communications Systems Section develops, delivers and supports Software Defined Radios (SDRs), spacecraft and airborne antennas, RF power amplifiers, and related products for RF system applications including radars, radio science instruments, and GPS tracking sensors.</p><p></p><p>We seek a self-motivated individual who can work well both independently and in a team environment to function as a <b>Group Staff Assistant II</b>. This is primarily an administrative support position demonstrating a solid customer service orientation, great organizational skills and being agile and flexible in the performance of the job. </p><p></p><p>As a member of the Section 337 Business Administration Team, you will report to the Section Business Administration Manager (BAM).  Your responsibilities include:</p><ul><li><p>Providing oﬃce support to multiple technical groups within the Section, as well as providing back-up support to the Section Office and other groups as needed</p></li><li><p>Preparing and processing foreign and domestic travel, generating travel reports, processing affiliate badge requests for domestic and foreign visitors and escorting visitors as necessary</p></li><li><p>P-card purchasing, requisitions and iProcurement orders including ordering office supplies</p></li><li><p>Coordinating meetings via Outlook, maintaining conference room schedules, arranging conference calls via WebEx</p></li><li><p>Assisting with preparation of presentations, graphics, and website inputs, including proofreading and editing</p></li><li><p>Assisting with office moves and new hire preparations</p></li><li><p>Assisting with offboarding actions including clearing checkpoints</p></li><li><p>Updating Work Authorization Memos (WAMs)</p></li><li><p>Coordinating on-site and off-site workshops</p></li><li><p>Assisting with the coordination of candidate interviews including but not limited to preparing interview schedules, etc.</p></li><li><p>Assisting with property inventory</p></li><li><p>Providing paper and electronic timecard assistance</p></li><li><p>Alternate safety Floor Warden</p></li><li><p>Demonstrating a solid customer service orientation, great organization skills, and ﬂexibility in the performance of the job</p></li><li><p>Prioritizing work and completing assignments accurately and in a timely manner</p></li><li><p>Regularly supporting multiple and varied ad hoc assignments</p></li></ul><p></p><p><b>Qualifications: </b></p><ul><li><p>Typically requires a High School diploma with a minimum of 6 years of related experience; Associates degree with a minimum of 1 year of related experience; related required training.</p></li><li><p>Solid understanding of general job aspects speciﬁcally in the secretarial/administrative support profession with strong organizational, computer and interpersonal skills</p></li><li><p>Thorough understanding of oﬃce procedures and oﬃce automation applications: MS Oﬃce, Word, Excel, Power Point, Adobe Acrobat, Outlook and applies knowledge and skills in this area</p></li><li><p>Strong meeting planning and scheduling skills</p></li><li><p>Demonstrated ability to work effectively under pressure on multiple complex tasks, and work independently with minimal supervision to meet commitments with delivering high quality products</p></li><li><p>Willingness to learn new technologies and tools to enhance and/or improve oﬃce procedures and processes</p></li><li><p>Motivated self-starter who takes the initiative to establish and implement process improvements</p></li><li><p>Ability to evaluate situations and apply good judgement in any necessary resolution</p></li><li><p>Must be a team player with excellent written and oral communication skills</p></li><li><p>Ability to interact effectively with all levels of personnel and provide excellent customer service</p></li><li><p>Must exercise proper discretion when dealing with sensitive information</p></li><li><p>Proven success in the administrative support profession with the ability to maintain patience and composure in a dynamic work environment that includes interruptions and changing priories</p></li><li><p>Proficient in Microsoft Word, Excel, PowerPoint, and Outlook</p></li></ul><p></p><p><b>Preferred Skills: </b></p><ul><li><p>Extensive understanding of JPL/ESD policies, procedures, and practices</p></li><li><p>Staff Assistant experience in a technical section office environment</p></li><li><p>Experience using JPL-based tools such as Concur, Service Order Modules, Timekeeping, Requisitions, P-card, UCS, WAMs, Property Manager Gateway Administrator, DocuShare, Alfresco and JPL-ID</p></li><li><p>Experience with the JPL-ID process and on-boarding of volunteers, affiliates, and foreign nationals</p></li><li><p>Experience with JPL foreign and domestic travel policies and procedures</p></li><li><p>Familiar with MS Project, Access, Visio, SharePoint, Photoshop, and Publisher</p></li><li><p>Ability to identify, learn, and apply new processes to improve oﬃce operations</p></li><li><p>General understanding of JPL facilities, safety, and property policies and procedures</p></li><li><p>Willingness to look for, learn, and apply new Information Technology (IT) tools to office procedures and processes.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$57,096 - $74,984<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 6 Days Ago",
    "startDate": "2023-03-14",
    "timeType": "Full time",
    "jobReqId": "R3624",
    "jobPostingId": "Staff-Assistant-II_R3624",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Staff-Assistant-II_R3624"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Group Staff Assistant II",
      "externalPath": "/job/JPL-Campus/Group-Staff-Assistant-II_R4116",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted Today",
      "startDate": "2023-03-20"
    },
    {
      "title": "Staff Assistant II",
      "externalPath": "/job/JPL-Campus/Staff-Assistant-II_R4109",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 4 Days Ago",
      "startDate": "2023-03-16"
    },
    {
      "title": "Staff Assistant II",
      "externalPath": "/job/JPL-Campus/Staff-Assistant-II_R4025",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 20 Days Ago",
      "startDate": "2023-02-28"
    },
    {
      "title": "Staff Assistant II (Standard Temporary Employment Program)",
      "externalPath": "/job/JPL-Campus/Staff-Assistant-II--Standard-Temporary-Employment-Program-_R3998",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 26 Days Ago",
      "startDate": "2023-02-22"
    }
  ],
  "userAuthenticated": false
}
