{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Staff-Assistant-II_R4752",
    "id": "eedf8c71f1f11001c0645ef94a860000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Responsibilities</u></b></p><p></p><p>The <b>Staff Assistant II</b> position is an outstanding opportunity to be part of JPL&#39;s <b>System V&amp;V, Integration, Test, &amp; Launch Engineering</b><b> Section!</b> We provide the systems engineering relating to Verification and Validation, System Testbeds, Systems Test, and Launch Systems Engineering for the laboratory’s key flight projects. Our efforts span both the formulation and implementation lifecycle, and include both leadership and execution in these key subject areas.</p><p></p><p>We are looking for a motivated and dedicated Staff Assistant to join our team within the Business Administration Section. You will report to the Business Administration Manager.</p><p></p><p>As a Staff Assistant, you will perform administrative/clerical support for various technical groups within the System V&amp;V, Integration, Test, &amp; Launch Engineering Section. This role is best suited for a team member that demonstrates great organizational skills, strong customer focus with the ability to work successfully under pressure on multiple tasks, meeting commitments on time, while delivering quality products with minimal direction; requiring general instructions on routine work, and detailed instructions for new assignments. Must be a motivated and collaborative team player, organized, thorough, takes the initiative to establish and implement process-improvements and have a willingness to learn and take on new or ad-hoc assignments. Must enjoy working in a fast-paced, high volume and dynamic organization.</p><p></p><p>Tasks include, but are not limited to the following: </p><p></p><ul><li><p>Preparing sophisticated foreign and domestic travel arrangements and generating travel reports.</p></li><li><p>Processing affiliate badge requests for domestic and foreign visitors and escorting, as necessary.</p></li><li><p>Processing procurement requests via P-card and iProcurement orders.</p></li><li><p>Coordinating meetings via Outlook, maintaining conference room schedules, arranging conference calls</p></li><li><p>Assisting with preparation of presentations, graphics, and website inputs, including proofreading and editing.</p></li><li><p>Assisting with employee on-boarding  and off-boarding activities, including office moves, new hire provision arrangements and preparations.</p></li><li><p>Assisting with Early Career/Experienced/Contractor hire recruiting including but not limited to: preparing interview schedules, escorting, etc.</p></li><li><p>Helping with the planning and coordinating of Section seminars, workshops and social events.</p></li><li><p>May assist with ergonomic evaluations, safety walk-throughs, and property and asset inventories.</p></li></ul><p></p><p></p><p><b><u>Qualifications</u></b> </p><p></p><p>This position typically requires a High School diploma with a minimum of 6 years of related experience; or an Associate’s degree with a minimum of 1 year of related experience</p><ul><li><p>Experience in the secretarial profession with strong organizational, computer and interpersonal skills.</p></li><li><p>Proficient with Microsoft 365, including Word, Outlook, PowerPoint, Excel, SharePoint, Publisher.</p></li><li><p>Familiar with Alfresco, Photoshop, Adobe Reader, Confluence Wiki</p></li><li><p>Excellent written and verbal communication skills.</p></li><li><p>Strong planning, scheduling, and coordinating abilities.</p></li><li><p>Ability to evaluate situations and apply good judgement on best available resolution.</p></li><li><p>Ability to interact effectively with all levels of personnel and provide excellent support for a variety of customers.</p></li><li><p>Exercise proper discretion when handling assignments of a discreet nature and when dealing with sensitive material.</p></li><li><p>Willingness to learn new technologies and tools to enhance and/or improve office processes.</p></li><li><p>Motivated self-starter who takes the initiative to perform activities and resolve unusual or nonstandard problems.</p></li></ul><p></p><p></p><p><b>Preferred Skills: </b></p><p></p><ul><li><p>Experience with JPL foreign and domestic travel policies and procedures and tools.</p></li><li><p>Knowledge of JPL procurement processes such as Purchase Requisition, P-Card and iProcurement.</p></li><li><p>Familiarity with the JPL-ID process and on-boarding of employees, volunteers, affiliates, and foreign nationals.</p></li><li><p>Experience with JPL tools such as Docushare, JPL ID, UCS, Travel and Timekeeping.</p></li><li><p>Extensive understanding of JPL/ESD policies, procedures, and practices.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$57,096 - $74,984<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Staff-Assistant-II_R4752",
    "jobReqId": "R4752",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 25 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-31",
    "timeType": "Full time",
    "title": "Staff Assistant II"
  },
  "userAuthenticated": false
}
