{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Mechanical-Engineer-level-II_R4113",
    "id": "5ad2bec176041000d0d368d8e54b0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the <b>Mechanical Systems Engineering, Fabrication and Test Division </b>which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breadth of mechanical disciplines and is applied from architectural concept development through operations.</p><p></p><p><b><i>Section 352</i></b><i> creates innovative, technically excellent products in an inclusive team environment that offer creative and novel solutions for JPL’s boldest missions.</i></p><p></p><p>As a <b><i>MGSE Engineer II </i></b>, you will be working for JPL’s Spacecraft Mechanical Engineering Section which is responsible for the architecture of mechanical engineering designs and solutions that enable unprecedented missions and science acquisition.  You will work with a team that leads the development of mission enabling technology and end-to-end mechanical systems for all JPL projects and missions.</p><p></p><ul><li><p>Serve as a <b>Mechanical Integration Engineer</b> for a JPL Flight Project.</p></li><li><p>Work in a collaborative environment to design, analyze, build, and test <b>Mechanical Ground Support Equipment (MGSE) </b>and tooling for a Flight Project.</p></li><li><p>Develop <b>Storyboards</b> depicting the Mechanical Integration and Test (I&amp;T) flow to determine MGSE, technical personnel, facilities, and tools that are required for a Flight Project.</p></li><li><p>Interface with engineers, stress and loads analysts, designers, manufacturing specialists, machine shop, flight techs, and project staff. </p></li><li><p>Establish requirements and specify interfaces for flight hardware for MGSE under development.</p></li><li><p>Work independently, and under the direction of the group supervisor, project management, and technical leads.</p></li><li><p>Develop procedures for the testing, usage, and set-up of MGSE designed for Flight Project I&amp;T.</p></li></ul><p></p><p><b><u>Required Skills: </u></b></p><ul><li><p>Bachelor’s degree in Mechanical Engineering, Aerospace Engineering, Civil Engineering or related technical discipline with a minimum of 3 years of related experience; Master’s degree in similar disciplines with a minimum of 1 years of related experience, or PhD in a similar discipline without experience.</p></li><li><p>Knowledge of advanced principles, theories, concepts and techniques for solving mechanical engineering problems, with the ability to perform trade studies, develop conceptual configurations, engineer piece-parts and mechanical systems, and facilitate the fabrication, assembly, and qualification of MGSE hardware.</p></li><li><p>Broad work experience practicing one or more mechanical engineering disciplines for the design, analysis and test of structures and mechanisms, including strength of materials, machine and structure design, structural/mechanical testing, manufacturing engineering, mechanical systems, and machine shop practices.</p></li><li><p>Competency using CAD modeling software (preferably Unigraphics/Siemens NX, SolidWorks, and Teamcenter) used in a Product Delivery Management or similar Concurrent Engineering environment.</p></li><li><p>Experience performing hand stress analysis, and familiarity with Finite Element Analysis.</p></li><li><p>Knowledge of Standards for Geometric Dimensioning and Tolerancing (GD&amp;T) per American Society of Mechanical Engineers (ASME) Y14.5.</p></li><li><p>Extensive knowledge of academic and industry practices and standards across a range of applications related to the development, production and safety of aerospace flight hardware and systems.</p></li><li><p>Proven ability to work in a team environment.</p></li><li><p>Good communication (oral, written, presentation), interpersonal, negotiation and organizational skills.</p></li></ul><p></p><p><u><b>Desired Skills:</b></u></p><ul><li><p>Experience in Assembly, Test and Launch Operations (ATLO), or other direct experience in mechanical integration of spacecraft systems, especially in a clean room and/or high bay</p></li><li><p>Direct role in the development and delivery of mechanical hardware, especially MGSE or flight system hardware</p></li><li><p>Experience leading two or more engineers and or technicians for an integration project</p></li><li><p>Experience writing assembly and test procedures</p></li><li><p>Knowledge of ASME B30 Series, NASA, AWS (American Welding Society), OSHA, and other industry and government standards</p></li><li><p>Ability to produce CAD models and engineering drawings, especially using Seimens NX</p></li><li><p>Ability to create Finite Element Models (FEM) for internal loads calculations, modal frequency analysis, and buckling analysis.</p></li><li><p>Active TS/SSBI clearance</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$96,096 - $117,104<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Mechanical-Engineer-level-II_R4113",
    "jobReqId": "R4113",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 13 Days Ago",
    "startDate": "2023-03-30",
    "timeType": "Full time",
    "title": "Mechanical Ground Support Equipment (MGSE) Engineer II"
  },
  "userAuthenticated": false
}
