{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/RF-Microwave-Engineer-I_R4675",
    "id": "bbc5223b63e610011ea5405db7ec0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Please see the Discipline Matrix on the HR Knowledge Base Website under Job Classifications.</p><p></p><p><b>Will Statement:</b></p><p>Be a member of the Applied Electromagnetics  Group 333K, which is responsible for DSN Antenna Microwave, Transmitter and Low Noise Amplifier Engineering and report to the 333K Supervisor.</p><p>Take part in the design and analysis of high power transmitters and related technology for use in the NASA Deep Space Network and projects for other customers. Work independently without direction. Will be the engineer for high power transmitter development. Will participate and support the activities of the test engineers. Exhibit ingenuity and creativity by applying advanced engineering principles to solve key issues with the development and integration of high power transmitter systems.</p><p>Will support design, development, and tests of radio frequency (RF) and/or microwave systems architecture, components, circuits, or products including antenna design, both reflector and array systems, frequency synthesizers, transmitters and receiver front-ends. May include specifying, designing and testing for compatibility with applicable electromagnetic environments.</p><ul><li>Regular use of creativity and innovation, often solving key problems in discipline.</li></ul><ul><li>Analysis of situation or data, which requires identification, review and interpretation of extremely complex factors.</li><li>Exercises guided, and supervised initiative in evaluating potential approaches and solutions to new and unusual problems and determining appropriate resolutions.</li><li>Designs and develops complex and significant RF system architectures</li><li>Applies experience to carry out the development of analysis, simulations and tests to verify RF system functionality.</li><li>Implements and delivers state-of- the-art RF system designs that represent significant breakthroughs in discipline.</li><li>Applies in reviewed environment, knowledge to design RF components and circuits that are highly complex.</li><li>Helps develop and supports unique methods and tools for the design of RF components and circuits</li><li>Partners with other engineers and management to integrate components into highly complex systems.</li><li>Supports formulation of highly complex and significant RF components requirements.</li><li>Designs and develops methods and tools for performance evaluation of current and new RF components, sub-systems, and systems</li><li>Learns to institutional know-how to prepare significant requirements documents, interface agreements, verification and validation (V&amp;V) plans, and risk mitigation plans and executes V&amp;V plan.</li><li>Participates in subsystem and system level test and verification teams.</li><li>Develops detailed test and verification plans from subsystem requirements.</li><li>Develops and maintains testbed and lab facilities compliant with flight hardware safety practices.</li><li>Supports creation of change requests.</li><li>Partners with other engineers, project personnel and management to plan the management of the system engineering task.</li></ul><p><b>Required Qualifications: </b></p><ul><li>Bachelors degree in Electrical, or related technical discipline with a minimum of 1 year  of related experience; Masters degree in similar disciplines with a minimum of 0 years of related experience.</li><li>Knowledge in the following areas: State-of-the art microwave technology including experience with design and analysis tools for device modeling and circuit design; microwave parameter and noise measurement techniques; microwave device manufacturing processes.</li><li>Fundamental understanding and application of principles, theories, concepts and techniques in the manufacture of RF, high power amplifiers.</li><li>Team player with exceptional communication, interpersonal, verbal and presentation skills.</li><li>Exposure with RF design tools such 3D mechanical design tools.</li><li>Travel to domestic and foreign work locations.</li></ul><p><b>Preferred Skills: </b></p><ul><li>Knowledge of applicable industry and/or academic practices and standards in radiating systems that utilize electromagnetic or statistical optics technologies.</li><li>Experience with laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications.</li><li>Interest in developing new customers.</li><li>Direct experience with associated technologies including digital hardware and monitor &amp; control software.</li><li>Experience with automated test equipment development.</li><li>Experience with optical communication systems and components including cooled detector technology.</li><li>Demonstrated technical exposure in the design, analyze and deliver related technology from the component level up to, but not necessarily including, system level.</li><li>Experience with Matlab, Python, AutoCad and Solidworks.</li><li>Hands-on, trouble shooting and design experience with AC and DC circuits.</li></ul><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$85,696 - $104,312<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "RF-Microwave-Engineer-I_R4675",
    "jobReqId": "R4675",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-16",
    "timeType": "Full time",
    "title": "RF Microwave Engineer I"
  },
  "userAuthenticated": false
}
