{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Electronic-Development-Technician_R4768",
    "id": "4112b9df97be1001bfe68cc873c30000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the Mechanical Systems Engineering, Fabrication and Test Division which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breadth of mechanical disciplines and is applied from architectural concept development through operations.</p><p></p><p>As an Electronic Development Technician IV, you will be supporting the Electronic Manufacturing, Packaging, &amp; Technical Services Section, which provides engineering services that include the following: fabrication of electronics (boards and cables/harnesses), microelectronic and photonic hardware; electronic packaging, manufacturing engineering and electronic hardware thermal/structural analysis; advanced electronic packaging engineering, technology development and process engineering; technical facilities management and cleanroom services/certification; custom measurement systems development and instrumentation services; calibration services, test equipment loan pool and metrology engineering, and technical inventory management, cryogenics services and Flight Hardware Logistics Program (FHLP).</p><p></p><p><b><u>Responsibilities:</u></b></p><ul><li><p>Perform printed wiring board electronic assembly, hybrid, hand soldering, connector pin crimping, cabling, chassis wiring, microelectronic assembly, mechanical assembly, and chassis wiring for engineering model and flight electronic systems with minimal supervision.</p></li><li><p>Use and operate modern robotic and manual manufacturing tools and equipment to produce high reliability printed wiring electronic assemblies and hybrid/microelectronic assemblies.</p></li><li><p>Support the manufacturer engineer in assessing and recommending design modifications.</p></li><li><p>Analyze test data and present results.</p></li><li><p>Support various customer labs and the Spacecraft Assembly Facility in final integration, when required.</p></li><li><p>Provides mentoring and coaching to less experienced personnel.</p></li></ul><p></p><p><b><u>Qualifications:</u></b></p><ul><li><p>Typically requires a High School diploma with a minimum of 10 years of related experience; an Associate’s degree with a minimum of 6 years of related experience; or a Bachelor’s degree with a minimum of 3 years of related experience.</p></li><li><p>Advanced knowledge of electronic and mechanical fabrication techniques to fabricate and assemble complex mechanical, electronic, electro-mechanical, hybrid, cable harness assembly and microelectronics systems, devices, fixtures, parts or equipment.</p></li><li><p>Advanced understanding of work techniques, applicable policies, procedures and practices in planning, setup, repair and/or modification of mechanical, electronic or electro-mechanical systems, experimental design circuitry, prototype models or specialized test equipment.</p></li><li><p>Experience in working from schematics, rough sketches, diagrams, layouts or plans often requiring interpretation.</p></li><li><p>Has used innovative and creative approaches in resolving unusual situations.</p></li><li><p>Participated on teams within and outside of own organization.</p></li><li><p>Extensive experience in working in cleanroom environments and ESD workstations.</p></li><li><p>Ability to work under a microscope.</p></li></ul><p></p><p><b><u>Preferred Skills:</u></b></p><ul><li><p>Demonstrated IPC J-STD-001 and/or NASA 8739 certification training.</p></li><li><p>Demonstrated experience in Surface Mount Technology printed wiring assemblies.</p></li><li><p>Demonstrated experience in polymerics adhesives, potting, and conformal coating material application and mixing.</p></li><li><p>Demonstrated experience with JPL fabrication standards for printed wiring electronic assemblies, cables and harnesses.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$87,672 - $107,744<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Electronic-Development-Technician_R4768",
    "jobReqId": "R4768",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 29 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-09-07",
    "timeType": "Full time",
    "title": "Electronic Development Technician"
  },
  "userAuthenticated": false
}
