{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Electrical-Engineer-IV_R4329-1",
    "id": "129f4f4c50e91000be77730512620001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This is an opportunity to join <b>349D - Electronics Test Hardware Engineering Group</b>. The group plays an essential role in <b>Section 349 – Flight Electronics</b>. As a member of this group you will design, build and test specialized, mission-critical systems used for avionics and system verification.  Our customers include product delivery managers, system testbeds, Assembly Test Lunch Operations (ATLO) testbed mangers, and mission operations managers. </p><p>In this role you will collaborate and/or participate with our senior engineers supporting the Europa and Mars Sample Return missions.</p><p></p><p>This role is ideal for a candidate who works closely with others and meets the demands of flight-projects. The job entails understanding customer requirements, matching requirements with existing product lines or enhancements to the product line.  The person hired for this position will oversee hardware deliveries of flight and bench test equipment racks interfacing with Flight Computer and other boxes to test their functionality. This person would interface with Flight Electronics and Electronics Test Hardware Engineering teams, support equipment software team, and system engineers and end customer. This person would be the hardware team lead, and report to product delivery lead and Group Supervisor.</p><p></p><p> <b><u>Responsibilities</u></b></p><ul><li>Oversee team of engineers/technicians to design/develop/produce Support Equipment hardware and cabling.</li><li>Work with Avionics and other subsystem teams to generate L4 requirements and derive L5 requirements.</li><li>Develop and release documentation to fully describe the Support Equipment products.</li><li>Oversee V&amp;V of Support Equipment hardware.</li><li>Follow JPL policies.</li><li>Provide cost estimates of hardware/workforce to PDL.</li><li>Participate in various Reviews from Peer level to CDR.</li><li>Facilitate closure of Problem Reports using Institutional Tools.</li><li>Support of delivered products from Box level to ATLO.</li><li>Perform reliability analysis and prepare FMEA (Failure Modes and Effects Analysis) for different interfaces.</li><li>Manage hardware procurements, work with external vendors to streamline the process.</li></ul><p></p><p><b><u>Qualifications </u></b></p><p>Bachelors degree in Computer Engineering, Computer Science, Electrical Engineering, or related technical discipline with typically a minimum of 9 years of related experience or Masters degree in similar disciplines with a minimum of 7 years of related experience or PhD degree in similar disciplines with a minimum of 5 years of related experience.  Level will be determined according to candidate experience and achievement.</p><p></p><ul><li><b>MUST HAVE: Evidence of experience designing multi-layer boards, mixed signal, high-speed designs, performing signal integrity analysis, and performing length tuning, impedance matching, and stackup design techniques. </b></li><li>Knowledge of electronic and power circuits with emphasis of interface level circuits to Avionics hardware.</li><li>Signal integrity design and analysis, especially using Hyperlynx</li><li>Skilled in analog and/or mixed signal design, and/or high-speed digital design</li><li>Knowledge of FPGA digital design.</li><li>Ability to effectively communicate to various teams.</li><li>Detail oriented to effectively provide status of current work to various customers</li><li>Board design, cable design, and electrical system design experience</li><li>Experience with industry standard CAE (computer-aided engineering) tools for electronics design and electrical engineering, such as DxDesigner, LTspice, Altium, Visio, Multisim/Verilog-XL, as well as EE electronic lab equipment, including ISE or Vivado, Modelsim or QuestaSim, Oscilloscopes</li><li>Track record of leading teams and/or mentoring junior engineers </li></ul><p></p><p>Must be a US Citizen or legal permanent resident (LPR).<br /><br /><b><u>Desired Skills: </u></b></p><ul><li>Knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</li><li>Experience with simulation and test equipment.</li><li>Experience with ground data systems.</li><li>GIT repository configuration and/or version management</li><li>High speed SERDES buses (PCIe/Ethernet)</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$143,936 - $180,960<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Electrical-Engineer-IV_R4329-1",
    "jobReqId": "R4329",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "startDate": "2023-05-15",
    "timeType": "Full time",
    "title": "Electrical Engineer IV"
  },
  "userAuthenticated": false
}
