{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Enterprise-Systems-Analyst-Level-II_R4587",
    "id": "db763f83b2ba1000bc97732523a40000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>We currently have a full-time opportunity for an<b> LMS Administrator</b>, reporting to the Head of Technical Learning &amp; Development within Human Resources. The Technical Learning and Development (TL&amp;D) team is responsible for the consultation, design, development, and delivery of learning solutions to equip JPL employees with the right skills and capabilities needed for their role. As a center of excellence (CoE), our vision is to engage our learners through adaptive, personalized learning experiences that enable their continuous learning needs.</p><p></p><p>As the LMS Administrator, you will be responsible for the day-to-day administrative support of our learning information systems, <b>SumTotal LMS and Degreed</b>. Your goal will be to ensure a successful learning experience for our employees as they access and discover learning across JPL’s ecosystem.</p><p></p><p>Duties include acting as first point of contact for learning system inquiries, troubleshooting technical issues, building courses, creating audiences, managing users, building reports, analyzing usage data, and supporting the needs of your TL&amp;D partners to enable the delivery of our online and in-person learning programs. You will also work closely with TL&amp;D and HR system administrators to support the continuous improvement of our integrated learning information systems including but not limited to LinkedIn Learning, SATERN LMS, and Workday.</p><p></p><p>Ideally, you are an experienced subject matter expert in LMS administration with expert functional and technical experience working with SumTotal LMS, and proficient experience with Degreed and Workday.</p><p></p><p><b><span>Responsibilities:</span></b></p><ul><li><p><span>Serve as first line of technical learning system support for internal and external stakeholders, JPL employees and other LMS Administrators</span></p></li><li><p><span>Provide day-to-day system administration, configuration, and technical support for SumTotal LMS and Degreed</span></p></li><li><p><span>Translate business and user needs into functional requirements and recommended solutions using TL&amp;D’s learning ecosystem.</span></p></li><li><p><span>Build, test and validate course structures, plans and pathways within SumTotal LMS and Degreed.</span></p></li><li><p><span>Create audiences, assignments, and business logic to meet program requirements.</span></p></li><li><p><span>Create and manage events, sessions, assessments, curricula, evaluations, email notifications, custom reports, trending reports, etc.</span></p></li><li><p><span>Facilitate User Acceptance and usability testing to validate system and user requirements.</span></p></li><li><p>Create and administer learning resources to support learners and instructors on how to use JPL’s learning systems.</p></li><li><p><span>Manage all Tier 2 learning system support inquiries, diagnosing and resolving technical issues for employees and stakeholders. </span></p></li><li><p><span>Act as LMS consultant, providing best practice insights to clients and peers.</span></p></li><li><p><span>Support TL&amp;D system administrators in routine system upgrades, testing, migrations, and integrations.</span></p></li><li><p><span>Use learning data metrics to identify trends, insights, and recommendations to improve learner experience.</span></p></li></ul><p></p><p><b><span>Qualifications:</span></b></p><p></p><ul><li><p><b><span>Typically requires a Bachelor’s degree in Computing Science, Information Technology or similar discipline with</span> 3 years of related experience; Masters with 1 years of related experience; or PhD with 0 years of related experience</b></p></li><li><p><b><span>Experience in LMS Administration that supports online, hybrid and blended instruction. </span></b></p></li><li><p><span>Strong experience working with SumTotal LMS, Degreed and Workday.</span></p></li><li><p><span>Proficient experience working with LinkedIn Learning and WebEx or similar platforms.</span></p></li><li><p><span>Demonstrated proficiency in web development skills including REST API, JavaScript, HTML, CSS, and SQL.</span></p></li><li><p><span>Experience developing advanced reports and dashboards.</span></p></li><li><p><span>Ability to gather data, compile information, and prepare data analysis reports.</span></p></li><li><p><span>Superior technical troubleshooting skills.</span></p></li><li><p><span>Strong customer service skills.</span></p></li><li><p><span>Demonstrated success in project management.</span></p></li><li><p><span>Ability to handle multiple projects simultaneously.</span></p></li><li><p><span>Excellent written and oral communication skills.</span></p></li><li><p><span>Ability to share knowledge and work in a strong team-oriented environment.</span></p></li><li><p><span>Ability to interpret, apply and explain technical requirements, policies and procedures.</span></p></li></ul><p></p><p><b><span>Preferred Skills:</span></b></p><ul><li><p><span>Experience working with agile methodologies.</span></p></li><li><p><span>Understanding of adult learning and instructional design methodologies.</span></p></li><li><p><span>Thorough knowledge of business and process analysis and design.</span></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$112,070 - $120,016<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Enterprise-Systems-Analyst-Level-II_R4587",
    "jobReqId": "R4587",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 8 Days Ago",
    "startDate": "2023-07-25",
    "timeType": "Full time",
    "title": "LMS Administrator (SumTotal LMS, Degreed)"
  },
  "userAuthenticated": false
}
