{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technical-Writer-Editor-Publisher_R4664",
    "id": "eedf8c71f1f1100108e3fa896cfd0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is seeking a Technical <span>Writer/Editor/Publisher</span> to join our Documentation Services Group, which provides technical writing, editing, production, and knowledge-capture services to JPL’s scientific, technical, and institutional communities.</p><p></p><p><b>Responsibilities:</b></p><ul><li><p>Plan, organize, research, write, edit, format, and/or produce very complex scientific, technical, and administrative documents and multimedia products (e.g., proposals, reports, hardware and software documentation, presentations, journal articles, and conference papers) for internal and external audiences, using a variety of publication software, content-management tools, and workflows.</p></li><li><p>Document the results of scientific, technical, and institutional activities, including boards, committees, and teams, often in real time through meetings, interviews, or other forums; and appropriately apply and tailor knowledge-capture methods, processes, and tools to these activities and situations.</p></li><li><p>Take end-to-end responsibility for complex and wide-ranging work assignments, from initiation through delivery, distribution, and archiving of work products; responsible for completing significant project or assignment milestones and accountable for results, including performance standards, budget, and schedule.</p></li><li><p>Gather requirements directly from users, and define strategies for implementation; identify, analyze, and resolve complex, diverse issues; negotiate, create, and track scope, cost, and schedule estimates for complex and wide-ranging work assignments; keep customers, management, and stakeholders informed of status.</p></li><li><p>Advise authors on complex questions on language, style, and audience awareness; conduct quality review of technical materials, including approving others’ work and ensuring compliance with requirements.</p></li><li><p>Research and analyze industry standards, trends, and technologies; and develop recommendations to management, customers, and stakeholders.</p></li><li><p>Work independently on key projects and assignments with only limited direction, typically receiving few or no instructions.</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p><b>Typically requires a Bachelor’s degree in technical writing or related discipline with a minimum of six years of related experience; Master’s degree in similar disciplines with a minimum of four years of related experience; or PhD with two years of related experience.</b></p></li><li><p>Extensive understanding and wide application of advanced principles, theories, concepts, and techniques in a relevant field of knowledge, including advanced knowledge of applicable industry and/or academic practices and standards; and advanced knowledge in one or more related fields.</p></li><li><p>Recent experience writing, editing, producing, and overseeing technical proposals, reports, presentations, and/or similar documentation and multimedia products; experience editing technical journal articles, research papers, manuscripts, and/or books; knowledge of the end-to-end documentation process, from intake to printed and electronic output and distribution.</p></li><li><p>Experience documenting scientific, technical, and/or business information, including in real time. Experience developing usable and accessible documentation and other communication products.</p></li><li><p>Advanced skills in Microsoft 365 (Word, Excel, PowerPoint, Teams), Adobe Creative Cloud (Acrobat, InDesign/InCopy, Photoshop, Illustrator), and collaborative authoring and enterprise content management tools; experience with LaTeX.</p></li><li><p>Experience working on diverse, high-performance teams and managing complex and wide-ranging technical communication projects, including preparing schedules, scopes of work, and budgets; assigning and monitoring work; and meeting quality requirements.</p></li><li><p>Demonstrated understanding of the value of diversity, and experience fostering an inclusive working and learning environment.</p></li><li><p>Excellent oral and written communication skills; ability to communicate and advocate discipline-related knowledge, services, and programs.</p></li><li><p>Excellent interpersonal skills and strong customer focus; ability to coordinate and collaborate effectively in a team environment, either working as an essential contributor or as a leader; experience mentoring and coaching others.</p></li><li><p>Excellent organizational skills; ability to complete detailed tasks accurately and efficiently.</p></li><li><p>Sound critical analysis and problem-solving skills, with the ability to collaborate with technical teams to develop creative and innovative solutions for technical communication issues.</p></li><li><p>Ability to innovate work processes and implement industry-best practices in technical communication technology and methods, including knowledge capture.</p></li><li><p>Ability to use good judgment and quickly respond to changing priorities; ability to meet commitments, including deadlines and budgets.</p></li><li><p>Willingness to work extra hours, including nights and weekends (eligible for overtime pay); willingness to travel.</p></li><li><p>General understanding of, or interest in, space exploration or related science or engineering fields; advanced knowledge of, or ability to learn and appropriately apply, Laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$89,856 - $110,760<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Technical-Writer-Editor-Publisher_R4664",
    "jobReqId": "R4664",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 24 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-29",
    "timeType": "Full time",
    "title": "Technical Writer/Editor/Publisher"
  },
  "userAuthenticated": false
}
