{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Instrument-Systems-Engineering-Academic-Part-Time-Intern_R4728",
    "id": "eedf8c71f1f110015e1fb9ccf0cf0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The<b> Instruments Division</b> provides engineering and technology leadership in the development of scientific instruments to explore the Earth, planets, and the cosmos beyond.  Applications include ground based, airborne, sub-orbital, and space-based instruments and systems.  Division capabilities range from instrument conceptual design through implementation, deployment, and science product generation and distribution.</p><p></p><p>The<b> Academic Part-Time Undergraduate Student </b>will be working within the Instruments Division, <b>the Instrument Systems Section (382),</b> that provides the Laboratory with centers of expertise in the formulation and implementation of scientific instruments, cryogenic systems, and airborne/suborbital scientific investigations. The <b>Academic Part-Time Undergraduate Student</b> will be a member of the <b>Instrument System Engineering (382D) </b>group and will report to the <b>Group Supervisor.</b> </p><p></p><p>Responsibilities:</p><p>The selected candidate will be working within the Near Earth Objects Surveyor (NEOS) Instrument Systems Engineering team. Typical assignments will involve a) working with discipline engineers across the instrument subsystems to generate and document verification activity plans in DOORS NextGen in preparation for the upcoming instrument Critical Design Review (CDR); b) managing and updating the content of interface control documents; c) action item tracking and closure; d) Engineering Change Request generation, tracking and implementation; e) risk item tracking and management.</p><p></p><p>Qualifications:</p><ul><li>Must be currently enrolled at a local, accredited, college or university at least half-time, pursuing a Bachelors degree or Graduate Degree in Engineering, Physics, Astrophysics, or related filed.</li><li>Minimum GPA 3.0.</li><li>Must be available to work a minimum of 10 hours/week, with at least half of them on the JPL campus</li><li>Knowledge and experience with Python or other scripting language, MATLAB, MS Office.</li><li>Excellent written and verbal communication skills.</li><li>General knowledge of applicable industry and/or academic practices and standards in working with mechanical, optical, and electrical hardware.</li><li>Willingness and flexibility to receive direction and mentoring from project leadership.</li><li>Prior experience working in a systems engineering environment, preferably on a science-driven flight project.</li><li>Ability to work both independently in a self-directed environment as well as collaboratively within a team.</li></ul><p></p><p>Desired:</p><ul><li>Prior internship experience in related engineering disciplines.</li><li>Demonstrated ability to work across a multitude of technical disciplines and skill in translating engineering challenges from one domain area to another.</li><li>Hands-on experience through class projects or work-study programs, especially in a lab environment.</li><li>Coursework providing an understanding and application of standard principles, theories, concepts and techniques in engineering disciplines and/or optical observation techniques</li><li>Familiarity with common test equipment such as oscilloscopes, multimeters, and power supplies.</li><li>Knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</li><li>Participation in student organizations.</li></ul><p><span>The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Instrument-Systems-Engineering-Academic-Part-Time-Intern_R4728",
    "jobReqId": "R4728",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Yesterday",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-30",
    "timeType": "Part time",
    "title": "Instrument Systems Engineering Academic Part Time Intern"
  },
  "userAuthenticated": false
}
