{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Enterprise-Systems-Analyst-IV_R4331",
    "id": "129f4f4c50e91000b5a51cab21800000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>NASA&#39;s Jet Propulsion Laboratory (JPL) is seeking an experienced Enterprise Systems Analyst for full time work at our Headquarters in Pasadena, CA. As a Product Lifecycle Management (PLM)/Computer Aided Engineering (CAE) for the PLM and CAE group, responsibilities will include: </p><p></p><ul><li>Both technical and functional responsibilities for the planning, architecture, implementation, and support of PLM/CAE applications, specifically Teamcenter 4-tier Rich application Client, Teamcenter Active Workspace Client, NX, SWIMM, EDA, TcRA, along with various other CAE applications, in a fast-paced environment.</li><li>Configure, manage and support Siemens Teamcenter as the Product Data Management system, leveraging skills and experiences in:Access Management, Project Security, Organization, Workflow, Query Building, Business Model, Structure Manager, Checkmate, JT Generate, Teamcenter Reporting and Analytics, Library Parts Management, Visualization Server, bill of Material, Mass Properties, and Dispatcher, Teamcenter Version 13.x or above.</li><li>Provide product support and interface across a broad user community to perform issues resolution, process enforcement, troubleshooting, and training, to drive user adoption and satisfaction.</li><li>Provide documentation for end user support in the form of user guide, training material, FAQ, self-help WIKI, and release notes.</li><li>Deliver training on major rollouts and as part of on-going user support.</li><li>Capture and document user requirements, translate to detailed development specification, create and execute test cases, and document change.</li><li>Work closely with the Engineering organization (including the Engineering Tools and Process Office and multiple Engineering and IT organizations (including product manager, development/configuration team, HelpDesk/support team, infrastructure/operations team, and line management) to ensure strong partnership between Engineering and IT.</li><li>Understanding of the current Teamcenter PLM application architecture and capabilities to evaluate the technical and business impact of ongoing delivery of new features/modules.</li><li>Collaborate with technical team members and external customers to define and implement solutions for PLM/CAE applications including streamlining processes, evaluating impact, updating or replacing existing solutions, determining deliverables, and developing release notes/training materials.</li><li>Deploying, maintaining, and upgrading Teamcenter, NX, SolidWorks, and EDA including application configurations, software validation, user acceptance testing, application rollout, issue tracking and resolution.</li><li>Delivering prototypes to help stakeholders and product team to comprehend new features/functionalities.</li><li>Owning and solving performance and availability issues in different Teamcenter implementations, serving as a go to person for complex issues that may arise in Production/QA/DEV environments.</li><li>Expert-level practitioner of Agile development process, using Jira scrum.</li><li>Experience working and handling ITAR and EAR data.</li></ul><p></p><p><b><u>Requirements</u></b>:</p><ul><li>Typically requires a Bachelor’s degree in Computer Science, Computer Engineering, Mechanical Engineering or related discipline with a minimum of 9 years of related experience; Master’s degree in similar disciplines with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years related experience.</li><li>Experience in the following areas:  Project Management, Application administration, User support, Operations support, Installation, Configuration Management, and/or Software Development Lifecycle.</li><li>Expert knowledge of Siemens Teamcenter Unified Architecture (v13.2 or higher) technical architecture and deployment/operations setup and configuration practices</li><li>A proven track record demonstrating the design, development, implementation, delivery, and maintenance of PDM and PLM systems. </li><li>Experience with engineering process workflows including workflow metrics and reporting, role-based access, and security models, specifically Teamcenter ADA, in an Aerospace or Automotive setting. </li><li>Experience with Rich Application Client and Teamcenter Active Workspace Client</li><li>Wide-ranging experience in the following areas: Product Lifecycle Management, Product Data Management, Computer Aided Design, Bill of Material, Mechanical/Electrical CAD, Model-based Engineering, Enterprise Resource Planning, Data Warehouse, Service Oriented Architecture</li><li>In-depth knowledge and direct working experience with the core technologies typically used to support Multi-tier enterprise application platforms, lifecycle management systems, and their implementation, delivery, and operations. </li><li>Extensive understanding of enterprise application principles, theories, concepts and techniques in Product Data Management, Project Management, Requirements Gathering, User Acceptance, Software implementation and validation, Software Configuration Management, and/or Production System rollout. </li><li>Excellent teaming skills, capable of synergizing, and guiding a team of highly technical individuals. </li><li>Excellent written and verbal communication skills, capable of effectively capturing and communicating technical information at all levels. </li><li>Excellent product delivery experience interfacing with sponsors, stakeholders, process owners, and users. </li><li>Previous implementation and maintenance experience with Mechanical design software: Siemens NX v1953 or higher, SolidWorks v2021 or higher</li><li>Experience in agile development methodology applied to iterative software releases and feature deliveries. </li></ul><p></p><p><b><u>Preferred Skills</u></b>: </p><ul><li>Experience in or with the following:<ul><li>Siemens NX v1953&#43; encompassing Bill of Materials, Assembly Management, Library Parts, Visualization, Data translation, Checkmate, Mass Properties</li><li>Teamcenter Reporting and Analytics development, configuration and management</li><li>Teamcenter CAD Connector integration with SolidWorks, Altium, etc. </li><li>Mechanical design principles and familiarity with highly complex and unique 3D models</li><li>SOA Gateway and integration with Oracle ESB/SOA technology</li><li>SolidWorks, Altium, Mentor Graphics</li><li>Siemens Teamcenter Translation Server</li></ul></li><li>Issue/resolution tracking using Jira</li><li>End-user support using ServiceNow</li><li>Source-code Control and Configuration Management using GitHub</li><li>Test management using TestRail</li><li>ITK Programming</li><li>Knowledge of Laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$128,648 - $164,008<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Enterprise-Systems-Analyst-IV_R4331",
    "jobReqId": "R4331",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 20 Days Ago",
    "startDate": "2023-05-15",
    "timeType": "Full time",
    "title": "Enterprise Systems Analyst IV"
  },
  "userAuthenticated": false
}
