{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Engineering-Undergraduate-Student_R3324",
    "id": "91a0498fd1bb1001f923052423740000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Responsibilities </u></b></p><p></p><p>JPL’s<b> Electronic Design Validation &amp; Test Group</b> plays an essential role in the<b> Flight Electronics Section</b>. As an engineering intern, you will assist the group supporting the engineering staff in the development and execution of flight electronics tests.  The engineering process employs physical, human and intellectual property. The successful candidate will assist the engineering staff in both designing, building, testing and operating these systems.  </p><p></p><p>Our customers include flight-software delivery managers, product delivery managers, system testbeds, verification and validation engineers, system integration and test and mission operations managers.</p><p></p><p>In this role, you will collaborate with our senior engineers supporting the Mars Sample Return missions.</p><p></p><p>This role is ideal for a candidate who can closely work with others. The job entails understanding inherited software modules, modifying and creating new software modules, thoroughly testing software functions and delivering software to flight projects.</p><p></p><p>Daily duties may include:</p><ul><li>Develop software, under the direction of group manager.</li><li>Develop and test resource management software.</li><li>Operate resource management system.</li><li>Document software, within design documents and user manuals.</li><li>Integration and compile software applications.</li><li>Execute performance and regression testing.</li><li>Deploy and train software for the end-user.</li></ul><p></p><p><b><u>Qualifications: </u></b></p><p></p><p>This position is for a college student working toward a bachelor’s degree in Computer Science, Information Science, Electrical Engineering, Computer Engineering or related discipline.</p><ul><li>Minimum of a 3.0 GPA.</li><li>Knowledge in analog and digital electronics</li><li>Knowledge of one or more high-level general-purpose programming languages, such as C/C&#43;&#43;, Java, Perl, Python, SQL or similar language.</li></ul><p></p><p><b><u>Preferred qualifications include:</u></b></p><ul><li>Experience with UNIX or Linux operating systems.</li><li>Excellent written and verbal communications skills. </li><li>Strong interpersonal skills with demonstrated effectiveness in a team environment. </li><li>Ability to work independently under a set schedule. </li><li>Basic understanding of system engineering and development process.</li><li>Strong interest infusing new approaches to software computing into legacy developments.</li><li></li></ul><p>The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Engineering-Undergraduate-Student_R3324",
    "jobReqId": "R3324",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 14 Days Ago",
    "startDate": "2023-04-05",
    "timeType": "Full time",
    "title": "Engineering Undergraduate Student - Summer 2023 Internship"
  },
  "userAuthenticated": false
}
