{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Facilities-Electric-Systems-Engineer--Facilities-Quality-Assurance-II_R4696",
    "id": "bbc5223b63e610015e33089519150000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Facilities Management is responsible for the overall physical development and maintenance of the laboratory. The mission of the department is to provide superior logistics, advanced workplaces, and resilient infrastructure to enable optimal Laboratory operations.</p><p></p><p>Facilities personnel are responsible for the overall development and maintenance of the JPL physical property which resides on 167 acres, with 2.5 million square feet of offices and laboratories in 128 buildings, housing over 6000 people. The mission of the division is to provide a safe environment that promotes the advancement and transfer of knowledge in support of JPL’s projects and missions.</p><p></p><p>In this role, you will be a member of the JPL Facilities team and you <span>will </span>report to the supervisor of the facilities Standards &amp; Compliance (S&amp;C) Group. <span>You will be a subject matter expert in <b>electrical codes </b>and standards, ANSI/NETA and third-party commissioning.</span> The work is quick paced and exciting with the main focus to <span>perform complex plan reviews within the electrical, communication, fire alarm design, electronic safety, and security disciplines. You will interpret code questions, issue permits, and verify projects for compliance with California Title 24 Codes, NASA, JPL Standards and associated documents. </span>You will work closely with internal and external engineers, architects, commissioning agents, project managers and JPL&#39;s safety organization.</p><p></p><p>S&amp;C is an experienced group that collaborate closely with one another as a team. We share knowledge, training and transfer knowledge to help each member continue to excel in their job performance. S&amp;C is responsible for reviewing and permitting all facilities design and construction work. In short, S&amp;C is the “Building Department” like it would be for any city or jurisdiction. In addition, S&amp;C functions as the quality assurance for JPL Facilities and the contract managers for the facilities commissioning services.</p><p></p><p><b>The following qualifications are required:  </b></p><ul><li><p>Typically requires a bachelor’s degree in electrical engineering, construction or project management, or similar discipline with a minimum of 3 years related experience; or master’s degree in similar disciplines with a minimum of 1-year related experience.   </p></li><li><p>Experience with <b><span>California Title 24 Codes </span></b><span>with an <b>emphasis on electrical, fire, and energy codes</b>.</span></p></li><li><p><span>Experience with <b>third-party commissioning</b>.</span></p></li><li><p>Experience with <b><span>commercial and industrial facilitie</span></b><span>s.</span></p></li><li><p><span>Demonstrated knowledge of <b>electrical distribution apparatus.</b></span></p></li><li><p>Communicates clearly, professionally, and effectively to facilitate the review of construction documents and approval of construction permit applications.</p></li><li><p>Experience with building design standards, including specifications.</p></li><li><p>Researches and interprets building codes and standards.</p></li><li><p>Works with building inspectors and contractors to resolve field related code issues.</p></li><li><p>Performs other related duties and responsibilities as required.</p></li></ul><p></p><p><b>The following qualifications are preferred:</b></p><ul><li><p><span>Current ICC Electrical Plans Examiner certificate</span></p></li><li><p>Facilities experience working on<span> government project</span>s.</p></li><li><p>Experience with the <span>commissioning process</span>.</p></li><li><p><span>Electrical contractor’s license</span></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$82,472 - $102,752<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Facilities-Electric-Systems-Engineer--Facilities-Quality-Assurance-II_R4696",
    "jobReqId": "R4696",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 8 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-16",
    "timeType": "Full time",
    "title": "Facilities Electric Systems Engineer, Facilities Quality Assurance II"
  },
  "userAuthenticated": false
}
