{
  "jobPostingInfo": {
    "id": "68d974ab1b03100103ed7e7b48d80000",
    "title": "Pressure Systems Engineer II",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As a Pressure Systems Engineer you will be working for JPL&#39;s Pressure System Services Group which certifies and maintains certification of all of the lab’s pressure systems.</p><h2></h2><h2><b>Responsibilities:</b></h2><ul><li><p>Perform engineering analyses and life assessments on a variety of pressure systems using the appropriate consensus code (i.e. ASTM, ASME, API, MIL)</p></li><li><p>Assess configuration, operability and safety risk of each pressure system per JPL/NASA standards</p></li><li><p>Evaluate new pressure system designs prior to installation for optimal functionality while meeting pressure system safety requirements</p></li></ul><h2></h2><h2><b>Qualifications:</b></h2><ul><li><p>Bachelor’s degree in Mechanical or Aerospace Engineering or a related technical discipline with typically a minimum of 3 years of related experience; Master’s degree in similar disciplines with a minimum of 1 year of related experience; or PhD in similar disciplines with a minimum of 0 years of experience.</p></li><li><p>Must have technical expertise and experience with pressurized system design, operation and/or safety, and experience <span>interpreting/applying</span> ASME Pressure Vessel and Piping Codes.</p></li><li><p>Must be a communicator and analyst of pressurized systems with the ability to think both within and beyond the codes associated with those systems and effectively communicate requirements and solutions to a diverse customer base</p></li><li><p>Must be computer literate and experienced in the use of CAD or similar drafting software and MS office programs</p></li></ul><h2></h2><h2><b>Desired Qualifications:</b></h2><ul><li><p>Extensive working knowledge in pressure systems engineering</p></li><li><p>Ability to effectively collaborate with multiple levels of management, operations personnel and technical experts</p></li><li><p>Ability to evaluate customer engineering requirements and devise solutions</p></li><li><p>Broad understanding of Non-Destructive Testing methods to include Visual Testing (VT), Ultrasonic Testing (UT), Radiographic Testing (RT), or Penetrant Testing (PT)</p></li><li><p>Strong working knowledge with ASME Pressure Vessel and Pressure Piping Codes, Cal/OSHA Unified Pressure Vessel Code, hydrogen systems, acutely hazardous gas systems, cryogenic systems, hazardous materials, and federal, state, and local regulatory compliance requirements</p></li><li><p>Knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations</p></li><li><p>Capable of performing technical review of work performed by peers and subordinates</p></li><li><p>Knowledge of configuration management practices</p></li><li><p>Ability to creatively resolve non-conformances and successfully re-design pressurized systems with minimal impact to the customer</p></li><li><p>Willingness and flexibility to take on assignments outside area of expertise.</p></li><li><p>Capable of exploring both new and existing technologies to improve the performance of the team</p></li><li><p>Ability to provide direction and mentoring to other personnel within the organization</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$96,096 - $117,104<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-22",
    "timeType": "Full time",
    "jobReqId": "R2643",
    "jobPostingId": "Pressure-Systems-Engineer-II_R2643",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Pressure-Systems-Engineer-II_R2643"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Mechanical Engineer II",
      "externalPath": "/job/JPL-Campus/Mechanical-Engineer-II_R3866",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-01"
    },
    {
      "title": "Structural Engineer II",
      "externalPath": "/job/JPL-Campus/Structural-Engineer-II_R4021",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 16 Days Ago",
      "startDate": "2023-03-02"
    },
    {
      "title": "Ground Antenna Civil and Structural Engineer II",
      "externalPath": "/job/JPL-Campus/Structural-Engineer-II_R4056-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 9 Days Ago",
      "startDate": "2023-03-09"
    }
  ],
  "userAuthenticated": false
}
