{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-II_R4302",
    "id": "91531aa0918f1001677a3634eb4b0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Overview:</u></b></p><p>With an unmatched history creating groundbreaking advances in science and technology, JPL has been in the space exploration business since the beginning. Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>We resonate with people who are looking for ways to go further and offer an opportunity to be part of a team of passionate and dedicated engineers working with some of the world’s best capabilities and cutting- edge technology in science, technology, and engineering. The pride of working at JPL’s (NASA and Caltech) innovative work culture; we offer a comprehensive benefits plan, relocation, tuition reimbursement and generous Caltech retirement contributions.</p><p></p><p>The Radar Science and Engineering Section in the Communications, Tracking, and Radar Division conducts research, development, and flight mission development in the field of airborne and space borne remote sensing radar for NASA and other government agencies. This section specializes in systems and techniques related to synthetic aperture radar (SAR) imaging, radar interferometry, altimetry, Earth and planetary subsurface sounders, scatterometry, and atmospheric radars (clouds and precipitation, dynamics and gaseous species). The section is a leader in the area of planetary landing radars. Our radar program focuses on Earth and planetary science missions, with emphasis on first-of-a-kind radar systems and cutting-edge technology. The section is also a leader in quantum remote sensing techniques such as quantum Rydberg radars, and has a large R&amp;D capacity and expertise in quantum techniques.</p><p></p><p><b><u>Responsibilities:</u></b></p><p>We invite you to join the Radar Science and Engineering Section within the<b> Radar Concepts and Formulation Group</b><b> (334G)</b> to serve as an <b>Engineer II. </b>You will be reporting administratively to the Group Supervisor of the Radar Concepts and Formulation Group.</p><p>The Radar Formulation and Concept Group conducts research and technology development for early to advanced stage radio and radar remote sensing or sensor technologies. The formulation activities include concept development, systems engineering, collection and analysis of scientific data for validation of concepts, algorithm research and development, and development of novel measurement techniques. These activities serve as R&amp;D to develop mature concepts for earth &amp; planetary instrument or mission concepts, as well as advanced technologies to aid societal needs or engineering challenges.</p><p></p><p><b> <u> Tasks Include:</u></b></p><ul><li>Design and develop acoustically driven piezo-electric electro-quasistatic (EQS) transmitters.</li><li>Develop operational MQS (magnetic) and EQS (electric) sensor system consisting of base-station &amp; mobile devices for technology demonstrations with inputs from principal investigator and scientist.</li><li>Communicate with sponsor project coordinator to understand needs of the demonstrable system, to communicate progress, and communicate challenges and resolution.</li><li>Engineer and architect integrated system solution for the combined multi axis MQS-EQS (MEQS) sensor systems.</li><li>Coordinate with team to develop an operational mobile device for the MEQS demonstration. Act as lead for the MQS and EQS transmit systems.</li><li>Develop calibration and measurement techniques for MEQS systems and field demonstrations.</li><li>Lead field deployment activities and field testing in preparation for technology demonstration</li><li>Reporting of progress, technical challenges, and spending to the principal investigator</li><li></li></ul><p><b><u>Qualifications</u></b>:</p><ul><li>PhD degree in electrical engineering or related technical discipline with minimum of one year of related experience.</li><li>Demonstrated experience in designing electro-mechanical quasistatic transmitting antenna</li><li>Demonstrated experience with systems engineering of a RF/radio sensor system.</li><li>Demonstrated knowledge of the physics of low-frequency quasi-static field coupling.</li><li>Demonstrated knowledge of radio navigation techniques as applied to non-line-of-sight environments.</li><li>Training in electromagnetics and experience in applied electromagnetics sensor development and testing</li><li>Demonstrated ability to write scientific reports.</li><li>Excellent written and oral communications skills suitable for high quality presentations.</li><li>Demonstrated ability to establish efficient collaborations with diverse science/engineering teams.</li></ul><p><b><u>Preferred Skills:</u></b></p><ul><li>Expertise in RF/radio systems engineering.</li><li>Hands-on experience in data analysis with Matlab</li><li>Familiarity with low-frequency radio links and wireless radio-navigation techniques.</li><li>Ability to operate instruments and complex electrical systems.</li><li>Experience in field testing of radio or radar systems.</li></ul><p><b><u>Closing Statement:</u></b></p><p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. JPL is a VEVRAA Federal Contractor. For more information about &#34;EEO is the Law&#34; click here: http://www.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf</p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available at http://oiir.hq.nasa.gov/nasaecp/</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$102,752 - $125,216<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Systems-Engineer-II_R4302",
    "jobReqId": "R4302",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 5 Days Ago",
    "startDate": "2023-05-11",
    "timeType": "Full time",
    "title": "Systems Engineer II"
  },
  "userAuthenticated": false
}
