{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Mars-Public-Engagement-Web-Developer-Undergrad-Intern---Academic-Part-Time_R4283",
    "id": "aae9edf4a2b21001b9414bb0bab20000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Job Description:</b></p><p></p><p>The applicant selected will be an Academic Part-Time Undergraduate Student and will report to the Mars Public Engagement manager. Experienced in front-end development with some back-end knowledge to provide support to web development initiatives, including updating and maintaining the mars.nasa.gov website content and web applications.  Will work on designing and coding with responsive web design to create user experiences with attention to detail.  Will enable web development through research and ongoing review of existing and new software and hardware technologies.</p><p></p><p>Will perform the following duties as a member of the Mars Exploration Public Engagement team:</p><ul><li>Performs routine job functions and activities within the assigned area.</li><li>Posts and maintains content on Mars-related web sites following accessibility standards</li><li>Uses selected content management systems and update sites accordingly</li><li>Develops new ideas to keep site up to date with changing technologies and web trends</li><li>Assists in gathering and analyzing site metrics</li><li>Works within the boundaries of standard procedure using basic publication software and content management tools.</li><li>Participates in writing scripts to enable web content presentation using technologies such as MySQL databases, client side scripting (ColdFusion, PHP, Python, Ruby, JavaScript, etc.), and various JavaScript libraries and frameworks.</li><li>May participate in the creation or light editing of communication products for general audiences including content for internal and external websites or social media sites.</li><li>Works on day-to-day assignments under direct supervision; receives detailed instructions on new assignments.</li><li>Uses applicable policies, procedures and practices as guides to determine work methods and deliver results.</li><li>Work is reviewed for accuracy and overall adequacy.</li><li>Seeks guidance in applying applicable policies, procedures and practices to new situations to determine appropriate action.</li><li>Interacts primarily with immediate task lead and team members within a larger team.</li><li>Develops and tests code for web and mobile applications using modern methods of development.</li><li>Able to troubleshoot, diagnose and resolve application issues.</li></ul><p></p><p><b><u>Required Skills:</u></b></p><ul><li>Must be currently enrolled at least half-time at an accredited college or university pursuing a Bachelor’s degree in Computer Science, Information Systems or related discipline with a graduation date of December 2023 or later.</li><li>Must be able to work a minimum of 10 hours per week during school year, with up to 40 hours per week during the summer</li><li>Minimum GPA 3.0</li><li>Has some familiarity in one or more of the following areas: Technical capabilities in Java, JavaScript, HTML5, CSS3, MySQL, SQL, and responsive design.</li><li>Completed coursework with exposure to standard principles, theories, concepts and techniques in Web Support.</li><li>Proficient Microsoft Office skills (Word, Excel, PowerPoint, Outlook).</li><li>Punctual, detail oriented, resourceful and a self-motivated individual.</li><li>A self-starter with the ability to work independently and apply judgment in planning, prioritizing, and completing tasks.</li><li>Strong written and verbal communication skills and ability to work in a team environment.</li><li>Ability to multitask and prioritize tasks with a strong attention to detail. Strong problem solving, critical thinking and analytical skills.</li></ul><p></p><p><b><u>Desired Skills:</u></b></p><ul><li>Prefer Sophomore or Junior</li><li>Prior internship experience in related programming and/or information technology areas</li><li>Participation in student organizations</li><li>Intermediate knowledge of Adobe Photoshop, Illustrator and Premier.</li></ul><ul><li>Ability to interface with all levels of personnel and the ability to resolve multifaceted issues.</li><li>Highly organized individual that is detail oriented and able to multi-task and complete assignments.</li><li>Graphic design aptitude and experience with some website development or maintenance.</li><li>Skills in web-based development, including REST APIs and JS frameworks such as VueJS/Angular/React.</li><li>Knowledgeable in AWS cloud services.</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $16.11 as a freshman, $19 as a sophomore, $22 as a junior, $25 as a senior.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Mars-Public-Engagement-Web-Developer-Undergrad-Intern---Academic-Part-Time_R4283",
    "jobReqId": "R4283",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "startDate": "2023-05-04",
    "timeType": "Part time",
    "title": "Mars Public Engagement Web Developer Undergrad Intern - Academic Part Time"
  },
  "userAuthenticated": false
}
