{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-Engineer-III-for-Small-body-Ephemeris-Development_R3626-1",
    "id": "ddf5bd0d8fa2100107abff3bcd490000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Do you excel in an environment that values exploration and discovery? We have a universe of opportunities waiting for you!</p><p></p><p>The Jet Propulsion Laboratory (JPL) is NASA’s lead center for robotic exploration of the solar system. Our core competency is the end-to-end implementation of unprecedented robotic space missions to study Earth, the Solar System, and the Universe.  This is an extraordinary opportunity to join the Jet Propulsion Laboratory team that tracks and analyzes – with astonishing precision — the orbits of the myriad bodies in our Solar System, thus enabling and actively participating in the many planetary deep-space science missions undertaken by NASA.</p><p></p><p><b>JPL’s Mission Design and Navigation Section</b> builds maps and tools for interplanetary navigation, designs efficient routes for spacecraft to reach any remote solar system location and safely pilot spacecraft to their ultimate destination.</p><p>The <b>Solar System Dynamics Group (</b><a href=\"https://ssd.jpl.nasa.gov/\" target=\"_blank\"><b>SSD</b></a><b>)</b> is a unique group within JPL’s Mission Design and Navigation Section and is involved in the following disciplines:</p><ul><li>Science driven modeling</li><li>Estimation and optimization</li><li>Managing trajectory knowledge</li><li>Control, observability, and uncertainties</li></ul><p>They are responsible for modeling the gravity fields and ring dynamics for selected solar system objects and modeling the motions of the 8 planets, 160&#43; natural satellites, and over one million asteroids and comets.​ SSD team members work with scientists and engineers throughout the U.S. and around the globe in enabling target body orbit predictions and computing up-to-date orbits, Earth close approaches, and impact probabilities for all near-Earth asteroids and comets.</p><p>The <b>Navigation Engineer Level 3</b> will be a member of the Solar System Dynamics Group and report administratively to the Group Supervisor and programmatically to Program/Project Leads.</p><p>Primary tasks will include but not limited to:</p><ul><li>Architect and manage SSD’s small-body database, which currently contains orbits of all known asteroids and comets (over 1 million objects). The total number is expected to increase by several factors in the coming decade.  SSD’s small-body database includes MySQL master and replicated systems that are hosted both in-house and on AWS.</li><li>Manage AWS assets using technologies including EC2, S3, CloudFront, ALB, Lambda, and RDS.</li><li>Manage system-administration support for critical production servers running RedHat Enterprise Linux.</li><li>Lead development and architecture of cloud-optimized code for SSD’s current systems: automatic small-body orbit determination system, Sentry, Scout, etc.</li><li>Lead monitoring of performance of asteroid detection and identification and provide metrics to the Program Manager for annual program reporting.</li></ul><ul><li>Manage and update small-body orbit determination systems: automatic update system, Sentry, Scout, etc.</li><li>Partner with other engineers or project personnel to perform cross-discipline trade studies in the areas of mission design, navigation, ephemeris development, and analysis of alternatives through application of discipline-specific expertise.</li><li>Perform or lead orbit determination analyses in support of small-body missions and report directly to project scientists and team leads with analysis results, simulations and uncertainty analyses.</li></ul><p>Additional responsibilities may include:</p><ul><li>Perform complex and wide-ranging job functions and activities across disciplines.</li><li>Analyze the small-body ephemerides in support of JPL’s Center for Near-Earth Object Studies (<a href=\"https://cneos.jpl.nasa.gov/\" target=\"_blank\">CNEOS</a>) and provide assessment of potential impact.</li></ul><p><b>Qualifications:</b></p><ul><li>Bachelor’s degree in Software Engineering, Aerospace Engineering, or related technical discipline with typically a minimum of 6 years of related experience; Master’s degree in similar disciplines with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years related experience.</li><li>Wide-ranging experience and knowledge in one or more of the following areas: software architecture, database management, asteroid survey, and astronomy.</li><li>Knowledge of industry and/or academic practices and standards across a range of applications related to software engineering, aerospace engineering, and navigation analysis.</li><li>Demonstrated ability to present technical results to a wide audience.</li><li>Conducts ongoing assessment of team’s progress and reports status to management and internal organizations.</li><li>Represents JPL through interface with representatives of organizations outside JPL.</li><li>Available to work on site at JPL.</li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li>Leadership experience as a system administrator or equivalent activities with current Linux operating systems (especially RedHat Enterprise Linux).</li><li>Leadership experience as a database administrator (DBA) for MySQL or a solid understanding of and ability to perform the skills required as a DBA.</li><li>Leadership experience in software design, coding, and management experience.</li><li>Proficient at diagnosing anomalies in systems (OS, database, etc.) and software.</li><li>Able to understand and become proficient in new software languages.</li><li>Desired software languages: FORTRAN, Perl, Python, and JavaScript.</li><li>Experience with asteroids and comets and modeling of their orbital dynamics.</li><li>Experienced in modeling the performance of asteroid surveys.</li><li>Knowledgeable in instrumentation and observational techniques for astrometry and photometry of small bodies.</li><li>Background in asteroid orbit estimation problems for both short-arc and long-arc cases.</li><li>Knowledgeable of asteroid linking algorithms to historic and recent astrometric observations.</li><li>Extensive knowledge of statistical orbit determination and astrometry.</li><li>Ability to apply engineering and science principles to the solution of a variety of problems.</li><li>Highly energized, self-motivated, multi-tasking, organized, detail oriented, with the ability to work on assignments that are complex in nature using considerable practical judgment, making recommendations, juggling conflicting schedules and resolving problems.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$121,368 - $156,624<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Software-Engineer-III-for-Small-body-Ephemeris-Development_R3626-1",
    "jobReqId": "R3626",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Yesterday",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-09-14",
    "timeType": "Full time",
    "title": "Software Engineer III for Small-body Ephemeris Development"
  },
  "userAuthenticated": false
}
