{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Flight-Project-Planning-and-Scheduling-Analyst_R4440",
    "id": "bbec4f87682d1001adc24fc2a6fd0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Reviews, Reporting &amp; Business Administration Office (RR &amp; BAO) is within the Project Support Office (PSO). Our office provides the project engineering and management infrastructure and compliance technical assistance required to assure mission success for Laboratory flight projects at the Jet Propulsion Laboratory (JPL). The office defines and facilitates satisfaction of the minimum set of technical and programmatic requirements applicable to flight projects primarily in the late formulation and development phases of the project life cycle.</p><p>As a <b>Flight Project Planning and Scheduling Analyst</b>, you will be a member of the PSO business team whose responsibilities are to prepare, maintain and support flight project reviews established by the PSO to assure JPL projects are successful. The PSO business team also provides administrative support for the other offices in PSO to ensure their success.</p><h2></h2><h2><b>Tasks include but are not limited to:</b></h2><ul><li><p>Manage the Project Events Calendar on the PSO website.</p></li><li><p>Collaborate with the Institutional Operations Business Office to ensure accuracy of lifecycle reviews in Microsoft Project files.</p></li><li><p>Present quarterly updates of the JPL Flight Project Events Calendar to JPL executive management.</p></li><li><p>In collaboration with various JPL offices, create and maintain monthly presentations to be approved and presented by the JPL Deputy Director to NASA HQ’s</p></li><li><p>Provide administrative support to the Project Engineering Management Councils</p></li><li><p>Support monthly reviews with JPL executive management</p></li><li><p>Collaborate with the Information &amp; Technology Solutions Directorate (ITSD) to assist in the maintenance of current and future PSO tools.</p></li><li><p>Support JPL Project Manager Training Courses offsite retreats</p></li></ul><h2></h2><h2><b>Qualifications:</b></h2><ul><li><p>Typically requires a Bachelor’s degree in Business Administration or related discipline with a minimum of 3 years of related professional experience, or a Master’s degree in related discipline with a minimum of 1 year of related professional experience, or a PhD in a related discipline with 0 years of related experience</p></li><li><p>Extensive experience in developing/maintaining schedule plans.</p></li><li><p>Strong experience in applying new Information Technology (IT) tools to office procedures and processes (e.g. SharePoint, Alfesco)</p></li><li><p>Proven ability to partner, communicate and interact effectively with all levels of management.</p></li><li><p>Demonstrated ability to meet constantly evolving project needs and handle contending priorities.</p></li><li><p>Effective communication skills in verbal, written, and presentation forms.</p></li><li><p>Ability to quickly learn and implement new technical skills.</p></li></ul><h2></h2><h2><b>Preferred Skills:</b></h2><ul><li><p>Experience in Flight Project lifecycle.</p></li><li><p>Extensive understanding and experience with Microsoft 365 and Outlook.</p></li><li><p>Previous experience in a project team environment with project reporting, and schedule planning.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$78,832 - $90,896<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Flight-Project-Planning-and-Scheduling-Analyst_R4440",
    "jobReqId": "R4440",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 4 Days Ago",
    "startDate": "2023-06-15",
    "timeType": "Full time",
    "title": "Flight Project Planning and Scheduling Analyst"
  },
  "userAuthenticated": false
}
