{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Robotics-Manipulation-Autonomy-Technologist_R4636",
    "id": "cae64fcd52b110020057ea2d3dcb0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is seeking a technologist to join the Robotic Manipulation and Sampling group in the Mobility and Robotic Systems Section of the Autonomous Systems Division at JPL (<a href=\"https://robotics.jpl.nasa.gov/\" target=\"_blank\">robotics.jpl.nasa.gov</a>).</p><p></p><p>Our group develops robotic manipulation and sampling autonomy for NASA missions and non-NASA sponsor technologies that align with NASA technology needs. Our research focuses on using and learning models of interaction between the robotic system and its environment and then using the state of interaction to plan autonomous behaviors. Our research will enable future planetary missions that will explore remote environments with little opportunity for interaction with earth-based operators.</p><p></p><p>The successful candidate will develop on-board autonomous behaviors that adapt to learned environmental properties to complete mission objectives. Estimated models of interaction will be used to identify anomalous conditions and local planning will enable recovery from unexpected system states. The research will be applied for in-space manufacturing and assembly applications.</p><p></p><p><b>Responsibilities:</b></p><p>The technologist will conduct publishable research and development in autonomous dexterous manipulation and associated anomaly identification and recovery for robotic in-space manufacturing and assembly. The technologist will do hands-on experiments with robotic systems to verify and validate robotic capabilities. The primary research topic is autonomous vision guided dexterous manipulation for forceful interactions of high degree of freedom robotic systems with semi-stiff objects in the presence of uncertainty. Technical approaches are expected to be associated with estimation of state of interaction compared to expected modeled states and planning, sensing, and control to complete assembly steps and recover from anomalous conditions.</p><p></p><p><b>Qualifications:</b></p><p>The candidate will have a Ph.D. in a robotics-related engineering field with a strong publication record.</p><p>The candidate should have expertise in controls, system identification, manipulator kinematics, autonomous behaviors, and C/C&#43;&#43; embedded software development.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$109,408 - $139,672<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Robotics-Manipulation-Autonomy-Technologist_R4636",
    "jobReqId": "R4636",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 29 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-30",
    "timeType": "Full time",
    "title": "Robotics Manipulation Autonomy Technologist"
  },
  "userAuthenticated": false
}
