{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Manager--Human-Resources-Business-Partners_R4447",
    "id": "bbec4f87682d1001bed388348fbb0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As<b> Manager, HR Business Partners</b> you will lead a team of HRBPs and HR Generalists responsible for partnering with the ESD Division management and employees at all levels to provide world-class human capital strategies, processes, and solutions and support the organization in developing and hiring the best talent in the world to explore the farthest reaches of space. You will also perform the role as HRBP for the 3x Directorate, partnering with the Office of the Director to determine the right human capital strategy to best support the business and their goals, and to advance the relationship of the broader 3x HRBP team.</p><p></p><p>Reporting to the Head of HR Business Partners, together, you will partner on broader HRBP projects and strategic initiatives. <span>Specific responsibilities of the role include:</span></p><ul><li><p>Providing management, direction and oversight to the 3X HRBP team aligned to the division and sections; Develop and communicate human capital strategies based on the organizational goals of the Directorate and Division.</p></li><li><p>Lead a diverse, highly-qualified staff, providing career coaching, growth and professional development for direct reports. </p></li><li><p>Partner with 3x Directorate to drive strategic initiatives including succession planning, workforce strategy, talent development, and more.</p></li><li><p>Serve as designee to the Head of HR Business Partners, in an acting capacity, as needed.</p></li><li><p>Collaborate with the HR Centers of Excellence (COE) – Compensation, Employee Relations, Learning &amp; Development, DE&amp;I, and HR Solutions Center – to deliver consistent support and drive work to the right resource or enterprise level</p></li><li><p>Accountable to partner with HRBP leads across other directorates.</p></li><li><p>Be a strategic resource and trusted advisor for internal stakeholders including providing insights on organizational and people-related strategy and execution.</p></li><li><p>Develop and use data and analytics to guide decision-making and create proactive solutions to anticipated challenges; Study trends and use metrics to propose, advance and implement solutions, programs, and best practices.</p></li><li><p>Build relationships with technical and business leaders and provide consultative support as a talent and people-strategy SME.</p></li><li><p>Develop innovative solutions and approaches to ensure a culture that supports diversity and inclusion including development of diverse candidate pools, mentoring programs and succession plans.</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p><b>Bachelor’s degree required; advanced degree preferred.</b></p></li><li><p><b>Leadership experience with 12&#43; years relevant HRBP or Sr. HR Generalist experience.</b></p></li><li><p>Outstanding leadership and coaching capabilities, and exceptional influence and presentation skills.</p></li><li><p>Experience in consulting with business units about workforce planning, talent assessments and performance management.</p></li><li><p>Demonstrated success in developing and implementing a variety of human capital strategies in support of business objectives and goals.</p></li><li><p>Strong understanding of federal and state employment laws and regulations as it pertains to employment related matters.</p></li><li><p>Excellent communication, problem solving, and negotiation skills.</p></li><li><p>Strong collaboration skills with all levels within the organization.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Experience with an organization in the Aerospace/Defense Industry is a plus </p></li><li><p>Experience in an HRBP role supporting STEM talent in the fields of engineering or software is preferred</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$151,840 - $195,208<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Manager--Human-Resources-Business-Partners_R4447",
    "jobReqId": "R4447",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 21 Days Ago",
    "startDate": "2023-06-15",
    "timeType": "Full time",
    "title": "Manager, Human Resources Business Partners"
  },
  "userAuthenticated": false
}
