{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Business-Administrator-II-Project-Systems-Engineering---Formulation-_R4317",
    "id": "91531aa0918f100175db6e5062110000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities </b>:</p><p></p><p>The<b> Project Systems Engineering &amp; Formulation Section</b> provides lifecycle leadership in the formulation, planning and execution of the project systems engineering function for JPL space flight missions from concept development through completion of post-Launch checkout and commissioning. Providing formulation services from concept ideation, to the full expression of that concept in formulation phase products, the creative and innovative personnel within this section are responsible for the leadership for project-wide systems engineering efforts, and the delivery of project-level systems engineering products.</p><p></p><p>Innovation drives so much of what we do at JPL, and our inclusiveness helps drive that innovation. We value diverse skills, perspectives, and experiences. Your qualification could add tremendous value to our team. We also provide industry-leading flexibility for partial telework accommodations contingent on project requirements.</p><p></p><p>The Project Systems Engineering &amp; Formulation Section is seeking a <b>Business Administrator II</b>. As the Business Administrator, you will report to the Section 312 Business Administration Manager and provide core support to a premier team of accomplished professionals in the Section, dedicated to providing systems leadership for the design and implementation of spacecraft for the laboratory¹s key flight projects.</p><p></p><p>The ideal candidate will have previously demonstrated a strong sense of collaborative, team philosophy, knowledge of applicable Laboratory policies and procedures, as well as excellent teaming and communication skills, professionalism, a strong work ethic, an eye for improving processes and procedures, and the ability to provide excellent customer service.</p><p></p><p><b>Your responsibilities will include, but are not limited to:</b></p><ul><li><p>Assisting the Business Administration Manager with key tasks and activities including budget planning and financial analysis, reporting, processing personnel requisitions, rewards and recognition, workforce analysis, facilities including office space utilization, laboratory and technical space, annual safety and inventory reviews, and property management.</p></li><li><p>Conducting complex financial analysis support to the sections technical and research staff, and management, review and approve cost transfers, and prepare budgets for research proposals.</p></li><li><p>Conducting financial analyses, including detailed reviews of planned Cost and Obligations, Plan vs. Actual and explanation of variances on direct cost accounts within the section.</p></li><li><p>Providing financial reporting &amp; analysis, including preparation for MMRs, QMRs, and ad hoc reviews.</p></li><li><p>Recommending budgetary priorities and/or corrective actions and developing baseline budgets.</p></li><li><p>Collaborating with Technical Staff to resolve and document staffing plans, workforce forecast analysis and workforce reports.</p></li><li><p>Coordinating monthly and quarterly reporting activities across the section.</p></li><li><p>Developing automated reports and business metrics.</p></li><li><p>Primary point of contact for directing safety, environmental, property and facility-related business operations.</p></li><li><p>Leading JPL and NASA Honor Award Awards activities, including calls for nominations, reconciliation of section-managed funding, documentation of transfers, and creation of award certificates for distribution.</p></li><li><p>Serving as the organizations subject matter expert for Intern recruitment, placement, onboarding, and offboarding</p></li><li><p>Processing solicitations for Contingent/affiliate/Leased Workers, supporting on-boarding activities, and processing of required acquisition documentation, including SOW modifications.</p></li><li><p>Leading Facilities activities, including strategic and detailed planning optimizing space utilization.</p></li><li><p>Using various software and purchasing methods: iProcurement, P-Card, Oracle Acquisitioning (POs, PSs); sole source documentation, and ServiceNow (Mantech) to assist cognizant individuals with all aspects of acquisitions, including tracking, budgeting, and costing of items.</p></li><li><p>Performing ad hoc duties as assigned.</p></li></ul><p></p><p><b>Qualifications </b></p><ul><li><p>Typically requires a Bachelor’s degree in Business Administration, Finance, or related discipline with a minimum of 3 years of related experience; Master’s degree in similar disciplines with 1 year of related experience.</p></li><li><p>Must have strong analytical and problem-solving skills with the ability to resolve complex issues independently.</p></li><li><p>Knowledge in one or more of the following areas: budgeting, financial analysis, reporting, human resources, workforce planning, safety, property, or facility management.</p></li><li><p>Extensive understanding and wide application of standard principles, theories, concepts and techniques in Business Administration, Financial Planning, Workforce Administration, Safety and Facility Management.</p></li><li><p>A successful history of establishing trust with customers and working as a strong, collaborative business partner.</p></li><li><p>Ability to present complex findings in a clear, concise manner using graphics, tables and high level summarization – both orally and in writing.</p></li><li><p>Must have the ability to use tact and discretion when working with sensitive and confidential data.</p></li><li><p>Strong professional characteristics: trustworthy, responsible, hardworking, intellectually curious individual who takes initiative and ownership of work.</p></li><li><p>Must be a self-starter who can work independently and in a team environment.</p></li><li><p>Proficiency with MS Office Suite (Word, Excel, PowerPoint, Access, Outlook, etc.), as well as Sharepoint, Confluence, and Alfresco</p></li><li><p>Demonstrated ability to plan, prioritize, multi-task and complete assignments with minimal supervision.</p></li><li><p>Excellent interpersonal , customer focus, organizational, verbal and written communication skills.</p></li><li><p>Proven ability to implement best business practices in achieving the goals of the section.</p></li></ul><p></p><p><b>Preferred Skills: </b></p><ul><li><p>Wide breadth of knowledge of JPL policies, procedures, processes and financial systems.</p></li><li><p>Extensive administrative experience in the areas of financial analysis, budgeting, cost analysis, asset management, workforce planning, and human resources.</p></li><li><p>Demonstrated experience with ORACLE financials and requisition modules, as well as reporting tools such as OBIEE, Data Extractor, IBT, PEG, SFR, and all JPL web applications.</p></li><li><p>Experience with administrative processes for hosting international visitors (volunteers, visiting scholars)</p></li><li><p>Familiarity with proposal calls and processes.</p></li><li><p>Experience with financial and budgeting needs of small research and technology proposals (R&amp;TD, SURP, PDF, NIAC, ROSES, DARPA, etc.).</p></li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$83,304 - $101,400<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Business-Administrator-II-Project-Systems-Engineering---Formulation-_R4317",
    "jobReqId": "R4317",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 26 Days Ago",
    "startDate": "2023-05-10",
    "timeType": "Full time",
    "title": "Business Administrator II(Project Systems Engineering & Formulation)"
  },
  "userAuthenticated": false
}
