{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/FPGA-Engineer-II_R4318",
    "id": "91531aa0918f1001a379cee70e9b0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Qualifications</u></b></p><ul><li>Bachelor&#39;s degree in Engineering, Physics, or related technical discipline with a minimum of 3 year of professional experience, or Master&#39;s degree in a related technical discipline with 1 professional experience.</li><li>Experience with high level programming languages such as Python, C, C&#43;&#43;, Matlab, System Verilog, LabVIEW, and LabVIEW FPGA.</li><li>Writing scripts to aid team members in FPGA development</li><li>Working with team members to improve FPGA design and verification flow</li><li>Working with team members to improve hardware and software functionality and robustness</li><li>Applying digital design knowledge and principles to designs</li><li>Developing and implementing electrical ground support equipment hardware and software.</li><li>Ensuring that subsystem testing is successfully accomplished according to plan.</li><li>Attending project meetings and work with other team members to accomplish and meet project goals.</li><li>Regularly meeting with the team, assessing status, reviewing problems, planning short-term and long-term activities as well as presenting test results at project reviews and meetings.</li><li>Participating in multidisciplinary and multi-organizational working groups across government and non-government agencies to plan and execute end-to-end testing activities.</li><li>Working independently and within a team environment, collaborating on tasks performed across a spectrum of disciplines.</li></ul><p></p><p><b><u>Preferred Skills:</u></b></p><ul><li>Ability to learn architecting, designing, and implementing Block and System-level Universal Verification Methodology (UVM) / UVM Framework (UVMF) constrained random verification environments.</li><li>Ability to learn how to create a verification plan and functional coverage matrix from requirements and design specifications.</li><li>Experience working with an FPGA design and verification team</li><li>Ability to learn through an FPGA/ASIC full life cycle from initial concept to implementation.</li><li>Experience infusing new verification technologies and methodologies</li><li>Ability to handle fast paced and dynamic product development work environment</li><li>Excellent written/verbal communication skills</li><li>Availability for occasional domestic and foreign travel.</li></ul><ul><li>Experience designing with radiation tolerant Xilinx and Microsemi FPGAs</li><li>Experience in bus standards protocol such as: sRIO, SpaceWire, PCI, MILSTD-1553, CAN, and Ethernet</li><li>Embedded Software knowledge and experience</li><li>SystemC or C&#43;&#43;, Matlab</li><li>Experience with digital twin modeling</li><li>Familiar with Failure Analysis and worst-case analysis</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$97,968 - $122,824<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "FPGA-Engineer-II_R4318",
    "jobReqId": "R4318",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 4 Days Ago",
    "startDate": "2023-05-11",
    "timeType": "Full time",
    "title": "FPGA Engineer II"
  },
  "userAuthenticated": false
}
