{
  "jobPostingInfo": {
    "id": "60d69cc1088010015ddafc315c060000",
    "title": "Human Resources Customer Support",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>The Human Resources (HR) team at JPL is on a voyage of innovation, discovery, and modernization that will allow us to continue to support the JPL mission and quests. AskHR, the Human Resources Solutions Center, is a centralized function designed to handle a variety of HR-related services. AskHR will provide higher-level customer service support to all JPL employees, retirees and applicants as a single point of entry to access all HR services.</span></p><p></p><p><span>As a <b>HR Customer Support Specialist</b>, you will provide direct support to the centralized functions and handle a variety of HR-related services. </span></p><p></p><p><span><b><span>Tasks include but not limited to</span></b><b><span>:</span></b></span></p><ul><li><p><span>Serve as the first point of contact for employee questions and issues related to Human Resources</span></p></li><li><p><span>Process HR Solutions Center requests that include but are not limited to Talent Acquisition, Talent Management, Compensation, Benefits, Learning, Technical Training, Leave of Absence and People Services.</span></p></li><li><p><span>Assess and understand full scope of issues presented and provide a comprehensive response.</span></p></li><li><p><span>Provide timely and accurate information to employees. Utilizes case management system to process, document and resolve inquiries. </span></p></li><li><p><span>Work with internal resources to resolve employee issues and problems and escalates complex inquiries as necessary to Tier 2 or Center of Excellence Subject Matter Experts.</span></p></li><li><p><span>Assist employees with navigation of HR sites.</span></p></li><li><p><span>Process daily HR transactions into HRIS system, perform audits or updates and ensure integrity and accuracy of the employee data and payroll records. </span></p></li><li><p><span>Furnish information to authorized persons and/or agencies.</span></p></li><li><p><span>Maintain both manual and automated personnel records.</span></p></li><li><p><span>Provide administrative support for HR related activities – new hire orientation support, rehire eligibility checks, fixed vacation offers, drug testing, subpoenas, verification of employment, Investigations, invoicing and miscellaneous scheduling.</span></p></li><li><p><span>Communicate and explain information related to a variety of benefits programs (insurance plans, health plans, retirement plans, leaves of absence and sick leave). Assists employees in completion of forms and provides general response to benefit inquiries.</span></p></li><li><p><span>Run and distribute various reports on a regular basis.</span></p></li><li><p><span>Assist employees with the completion of forms.</span></p></li><li><p><span>Assist in the continuous development and improvement of information and processes required to perform quality service delivery.</span></p></li></ul><p></p><p><b>Qualifications: </b></p><ul><li><p>High School with a minimum of 8 years of related <span>experience; Associates</span> with a minimum of 4 years of related experience; Bachelors with a minimum of 2 years of related experience.</p></li><li><p><span>Minimum of three years of Human Resource Administration experience and/or training.</span></p></li><li><p><span>Strong <span>understanding/knowledge</span> of HR disciplines through training and experience.</span></p></li><li><p><span>Detail-oriented with good organizational skills, flexibility in working in a fast-paced team environment, effectively prioritizing and coordinating multiple assignments.</span></p></li><li><p><span>Excellent customer focused communication skills (patience, attentiveness, courtesy).</span></p></li><li><p><span>Ability to accommodate a later day work schedule (6pm)</span></p></li><li><p><span>Demonstrated ability to respond to common inquiries or complaints from customers.</span></p></li><li><p><span>Ability to maintain confidentiality and discretion in daily work.</span></p></li><li><p><span>Demonstrated ability to analyze and solve problems to achieve first call resolution.</span></p></li><li><p><span>Ability to work and problem solve independently utilizing available resources and tools.</span></p></li><li><p><span>Experience with online HRIS and other types of HR systems.</span></p></li><li><p><span>Familiarity with reporting tools.</span></p></li><li><p><span>Proficiency in Microsoft Office Suite including Outlook, Word, Excel, and PowerPoint.</span></p></li><li><p><span>Experience using Workday HCM.</span></p></li><li><p><span>Technical computer proficiency in HRSC software applications.</span></p><p></p><div><div><div><div><ul></ul></div></div></div></div></li></ul><div><div><div><div><div></div></div></div></div></div><ul></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$58,760 - $72,488<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 19 Days Ago",
    "startDate": "2023-03-01",
    "timeType": "Full time",
    "jobReqId": "R4037",
    "jobPostingId": "Human-Resources-Customer-Support_R4037",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Human-Resources-Customer-Support_R4037"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
