{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Operations-Systems-Engineer-1--397S-_R4196",
    "id": "b958ef6f88d51001b653ba63a0010000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p>Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we encourage passion, foster innovation, build collaboration, and reward excellence.</p><p>Are you intrigued about operating vehicles on other planets? Be part of the team that architects, designs, implements, verifies, validates and operates the Engineering Operations System (EOS) that analyzes the downlink products to assess surface vehicle and health. The Engineering Operations for Surface Missions Group also works on develops and produces uplink products, in conjunction with sequencing teams, required by the surface vehicle to maintain system safety.</p><p></p><h2>Description:</h2><p>Will be an Operations Systems Engineer in Engineering Operations for Surface Missions Group (397S). You will be searching for and consolidating engineering data for systems engineering tasks, while responding and reporting to other specialists in the assigned team.</p><ul><li>Partners with engineers to develop system architectures</li><li>Performs complex and varied job functions and activities within flight systems engineering.</li><li>Performs moderately complex analyses and trade</li><li>Regular use of creativity and innovation to address important issues.</li><li>Exercises discretion and independent judgment in evaluating potential approaches and solutions to significant problems and determining appropriate resolutions.</li><li>Interactions normally involve exchanging and validating comprehensive and analytical information.</li><li>Contributes as a member on teams inside or outside own organization, project, activity or function.</li><li>Works on day-to-day assignments and projects under general supervision, typically receiving general instructions, or detailed instructions on new assignments.</li><li></li></ul><h2>Requirements:</h2><p>Bachelor&#39;s degree in Engineering or related technical discipline with typically a minimum of 1 year of related experience; Master&#39;s degree with zero years experience in similar disciplines.</p><ul><li>General understanding in one or more of the following areas: Aerospace Engineering, System Engineering, mission systems and mission system processes and procedures.</li><li>General knowledge and wide application of principles, theories, concepts and techniques in spacecraft system engineering.</li><li>Training or experience with standard system engineering methodologies and tools.</li><li>Experience with software tool development, utilization, and testing.</li><li>Strong analytical ability, initiative, and excellent verbal and written communication skills.</li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$86,216 - $104,832<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Operations-Systems-Engineer-1--397S-_R4196",
    "jobReqId": "R4196",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 10 Days Ago",
    "startDate": "2023-04-06",
    "timeType": "Full time",
    "title": "Operations Systems Engineer 1 (397S)"
  },
  "userAuthenticated": false
}
