{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Hardware-Quality-Assurance-Engineer_R3503",
    "id": "3f6c1fa207301001c7d5284c1d600000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><h2></h2><p>We are looking for a strong <span>Hardware Quality Assurance Engineer</span> <span>with a specialty in optical metrology,</span> assigned to the optical alignment and metrology sub-team within the Hardware Quality Assurance Group 512D.   You will be responsible for the following:</p><ul><li><p>Design, propose and implement optical alignment solutions and methods for complex hardware and test configurations.  </p></li><li><p>Apply extensive understanding and wide application of advanced principles, theories, and concepts in optical metrology to independently conceive plans to solve difficult alignment problems that are multifaceted and cross-disciplinary in nature, resulting in contributions to the development of new theories and methods. </p></li><li><p>Analyze measured data for use in final system requirements verifications and ensure the integrity of the data. Analysis of situations or data requires identification, review and interpretation of extremely complex factors.</p></li><li><p>Provide alignment, mapping and measurement services across multiple projects simultaneously, maintaining both project schedules and measurement accuracy and integrity.  </p></li><li><p>Interpret complex technical requirements to develop test documentation and compose test plans that work within project schedule and hardware configuration constraints. Collaborate with cross-functional teams to plan work flow.  </p></li><li><p>Use creativity and innovation on a regular basis, often leading to significant breakthroughs in the discipline. Monitors the effectiveness and accuracy of existing systems and reporting: develops new procedures to improve data.</p></li><li><p>Apply advanced knowledge in the field of optical metrology to review engineering drawings and plans, explain and negotiate measurement approaches and work to established plans and schedules. </p></li><li><p>Review suppliers’ and partners’ plans, identify issues and provide expert feedback and recommendations on plan and ensure necessary corrections are made.</p></li><li><p>Serve as a primary source for optical metrology information on major assignments and projects without appreciable direction, typically exercising considerable latitude in determining objectives.</p></li><li><p>Represent JPL through regular interface with representatives of organizations outside JPL including suppliers, customers, and partner facilities.</p></li><li><p>Advise management on extremely complex and significant issues.</p></li></ul><h2> <br /><b>Qualifications:</b></h2><ul><li><p>Advanced knowledge in Optical Metrology and Alignment, with minimum 10 years direct experience.</p></li><li><p>Knowledge of one or more of the following areas: Geometric Dimensioning &amp; Tolerancing, Dimensional Inspection techniques, Quality Engineering, Configuration Management, or Manufacturing processes.</p></li><li><p>Ability to evaluate and understand the special challenges and nuances of 3D alignment equipment and making precision measurements on spacecraft, support and test equipment, facilities, and other associated aerospace hardware. </p></li><li><p>An understanding of calibration and measurement errors, and their impacts on results is critical.    </p></li><li><p>Experience in a large aerospace company.  </p></li><li><p>Advanced knowledge of applicable industry and standards in design, engineering, fabrication, integration, test and launch of space-flight hardware.  </p></li><li><p>Demonstrated proficiency in mechanical hardware measurement methods.</p></li><li><p>Advanced experience using Spatial Analyzer software, using theodolites, laser trackers, portable coordinate measuring scan arms , and the ability to effectively interpret results.  </p></li><li><p>Understanding of risks and risk management approaches.  </p></li><li><p>Demonstrated effective written and verbal communication skills, and effective interpersonal and leadership skills.  </p></li><li><p>Good time management ability. </p></li><li><p>Willing to work both in teams and be able to define and complete work in a self-directed manner.</p></li><li><p>Willing to travel domestically and internationally, as needed.</p></li><li><p><b>Bachelor’s degree in Civil, Mechanical, Manufacturing, Aerospace Engineering, or related technical discipline with typically a minimum of 9 years of related experience; Master’s degree in similar disciplines with a minimum of 7 years of related experience.</b></p></li></ul><p></p><h2><b> Preferred Qualifications:</b></h2><ul><li><p>Experience in photogrammetry.</p></li><li><p>Advanced understanding of electromechanical, optical and mechanical manufacturing processes and associated inspection methods.</p></li><li><p>Knowledge and understanding of Quality Management Systems (ISO 9001, AS9100, etc.), Process Variation, and Deming’s approach to Systems. </p></li><li><p>Previous experience as a Quality Assurance Engineer, Manufacturing Engineer, Process Engineer, Test Engineer, and/or Design Engineer.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$127,816 - $157,560<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Hardware-Quality-Assurance-Engineer_R3503",
    "jobReqId": "R3503",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 19 Days Ago",
    "startDate": "2023-04-03",
    "timeType": "Full time",
    "title": "Hardware Quality Assurance Engineer (Optical Metrology and Alignment)"
  },
  "userAuthenticated": false
}
