{
  "jobPostingInfo": {
    "id": "d2416af1eefe1000c38dda0700e60000",
    "title": "Systems Engineer II",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL’s<b> Electronics Test Hardware Engineering Group</b> plays an essential role in the<b> Flight Electronics Section</b>. As a System Engineer in this group, you will capture customer requirements, flow down requirements to hardware and software engineers, create test plans, perform verification testing, prepare and present end-item data packages.</p><p></p><p>Our customers include flight software managers, product delivery managers, system testbeds, verification and validation engineers, system integration and test and mission operations managers.</p><p></p><p>In this role, you will collaborate with our senior engineers supporting the Mars Sample Return and Europa missions. <b>The candidate will need to demonstrate proficiency in system architecture and implementing system design</b>.</p><p></p><p>This role is ideal for a candidate who works closely with others and can successfully meet the demands of flight-projects. The job entails understanding customer requirements, matching requirements with existing product lines or enhancements to the product line. Other responsibilities include producing a detailed design of customer hardware architecture, procuring parts, and assembling the final design.  Additionally, this position performs performance tests and prepares instructional and delivery documentation.<br /> </p><p>Daily duties include:</p><ul><li>Understanding the customer – needs vs. required functionality</li><li>Writing requirement documents</li><li>System architecting</li><li>System test configurations</li><li>Enter and manage requirements in DNG</li><li>Lead V&amp;V efforts for L4/L5/L6</li><li>Release requirements documents</li><li>Update and close JIRA tickets for ECRs, SECRs, feature requests, and problem reports</li><li>Update PFRs and DPFRs in PRS Record and track action items from peer reviews</li><li>Generate monthly metrics from DNG and JIRA</li><li>Assisting delivery manager</li><li>Configuration management</li></ul><p></p><p><b><u>Qualifications </u></b></p><p></p><p>This position requires a Bachelor’s degree in Electrical Engineering, or related technical discipline with typically a minimum of 3 years of related experience or Master’s degree in similar disciplines with a minimum of 1 year of related experience.</p><p></p><p>Other requirements include:</p><ul><li>Ability to read / create electrical schematics, wiring diagrams, and ICDs.</li><li>Understanding of technical specifications.</li><li>Familiarity with Doors Next Generation (DNG)</li><li>Familiarity with JPL Problem Reporting System (PRS)&#xfeff;</li><li>Familiarity with JIRA</li><li>Working knowledge of Microsoft Excel</li><li>Working knowledge of Hardware and Software configuration management</li><li>Excellent communication skills.</li><li>Demonstrated ability to work with a diverse set of customers including technicians, other unit designers and subsystem leads, project and line management, parts reliability, materials, procurement, and packaging groups.</li></ul><p><br /><b><u>Preferred qualifications include:</u></b></p><ul><li>Knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</li><li>Prior experience in the delivery of JPL Critical Items.</li><li>Familiarity with System Engineering and it’s sub-disciplines</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$102,752 - $125,216<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-02-13",
    "timeType": "Full time",
    "jobReqId": "R3860",
    "jobPostingId": "Systems-Engineer-II_R3860-1",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-II_R3860-1"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Systems Engineer II – National Security Programs Support",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-II---National-Security-Programs-Support_R3883",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Science System Engineer II",
      "externalPath": "/job/JPL-Campus/Science-System-Engineer-II_R3921",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-09"
    },
    {
      "title": "Thermal Systems Engineer II",
      "externalPath": "/job/JPL-Campus/Thermal-Systems-Engineer-II_R3996",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 18 Days Ago",
      "startDate": "2023-03-01"
    },
    {
      "title": "Fault Protection Systems Engineer II",
      "externalPath": "/job/JPL-Campus/Fault-Protection-Systems-Engineer-II_R2995-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Cable Harness Engineer II",
      "externalPath": "/job/JPL-Campus/Cable-Harness-Engineer-II_R3513",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-09"
    },
    {
      "title": "Spacecraft Thermal Blanket Tailoring Engineer",
      "externalPath": "/job/JPL-Campus/Spacecraft-Thermal-Blanket-Tailoring-Engineer_R2187",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    }
  ],
  "userAuthenticated": false
}
