{
  "jobPostingInfo": {
    "id": "180717baad401001b19228c19fd40000",
    "title": "Guidance and Control Engineer IV",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the Autonomous Systems Division, which is responsible for technology development, advanced concepts, design, development, delivery, integration and test, verification and validation, and operation of Command and Data Handling (C&amp;DH) Hardware, Flight Software, Power Systems, Robotic Systems, and Guidance and Control (G&amp;C).</p><div><div><div><div><p></p><p>As a <b>Guidance and Control Engineer</b> at JPL, you will be working for JPL’s Guidance and Control Section where you have the opportunity to design and operate the world’s most advanced spacecraft, aircraft, and robots for deep-space and planetary exploration. The Guidance and Control Section is responsible for system engineering, design and analysis, hardware <span>development/procurement,</span> testing, and operations support in G&amp;C areas for unique planetary, deep-space, earth-orbiting, and astrophysics missions. We also do world class research and technology development in autonomous guidance, navigation and control systems including pin-point and safe landing, space rendezvous, precision pointing, controlled optics, vision-based navigation, planetary aerial flight/rotorcraft, formation flying, and other key areas that enable future planetary exploration.</p></div></div></div></div><p>For this unique opportunity in the <b>Entry, Descent, and Landing Guidance and Control Systems Group (3436) </b>Autonomous Systems Division (34) you will be responsible for modeling and analyzing spacecraft sub-systems and environments, aggregating them into vehicle flight mechanics performance simulations used to analyze guidance, navigation and control (GN&amp;C) embedded software performance.  Performance scenarios for analysis include:</p><ul><li><p>autonomous spacecraft GNC algorithm and flight mechanics performance assessment for:</p><ul><li><p>Entry/De-Orbit, Descent, and Landing (EDL),</p></li><li><p>Aerocapture,</p></li><li><p>Asteroid/Comet Proximity Operations,</p></li><li><p>Touch-and-Go Sampling,</p></li><li><p>and other in-situ autonomous spacecraft operations</p></li></ul></li><li><p>interplanetary vehicle targeting and parameter selection for autonomous planetary landings,</p></li></ul><p></p><p>Types of analyses include:</p><ul><li><p>flight mechanics performance margins determination/assessment,</p></li><li><p>autonomous system onboard parameter optimization,</p></li><li><p>flight mechanics outlier behavior investigations,</p></li><li><p>and vehicle/sub-system performance reliability assessment.</p></li><li><p>flight mechanics sensitivity studies,</p></li><li><p>and system-level uncertainty quantification.</p></li></ul><p></p><p>Work in this group also includes associated data mining, metrics development, and reporting to customers in all mission phases of development (formulation through flight operations) – this includes developing state-of-the-art tools to perform the job described above.</p><p></p><p>Other responsibilities include:</p><ul><li><p>Aiding fellow Guidance and Control Section (343) members in conceiving, designing, analyzing, simulating, overseeing, and assessing complex performance at the G&amp;C subsystem level and flight vehicle level.</p></li><li><p>Leading small teams (2-5 people) that assess flight mechanics and perform independent verification and validation of GN&amp;C performance at the subsystem and vehicle system level, as well as coordinating their efforts to document the performance of these systems during all phases of a flight mission.</p></li></ul><p></p><p><b>Qualifications</b></p><ul><li><p>Bachelor’s degree in Aerospace Engineering, or Mechanical/Electrical Engineering with a focus on space applications or related technical discipline with typically a minimum of 9 years of related experience, or Master’s degree in similar disciplines with a minimum of 7 years of related experience, or Ph.D. degree in similar disciplines with a minimum of 5 years of related experience.</p></li><li><p>Understanding of Spacecraft Flight Mechanics fundamentals for modeling and analysis, such as orbital mechanics, aerodynamic modeling, and multi-body kinematics</p></li><li><p>A technical background in the areas of modern guidance, estimation and control with application to space systems (e.g. one or more of the following: orbiters, Fly-by, and proximity operations/entry, descent, and landing/touch-and-go, and aerocapture)</p></li><li><p>Experience modeling typical spacecraft actuator subsystems from a few of the following:  liquid fuel thruster systems (pulsed and throttled), solid rocket motors, thrust vectoring systems, reaction wheels, solar array articulation actuators</p></li><li><p>Experience modeling typical spacecraft sensor subsystems from a few of the following: antenna pointing actuators, separations actuators, inertial sensors, passive (camera-based) sensors, radar/lidar sensors, sun sensors, stellar sensors, magnetometer sensors, magnetic torque rods</p></li><li><p>Experience exercising Sensitivity Study, Design/Parameter Optimization, and Uncertainty Quantification analysis techniques</p></li><li><p>Familiarity with aerodynamics, aerodynamic modeling, and aerothermal design considerations</p></li><li><p>Proficiency working in Linux OS using the shell and ssh for remote work</p></li><li><p>Proficiency in Python and C programming languages</p></li><li><p>Proficiency with at least one scientific computing analysis platform (e.g. Python SciPy stack (preferred), MATLAB, and/or Mathematica)</p></li><li><p>Experience working with modern software management for teams (configuration control and continuous integration and deployment, such as Git/GitHub/Jenkins/Artifactory)</p></li><li><p>A proven team player with growth potential to be an effective leader with excellent communication, interpersonal, verbal, prose writing, and presentation skills.</p></li></ul><p></p><p>Additionally, it is <u>highly desired</u> that the candidate has a range of capabilities and experience drawn from some of the following areas:</p><ul><li><p>Experience with time-domain simulation of multi-rate embedded systems</p></li><li><p>Development of advanced EDL/DDL/Proximity Operations concepts for deep space (read: not Earth) exploration applications</p></li><li><p>Modeling/analyzing/testing atmospheric guidance and control sensor/software/hardware implementations (e.g. Apollo entry guidance w/ lifting capsule and pulse-width control roll thrusters)</p></li><li><p>Modeling /analyzing/testing terminal descent guidance and control implementations (e.g. gravity turn, polynomial guidance laws for pluse-width and/or throttled terminal descent thrusters)</p></li><li><p>Exposure to with Terrain-Relative Navigation techniques and sensors (e.g. cameras, LIDAR, RADAR)</p></li><li><p>Familiarity with soft-goods deployed aerodynamic decelerators (e.g. parachutes, ballutes, SIADs, HIADs)</p></li><li><p>Familiarity with C&#43;&#43; and FORTRAN programming languages</p></li><li><p>Familiarity with automated Python-based software testing frameworks (e.g. pytest or unittest)</p></li><li><p>Familiarity with Python Packaging Authority (PyPA) and/or conda software packaging</p></li><li><p>Familiarity with Docker/Singularity containers</p></li><li><p>Familiarity with large-scale “embarrassingly parallel” scientific computing using job management tools like PBSPro or SLURM.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$133,432 - $176,592<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 21 Days Ago",
    "startDate": "2023-02-23",
    "timeType": "Full time",
    "jobReqId": "R4001",
    "jobPostingId": "Guidance-and-Control-Engineer-IV_R4001",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Guidance-and-Control-Engineer-IV_R4001"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Guidance and Control Systems Engineer IV",
      "externalPath": "/job/JPL-Campus/Guidance-and-Control-Systems-Engineer-IV_R3330",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-23"
    },
    {
      "title": "Guidance and Control Engineer IV",
      "externalPath": "/job/JPL-Campus/Guidance-and-Control-Engineer-IV_R3667",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    }
  ],
  "userAuthenticated": false
}
