{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Staff-Assistant-II_R4025",
    "id": "5fba210fbccb100107f5ead92d1b0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The <b><span>Radar and Science Engineering Section</span></b> in the <b><span>Communications, Tracking, and Radar Division</span></b> conducts research, development, and flight missions in the field of airborne and spaceborne remote sensing radar for NASA and other government agencies. This section specializes in systems and techniques related to synthetic aperture radar (SAR) imaging, radar interferometry, altimetry, Earth and planetary subsurface sounders, scatterometry, and cloud and precipitation radars.</p><p>The Section is also a leader in the area of planetary landing radars. Our radar program focuses on Earth and planetary science missions, with emphasis on first-of-a-kind radar systems and ground breaking technology!</p><p></p><p><b><u><span>Responsibilities:</span></u></b></p><p>We invite you to join JPL as a <b><span>Group Staff Assistant II </span></b>for the <b><span>Radar Science &amp; Engineering Section</span></b>. You will provide support to several groups within the Section, including the OPERA Project Science Team.  Key tasks will include sophisticated travel forecasts and arrangements, creation of the PST agenda, taking of meeting minutes, assistance with action item tracking, clearance of documents, maintenance of the OPERA Project Alfresco document library, and coordination of workshops and on-site meetings.  This position requires a solid customer service background, strong social skills and flexibility in the performance of the job.</p><p></p><p><b><i><span>The tasks for this position may include, but are not limited to:</span></i></b></p><p></p><ul><li>Provide staff assistant support to group members and back-up to Section Management office as needed.</li><li>Provide staff assistant support to the OPERA Project.</li><li>Coordinate and maintain lively and sophisticated calendars; schedule and maintain technical interchange meetings, set up and host WebEx conference calls.</li><li>Process and prepare complex domestic and foreign travel logistics/bookings, authorization requests, and expense reports.</li><li>Coordinate and submit foreign travel and heavily-attended forecasts.</li><li>Perform other subject matter authority duties for travel policies and procedures and timekeeping.</li><li>Submit visitor and affiliate on-boarding requests, including foreign nationals, and assist with escorting of visitors, and interviewees.</li><li>Update onboarding checklist for new employees and affiliates.</li><li>Order keys, acquire IT equipment through ManTech catalog, and activate/deactivate ports as needed for Section personnel.</li><li>Compose and edit correspondence and presentation materials.  </li><li>Process heavy load of procurements by using iProcurement, Purchase Requisitions, and P-Card requests.</li><li>Assist with coordination of special events for the Section, such as workshops and conferences, and other and ad hoc activities.</li><li>Participate on teams within own organization and outside own organization.</li><li>Other ad hoc duties, as assigned.</li></ul><p></p><p><b><u><span>Qualifications: </span></u></b></p><ul><li>Typically requires a High School diploma with a minimum of 8 years of related experience; Associates degree with a minimum of 4 years of related experience; or Bachelor’s degree with a minimum of 1 year of related experience; related required training.</li><li>Extensive expertise in the secretarial profession with strong organizational, computer and social skills.</li><li>Excellent planning and scheduling skills.</li><li>Ability to work optimally under pressure on multiple sophisticated tasks, and work independently with minimal direction to meet commitments with high quality products.</li><li>Motivated self-starter who takes the initiative to establish and implement process improvements.</li><li>Ability to evaluate situations and apply good judgment in any vital resolution.</li><li>Excellent written and verbal communication skills.</li><li>Ability to interact effectively with all levels of personnel and provide excellent customer service.</li><li>Exercise discretion when handling assignments of a discreet nature and when looking after critical material.</li><li>Experience with Microsoft, Word, Excel, PowerPoint, and Outlook.</li></ul><p></p><p><b><u><span>Preferred Skills:</span></u></b></p><ul><li>Extensive understanding of JPL/ESD policies, procedures, and practices.</li><li>Staff Assistant experience in a technical environment.</li><li>Experience with JPL tools such as JPL-ID, UCS, Concur Travel, UFO and Timekeeping.</li><li>Knowledge of JPL procurement processes such as Purchase Requisition, P-Card and iProcurement.</li><li>Familiarity with the JPL-ID process and on-boarding of volunteers, affiliates, and foreign nationals.</li><li>Experience with JPL foreign and domestic travel policies and procedures</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$57,096 - $74,984<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Staff-Assistant-II_R4025",
    "jobReqId": "R4025",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30 Days Ago",
    "startDate": "2023-02-28",
    "timeType": "Full time",
    "title": "Staff Assistant II"
  },
  "userAuthenticated": false
}
