{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/HR-Internal-Communications-Specialist---Temporary-_R4105",
    "id": "5ad2bec176041000bb7aa7ffc5b20000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The <b><span>HR Communications Team</span></b> is responsible for supporting JPL - pioneers in robotic space exploration—and through their discoveries, JPL is fundamentally shifting our understanding of the solar system and the universe. The HR Communications team members at JPL are experts that drive and influence the Lab’s <b>internal HR employee communications strategy.</b> We provide extraordinary client consultation, products, and content to drive the employee experience to ensure our employees are aware of programs, benefits, processes, and all of the amazing aspects of working at JPL.</p><p></p><p><span>Reporting to the Manager of HR Communications, this unique 18-month opportunity will act as a <b>HR Communications Specialist</b>, supporting key HR partners by defining and implementing effective communication strategies to successfully launch internal employee programs. Your primary clients will include HR Centers of Excellent, including but not limited to our learning and development centers and compensation, assisting the teams with defining their communication strategy while also actively supporting initiatives such as program launches, marketing campaigns, success stories, system implementations, and increasing employee engagement. Your ability to translate your client&#39;s strategy to action through clear, data-driven communication across multiple channels, will be critical to the success of HR and the lab&#39;s goal of retaining and developing the world’s most exceptional talent.</span></p><p></p><p><b>Responsibilities:</b></p><ul><li><p>Act as primary HR Communications point of contact for key partners</p></li><li><p>Develop clear, effective content across multiple channels to support the launch of initiatives such as wellness, benefits, onboarding, awards and recognition, learning, training, career development, employee engagement opportunities.</p></li><li><p>Provide partnership and support with writing, editing, and producing messaging for various employee-focused campaigns in support of key organizational priorities - including talking points, memos, promotional materials.</p></li><li><p>Partner with clients to define, develop and implement their internal communication strategies</p></li><li><p>Assist other team members with HR project rollouts, events, and internal-facing campaigns and initiatives</p></li><li><p>Ensure a comprehensive internal focused strategy for all HR efforts and initiatives and efforts across the Lab</p></li><li><p>Plan, edit, and revise content for various communications channels (internal and external)</p></li><li><p>Partner with internal and external partners on design (host videos, articles, etc.)</p></li><li><p>Understand and follow industry trends, both in HR / employee engagement and the public relations, corporate communications world</p></li><li><p>Develop partnerships with other internal communications stakeholders, and subject matter experts across the organization </p></li><li><p>Build meaningful relationships with employees through transparent, thoughtful, and resonant messaging</p></li><li><p>Identify opportunity areas for improvement for communications tools, messaging, frameworks, processes, or channels  </p></li><li><p>Use metrics to inform the success of campaigns</p></li><li><p>Support the day-to-day operations, maintenance and troubleshooting of the HR website</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p><b>Typically requires a Bachelor’s degree in marketing, communications, journalism or related discipline with a minimum of 6 years related experience; or Master’s degree in similar disciplines with a minimum of 4 years related experience</b></p></li><li><p>Strong verbal and written communications skills conducive to partnership and teaming skills across multiple stakeholder groups</p></li><li><p>Ability to manage project teams, oversee work and deliverables of others, and provide feedback and work in teams – leading with influence and partnership</p></li><li><p>Advanced understanding of key messaging differences to promote an employer brand while staying consistent to an overall corporate brand</p></li><li><p>Demonstrated knowledge of, and current with, industry trends to ensure messaging matches marketplace and what employees are seeking from an employer</p></li><li><p>A well-developed understanding and ability to write and create content for the digital world and emerging platforms</p></li><li><p>Strong experience and skills in several of the following areas: diplomacy, strategic, persuasive copy writing and email marketing; website and CRM management; content creation for the digital world</p></li><li><p>Experience building internal and external marketing campaigns</p></li><li><p>Ability to develop and implement data-backed campaigns to increase awareness of career opportunities, and the ‘why’ JPL employer of choice messaging for employees</p></li><li><p>Demonstrated experience completing a project, from concept to publication with minimal supervision and excellent project management and leadership skills</p></li><li><p>Strong interest in developing and executing a strategy to leave a legacy</p></li><li><p>Excellent communication and presentation skills with strong attention to detail</p></li><li><p>Understanding and ability to write and create content for the digital world and emerging platforms</p></li><li><p>Basic knowledge in web coding languages such as HTML and CSS</p></li><li><p>Ability to build effective, clear, succinct, well-designed presentations in PowerPoint or Google Slides</p></li></ul><p></p><p><b>Preferred background, skills, and experience:</b></p><ul><li><p>Prior experience as an internal communications marketing team member</p></li><li><p>Experience with social media, branding, and/or general ‘call to action’ marketing efforts</p></li><li><p>Knowledge and experience with internal digital community engagement (developing documents, researching best practices with industry, etc.) </p></li><li><p>Knowledge of Aerospace, Research, Technology, or other related industry</p></li></ul><p></p><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$88,504 - $112,320<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "HR-Internal-Communications-Specialist---Temporary-_R4105",
    "jobReqId": "R4105",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 23 Days Ago",
    "startDate": "2023-04-12",
    "timeType": "Full time",
    "title": "HR Internal Communications Specialist"
  },
  "userAuthenticated": false
}
