{
  "jobPostingInfo": {
    "id": "f07bc8fafbcd1002141afd8b9aa90001",
    "title": "Fault Protection Systems Engineer II",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><h2><b>Overview:</b></h2><p>New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p>Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><h2><b>Responsibilities:</b></h2><p>If you are passionate about spacecraft design, we invite you to join the <b>Flight Systems Engineering, Integration and Test Section</b>. We provide systems engineering for the design and implementation of spacecraft for the laboratory’s key flight projects. Our work spans spacecraft systems engineering, payload systems integration, electrical systems integration, fault protection and autonomy design, landing systems design, spacecraft assembly and test, systems verification and validation, and systems modeling.</p><p>We are seeking a highly motivated and experienced <b>Systems Engineer Level 2</b> to join the <b>Autonomy and Fault Protection Group</b>, reporting administratively to the Technical Group Supervisor and programmatically to the Project Fault Protection Lead. Your initial assignment will be to serve as a fault protection systems engineer on one of the exciting missions in development at JPL, which include Psyche and Mars Sample Return. Some of your initial tasks may include planning and executing fault protection testing in a hardware/software venue, performing analysis and review of test data, and assessing risks associated with issues found in testing.</p><p>You will work independently and within a team environment, collaborating on tasks performed across a spectrum of disciplines and have excellent writing and oral presentation skills.</p><h2><b>Tasks may include but not limited to:</b></h2><ul><li>Be a member of a project fault protection team</li><li>Be responsible for guiding the autonomy and fault management requirements/principles/practices and products for space system architectures, as well as helping to verify and validate the design</li><li>Be responsible for the development of program-level products and participation in program-level engineering trades and reviews</li></ul><h2><b>Qualifications:</b></h2><ul><li>Bachelor’s degree in Engineering, Physics, or related technical discipline with a minimum of 3 years of professional experience, or Master’s degree with a minimum of 1 year of experience, or Ph.D.</li><li>Wide-ranging experience and advanced knowledge in one or more of the following areas: systems engineering, aerospace engineering, and reliability trades/analyses</li><li>Extensive understanding in a wide application of advanced principles, theories, concepts, designs, analyses, and techniques in autonomous space systems and fault protection resulting in contributions to the development of new theories and methods</li><li>Significant knowledge of the function and operation of spacecraft systems, subsystems, and instruments</li><li>Proven ability to lead the activities of and to synthesize the unique discipline knowledge of a broad range of technical subject matter experts</li><li>Experience coordinating design efforts with partner organizations or vendors</li><li>Be a self-motivated individual who can work independently, in a team environment, and lead a team</li><li>Must have excellent verbal, written, and presentation skills</li></ul><h2><b>Preferred Skills:</b></h2><ul><li>Thorough understanding of systems engineering methods and applications as well as fault protection design, autonomy, and design analysis products</li><li>Ability to work independently on major project assignments, with accountability for technical performance, budget and schedule</li><li>Ability to participate in requirements development for systems</li><li>Excellent problem solving skills</li><li>Proven ability to deal with multiple issues, tasks and priorities concurrently</li><li>Proven ability to interact effectively across multiple disciplines with government and non-government agencies</li><li>Experience leading tasks and coordinating working groups on large-scale projects in system development, test, and/or operations</li><li>Experience with development and delivery of system documentation, such as requirements documents, test plans, and release description documents</li><li>Experience with functional requirement development and translation into system / subsystem / architecture, design, and implementation</li><li>Willingness to obtain a security clearance if asked.</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$102,752 - $125,216<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-22",
    "timeType": "Full time",
    "jobReqId": "R2995",
    "jobPostingId": "Fault-Protection-Systems-Engineer-II_R2995-1",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Fault-Protection-Systems-Engineer-II_R2995-1"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Systems Engineer II – National Security Programs Support",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-II---National-Security-Programs-Support_R3883",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Science System Engineer II",
      "externalPath": "/job/JPL-Campus/Science-System-Engineer-II_R3921",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-09"
    },
    {
      "title": "Thermal Systems Engineer II",
      "externalPath": "/job/JPL-Campus/Thermal-Systems-Engineer-II_R3996",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 17 Days Ago",
      "startDate": "2023-03-01"
    },
    {
      "title": "Cable Harness Engineer II",
      "externalPath": "/job/JPL-Campus/Cable-Harness-Engineer-II_R3513",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-09"
    },
    {
      "title": "Spacecraft Thermal Blanket Tailoring Engineer",
      "externalPath": "/job/JPL-Campus/Spacecraft-Thermal-Blanket-Tailoring-Engineer_R2187",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer II",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-II_R3860-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-13"
    }
  ],
  "userAuthenticated": false
}
