{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Contract-Technical-Manager--Academic-Part-Time-_R4411",
    "id": "8378305239101001585c9859196e0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the Autonomous Systems Division, which is responsible for technology development, advanced concepts, design, development, delivery, integration and test, verification and validation, and operation of Command and Data Handling (C&amp;DH) Hardware, Flight Software, Power Systems, Robotic Systems, and Guidance and Control.</p><p></p><p>This <b>Academic Part-Time student</b> will have the opportunity to gain hands-on experience as part of the <b>Contract Strategy and Implementation (CSI) Office</b> in the following areas:</p><ul><li>Managing technical contracts that support power &amp; avionics technologies</li><li>Requirements gathering</li><li>Drafting statements of work</li><li>Updating &amp; tracking delivery schedules</li><li>Audit preparation &amp; support</li><li>Conformance management of specifications, drawings &amp; interface control documents</li><li>Utilizing JIRA for action-item tracking</li><li>Configuration &amp; information management for project records &amp; data</li></ul><p></p><p><b><span>Minimum Qualifications:</span></b></p><ul><li><span>Must be currently enrolled in a college or university pursuing a bachelors, masters, or PhD in Electrical Engineering, Computer Science, Computer Engineering, Aerospace Engineering, Physics, Robotics, or related technical field. Must be enrolled full time in school following the fall or spring term.</span></li><li><span>Must have a minimum cumulative 3.0 out of a 4.0 GPA</span></li><li><span>Proficiency in the Microsoft Office Suite - Excel, Word, PowerPoint, &amp; Outlook</span></li><li><span>Excellent written &amp; oral communication skills</span></li><li><span>Ability to work in a team environment</span></li><li><span>Ability to work effectively under pressure on multiple tasks with general supervision</span></li></ul><p></p><p><b><span>Desired Qualifications:</span></b></p><ul><li>Previous experience with JIRA, Alfresco, Siemens Teamcenter, DOORS &amp; MS Project</li><li>Familiarity with circuits, printed circuit boards, electronic parts &amp; components</li><li>Familiarity with ITAR &amp; EAR regulations</li><li>Familiarity with information &amp; record management</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Contract-Technical-Manager--Academic-Part-Time-_R4411",
    "jobReqId": "R4411",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "startDate": "2023-06-07",
    "timeType": "Part time",
    "title": "Intern: Contract Technical Manager (Non-Supervisory - Academic Part-Time)"
  },
  "userAuthenticated": false
}
