{
  "jobPostingInfo": {
    "id": "d2416af1eefe1001f7712308f5e50000",
    "title": "Software Systems Engineer I",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p></p><p>Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>Are you passionate about discovering and implementing new technology to improve software testing and space exploration? If so, we invite you to join our dynamic team as a member of the Mission Control Systems (MCS) System Integration, Test &amp; Deployment Group (393B).</p><p></p><p>As a part of this team, you will play a crucial role in ensuring the successful delivery of the Telemetry, Tracking, and Command (TTC) Central systems. Responsibilities involve executing, planning, and detailing Verification and Validation (V&amp;V) processes to ensure that all TTC Central requirements are thoroughly verified and that a verification method exists for each requirement.</p><p>In this great opportunity, you will be tasked with tracing the requirements and their corresponding verification methods to certify that the mission control solutions are tested in all scenarios and that the key performance parameters are met. By doing so, you will help to ensure that our systems are functioning optimally and that we can achieve our mission objectives.</p><p></p><p>Join our team and help to drive innovation in the exciting fields of software testing and space exploration. Apply now to become a part of this dynamic and rewarding opportunity!</p><p></p><p>As the end-to-end tester for the TTC Central system, you&#39;ll simulate both normal and high-stress loading scenarios to ensure the system performs optimally in a real-world operational environment. Your responsibilities will include developing and managing all verification and validation artifacts, such as test plans, procedures, inspection reports, data sets, and analyses throughout the project.</p><p>Collaborating with your team, you&#39;ll continuously improve the V&amp;V system and process by incorporating industry practices and innovative technology to improve existing and future testing practices. Your technical expertise and keen attention to detail will be critical in ensuring successful releases of the TTC Central system. Join us in this great opportunity to work on groundbreaking in a dynamic and exciting environment!</p><p></p><h2>The responsibilities are:</h2><ul><li>Review and update Test Design and Procedure (TDP) documents as needed.</li><li>Develop test cases, trace them back to requirements, automate the tests, and implement them.</li><li>Conduct sophisticated system integration tests as part of a team or independently.</li><li>Conduct end-to-end system-level tests and evaluate their results.</li><li>Communicate engineering findings to lead engineers in a clear and concise manner.</li><li>Handle automated regression tests and integrate them into continuous integration workflows.</li><li>Collaborate with the software development team on a regular basis to provide updates on integration and test status.</li><li>Lead all aspects of the maintenance and upkeep of the test environment.</li><li>Generate comprehensive Test Report documents that accurately reflect the results of testing efforts.</li></ul><p></p><h2><b>Qualifications:</b></h2><ul><li>Holds a Bachelor&#39;s degree in Computer Science, Computer Engineering or related field with 1 year of proven experience, or a Master&#39;s degree with no prior relevant experience.</li><li>Possesses extensive knowledge in at least two critical areas of software development, including the software creation process, continuous integration, and automation methodology.</li><li>Has 1&#43; years of hands-on experience in software quality assurance testing within the software solution development industry, demonstrating expertise in the field.</li><li>Has a proven background in test automation development, with 1&#43; years of in-depth experience in the area.</li><li>Skilled in Python scripting and Unix/Linux shell scripting with bash, with 1&#43; years of experience in each.</li><li>Adheres to standard methodologies for writing clean, reusable, and parameterized code for tests to ensure coverage and maintainability.</li><li>Meticulous, self-motivated, and able to seek mentorship when vital, demonstrating strong problem-solving skills.</li><li>Excellent interpersonal skills, both written and verbal, ensuring effective collaboration and multi-functional teamwork.</li></ul><h2><b>Preferred Skills:</b></h2><ul><li>Knowledge of modern software development tools and practices, including GitHub, JIRA, Jenkins, TestRail, Agile methodology, and DevOps.</li><li>Knowledge of Solaris, Linux, and cloud computing environments, with an emphasis on Red Hat and Amazon Web Services (AWS).</li><li>Familiar with software configuration and test automation tools such as Ansible and Puppet.</li><li>Ability to quickly learn and apply third-party development and QA tools.</li><li>Proven experience in automated testing using Selenium and Robot Framework.</li><li>Prior experience with databases, including MySQL and NoSQL databases (e.g. Elasticsearch).</li><li>Familiarity with message bus/broker technology (e.g. ActiveMQ, Kafka).</li></ul><ul><li>Understanding of data packaging, and processing.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$81,536 - $99,008<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 27 Days Ago",
    "startDate": "2023-02-17",
    "timeType": "Full time",
    "jobReqId": "R3973",
    "jobPostingId": "Software-Systems-Engineer-I_R3973",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-Systems-Engineer-I_R3973"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Software Systems Engineer 1",
      "externalPath": "/job/JPL-Campus/Venue-Reliability-Engineer-1_R3710",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-18"
    }
  ],
  "userAuthenticated": false
}
