{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Shipping-and-Receiving-Support-II_R4787",
    "id": "4925e8db90711001c1bc3037ed710000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>As a Shipping and Receiving Support, you will be a member of the Logistics Division Section 2830 and will report to the Group Supervisor. You will be responsible for preparing items for shipment including Hazardous Materials (Hazmat) in accordance with Department of Transportation(DOT), The International Air Transport Association (IATA), and/or the International Maritime Dangerous Goods (IMDG) Code/regulations that are departing JPL, its Deep Space Network Logistics Facility (DLF) in Monrovia, CA and other JPL offsite locations!</span></p><p><span> </span></p><p><b><span>Other responsibilities will include:</span></b></p><p></p><p><span><span>·<span> </span></span></span><span>Perform physical or administrative tasks involved in the shipping of various types, sizes and weighted materials, supplies, and equipment, including Hazmat and explosives.</span></p><p><span><span>·<span> </span></span></span><span>Prepare and pack using appropriate tools (e.g. banding equipment, foam packaging system, bubble wrap machine, and other small powered tools).</span></p><p><span><span>·<span> P</span></span></span><span>roficiency in preparation and review of Hazardous materials shipping documentation, including Safety Data Sheets, shipping labels, and packing certificates.</span></p><p><span><span>·<span> </span></span></span><span>Phenomenal attention to detail ensuring accurate and compliant Hazmat packaging, labeling, and documentation; and, maintaining files/records of all shipping and receiving documents.</span></p><p><span><span>·<span> Collaborate with</span></span></span><span> Laboratory personnel regarding types of packaging material and mediums available for shipping, and other routine inquiries.</span></p><p><span><span>·<span> </span></span></span><span>Unpack and repack shipments to align with packaging specifications, using appropriate packaging tools (containers, machinery, and packing material such as foam or popcorn)</span></p><p><span><span>·</span></span><span>Operating material handling equipment, including electric and manual pallet jacks, hand trucks or other material handling equipment (MHE).</span></p><p><span><span>·<span> </span></span></span><span>Identifying high dollar (&gt;$1,000) and JPL Sensitive Items List items to ensure appropriate measures are met to ensure accurate controls as the need arises.</span></p><p><span><span>·<span> </span></span></span><span>Following established procedures for routine work, and detailed instructions for new assignments: possibly crafting new or updating existing instructions, if appropriate/warranted.</span></p><p><span><span>·<span> </span></span></span><span>Using familiarity with DOT, IATA, and/or IMDG to prepare documentation (e.g. shipments of materials, bills of landing, etc.).</span></p><p><span><span>·<span> </span></span></span><span>Resolve customer service issues;</span></p><p><span><span>·<span> </span></span></span><span>Possessing strong problem-solving skills to handle unexpected issues during Hazmat shipments and find efficient solutions.</span></p><p><span><span>·<span> </span></span></span><span>Ability to collaborate with cross-functional teams, including Project, Procurement, Compliance department or similar personnel.</span></p><p><span><span>·<span> Able to work a s</span></span></span><span>tandard JPL 9/80 schedule.</span></p><p></p><p></p><p><b><span>The following qualifications are required:</span></b></p><p></p><p><span><span>·</span></span><span>Typically requires a High School diploma with a minimum of 6 years of related experience; or Associates degree with a minimum of 1 year related experience; related required training.</span></p><p><span><span>·<span> </span></span></span><span>Solid understanding of general job aspects in shipping, receiving, and documentation of goods received.</span></p><p><span><span>·</span></span><span>Understanding of applicable policies, procedures, and practices in JPL’s acquisition process.</span></p><p><span><span>·<span>E</span></span></span><span>xperience using electric forklift, electric pallet jack, <span>and general MHE.</span></span></p><p><span> </span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$47,424 - $56,888<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Shipping-and-Receiving-Support-II_R4787",
    "jobReqId": "R4787",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 22 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-09-14",
    "timeType": "Full time",
    "title": "Shipping and Receiving Support II"
  },
  "userAuthenticated": false
}
