{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Benefits-Specialist--Temporary-_R4462",
    "id": "49344aaf21471001abcfddd08b240000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>We are seeking a results-oriented <b><span>Benefit Specialist III </span></b>who will work closely with the Benefits, Payroll and Finance teams to ensure the accuracy of all premium payments and employee payroll deductions associated with group healthcare coverage.  In addition, the employee in this position is a key participant in developing the benefits platform configuration for annual Open Enrollment, working closely with HRIS to ensure ease of employee use.  The ideal candidate must have strong written and verbal communications skills, strong project management skills, the ability to demonstrate follow-through, and must be capable of handling simultaneous goals.</p><p></p><p>In addition, they must have experience working with Benefits platforms, preferably Workday, a general understanding of the premium reconciliation process for group health insurance, and experience with project management.  The candidate must also have experience with Benefits administration and a detailed knowledge of employee benefits.</p><p></p><p><b><span>Tasks include but not limited to:</span></b></p><ul><li><p>Conducts data analysis for preparation of and following open enrollment, and participates in strategic reviews of plan provisions and updates and the impact of changes on the benefits platform.</p></li><li><p>Manage the employee premium reconciliation process together with the payroll and finance departments, determine adjustments needed and ensure updates are applied to the employee’s payroll account.</p></li><li><p>Work with auditors, as needed, to provide data necessary to finalize audits. </p></li><li><p>Determine accurate premium payment amounts for all healthcare vendors.  Work with vendor representatives, as needed, to coordinate billing adjustments or corrections.</p></li><li><p>Assist employees with responses to payroll questions related to their payroll deductions for healthcare.</p></li><li><p>Develop an understanding of the Workday Benefits Platform in order to assist Benefits team develop changes to the platform, as needed.</p></li><li><p>Partner with the Head of Benefits, Total Rewards Leadership, and individual team members to provide support and project management tools for world-class HR capital strategies, processes, and solutions.</p></li><li><p>With the direction of the Head of Benefits, create, manage, and maintain a project portfolio management process including creating an overarching view and timeline for all Benefits, Retirement, and Wellness projects.</p></li><li><p>Establish and recommend project management processes and templates to support projects and Total Reward’s ability to effectively execute deliverables - on track and aligned to the Benefits, Retirement, and Wellness focus areas.</p></li><li><p>Work with project leads across HR to obtain status updates and project related materials to update project portfolio.</p></li><li><p>Track Total Rewards projects status and risks and recommend alternate actions or timeline adjustments to portfolio as needed.</p></li><li><p>Plan, lead, and participate in meetings, discussion groups, and other types of events</p></li><li><p>Guide HR team members through project management processes, tools and resources. Goal is to share knowledge and enable growth of project management skills within the Total Rewards organization.</p></li><li><p>Partner with Head of Benefits to recommend and draft communications on project status and updates to the HR organization.</p></li><li><p>Manage HR cross-functional projects and coordinate HR process improvement initiatives, as identified.</p></li><li><p>Partner with the Head of Benefits to create a dashboard and relevant metrics related to HR processes, projects, and deliverables.  Intent is to share with HR team and clients to communicate the broad-based HR work in progress.</p></li><li><p>Develop materials, participate in, and complete deliverables regarding informational updates, training sessions, and key briefings</p></li></ul><p></p><p><b><span>Qualifications:</span></b></p><ul><li><p><b>Bachelor’s degree with 5-6 years of related experience in employee Benefit Administration; Masters in a similar discipline with 4 years of related experience; Ph.D. in a similar discipline with 2 years of related experience. </b></p></li><li><p>Ability to influence and adapt style to consult with all levels of employee and management</p></li><li><p>Strong data and numerical analytic skills including intermediate to advance Excel proficiency is required.</p></li><li><p>Ability to work effectively and well within the JPL culture (effectively gather and analyze facts, weigh risks and make <span>decisions/recommendations</span> that are right for the business, the people and our culture)</p></li><li><p>Ability to perform extensive data analysis, troubleshooting, creative problem resolution, diagnostics and process improvement.</p></li><li><p>Understands HRIS processes to facilitate systems modifications, program updates and testing.</p></li><li><p>Highly organized with strong self and project management skills and an ability to meet critical deadlines (time, priorities, resources)</p></li><li><p>Excellent problem-solving, critical thinking, reasoning and analytical skills</p></li><li><p>Excellent writing and editing skills</p></li><li><p>Effective team player</p></li><li><p>Strong interpersonal and communication skills</p></li><li><p>Ability to work effectively in situations that require sound decision-making</p></li><li><p>Establishes trust and maintains <span>confidentiality </span></p></li></ul><p></p><p><b><span>Preferred Skills:</span></b></p><ul><li><p>Workday experience is a plus.</p></li></ul><p></p><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$89,752 - $108,576<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Benefits-Specialist--Temporary-_R4462",
    "jobReqId": "R4462",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 12 Days Ago",
    "startDate": "2023-06-22",
    "timeType": "Full time",
    "title": "Benefits Specialist (Temporary)"
  },
  "userAuthenticated": false
}
