{
  "jobPostingInfo": {
    "id": "5fba210fbccb1000cb11179271c90001",
    "title": "Postdoc: Theoretical and numerical studies of the Cerean exospher and the molecular submillimeter line emission",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The postdocs at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</p><p></p><p>The Instrument Software and Science Data Systems section develops and operates science data and instrument operation systems for the majority of the missions and instruments that JPL manages. The section also directly supports research projects in collaboration with scientists and engineers across JPL by developing and applying methodologies from Data Science and developing numerical physics-based models. Quantitative studies of the major and minor bodies in the Solar System and assessment of new observatories are part of the science support activities in our section. Targeted studies of the dwarf planet Ceres are among the ongoing research projects with potential impact on the design and implementation of future planetary science missions.</p><p></p><p><b>Responsibilities:</b></p><p>The postdoc will be involved in an effort to model the exosphere of Ceres, and, in particular, determine the abundance of water vapor. Water molecules are emitted from the surface of Ceres through several mechanisms, including sublimation of exposed and dust covered ice, sputtering by the solar wind and micro-meteorite bombardment. Each of these mechanisms needs to be included in the numerical model and the water production mechanism understood. The water molecules produced at the surface of Ceres expand into an exosphere bound by the Cerean gravitational field. Submillimeter emission spectra from the exosphere were obtained with the Herschel Space Observatory several year ago. Analyses of the spectral lines predict a water production rate that is larger than the expected sublimation from exposed ice patches that were subsequently observed with several instruments on the JPL-managed spacecraft Dawn. The postdoc will contribute to solving this mystery through detailed modeling of the exosphere and submillimeter line emission, and more specifically, through detailed studies of the water production mechanisms at surfaces through sublimation and sputtering. Physics-based numerical modeling software will be available for use and expansion. The postdoc is expected to conduct studies leading to publications in peer reviewed journals.</p><p></p><p><b>Qualifications:</b></p><p>Candidate must have:</p><p>•             Ph.D. in applied physics, materials science, planetary science or a related field.</p><p>•             Experience working on theoretical or numerical studies of surfaces.</p><p>•             Familiarity with numerical model development.</p><p>Desired qualifications include:</p><p>•             Familiarity with radiative transfer calculations and numerical modeling of exospheres.</p><p>•             Familiarity with systems in non-local thermodynamic equilibrium (non-LTE).</p><p>•             Familiarity with the C&#43;&#43; and Python programming languages.</p><p></p><p>The appointee will carry out research in collaboration with the JPL advisor, resulting in publications.</p><p></p><p>This position is available immediately, and applications will be reviewed as they are received.</p><p></p><p>Applicants may be subject to additional program requirements by NASA. Postdoctoral Scholar positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years. Candidates should submit the following to this site: CV, representative publications, contact information for three references, and a cover letter stating their research accomplishments and interests.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$82,180 - $82,180<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 16 Days Ago",
    "startDate": "2023-02-27",
    "timeType": "Full time",
    "jobReqId": "R4013",
    "jobPostingId": "Postdoc--Theoretical-and-numerical-studies-of-the-Cerean-exospher-and-the-molecular-submillimeter-line-emission_R4013-1",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Postdoc--Theoretical-and-numerical-studies-of-the-Cerean-exospher-and-the-molecular-submillimeter-line-emission_R4013-1"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Ionosphere Phase Estimation for InSAR Time Series Analyses",
      "externalPath": "/job/JPL-Campus/Ionosphere-Phase-Estimation-for-InSAR-Time-Series-Analyses_R1336",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc Position in Arctic Methane",
      "externalPath": "/job/JPL-Campus/Postdoc-Position-in-Arctic-Methane_R2118",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc- Cloud and Precipitation Radar Signal Simulation and Analysis",
      "externalPath": "/job/JPL-Campus/Postdoc--Cloud-and-Precipitation-Radar-Signal-Simulation-and-Analysis_R3445",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc- Advancing Remote Imaging Spectroscopy for Earth Science",
      "externalPath": "/job/JPL-Campus/Postdoc--Advancing-Remote-Imaging-Spectroscopy-for-Earth-Science_R3884",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-03"
    },
    {
      "title": "Postdoctoral Research Opportunity to Study the General Interactions Between the Hydrosphere and Solid Earth",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Research-Opportunity-to-Study-the-General-Interactions-Between-the-Hydrosphere-and-Solid-Earth_R2232",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "JPL Postdoc Opportunity - Atom Interferometer for Microgravity",
      "externalPath": "/job/JPL-Campus/JPL-Postdoc-Opportunity---Atom-Interferometer-for-Microgravity_R1704",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc: Studying Tropospheric Ozone Trends and Variability using Satellite Observations, Ozonesondes and Model Reanalysis Products",
      "externalPath": "/job/JPL-Campus/Postdoc--Studying-Tropospheric-Ozone-Trends-and-Variability-using-Satellite-Observations--Ozonesondes-and-Model-Reanalysis-Products_R3829",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-26"
    },
    {
      "title": "Postdoctoral Position in Pulsar/FRB Astrophysics",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Position-in-Pulsar-FRB-Astrophysics_R831",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc- Mass Spectrometer Technologist",
      "externalPath": "/job/JPL-Campus/Postdoc--Mass-Spectrometer-Technologist_R2567",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc Position in the areas of compact clocks and atom interferometers",
      "externalPath": "/job/JPL-Campus/Job-Posting-Title-JPL-Postdoctoral-Positions-in-the-areas-of-compact-clocks-and-atom-interferometers_R421",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc- Exoplanetary Sciences",
      "externalPath": "/job/JPL-Campus/Postdoc--Exoplanetary-Sciences_R3705",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-05"
    },
    {
      "title": "Postdoc in Geodynamics And Space Geodesy",
      "externalPath": "/job/JPL-Campus/Postdoc-in-Geodynamics-And-Space-Geodesy_R2348",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Satellite-Based Assessment of Relative Sea Level Change 2",
      "externalPath": "/job/JPL-Campus/Satellite-Based-Assessment-of-Relative-Sea-Level-Change-2_R730",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "JPL Postdoctoral Fellow - Mass Spectroscopy and Gas Chromatography",
      "externalPath": "/job/JPL-Campus/JPL-Postdoctoral-Fellow---Mass-Spectroscopy-and-Gas-Chromatography_R3237",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc: Lidar and PolinSAR/TomoSAR Data Fusion in Monitoring Changes of  Vegetation Structure and Surface Topography",
      "externalPath": "/job/JPL-Campus/Postdoc--Lidar-and-PolinSAR-TomoSAR-Data-Fusion-in-Monitoring-Changes-of--Vegetation-Structure-and-Surface-Topography_R2894",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoc: Remote Sensing Data Analytics for Mapping and Monitoring Global Forest Carbon",
      "externalPath": "/job/JPL-Campus/Postdoc--Remote-Sensing-Data-Analytics-for-Mapping-and-Monitoring-Global-Forest-Carbon_R2896",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "Postdoctoral Fellowship Opportunity in Advancing Climate Information Decision Support in California",
      "externalPath": "/job/JPL-Campus/Postdoctoral-Fellowship-Opportunity-in-Advancing-Climate-Information-Decision-Support-in-California_R3636",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Postdoc: Planetary Radio Science and Bistatic Radar",
      "externalPath": "/job/JPL-Campus/Postdoc--Planetary-Radio-Science-and-Bistatic-Radar_R3947",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 29 Days Ago",
      "startDate": "2023-02-14"
    },
    {
      "title": "Postdoc Position: NISAR Retrieval Algorithms Development",
      "externalPath": "/job/JPL-Campus/Postdoc-Position--NISAR-Retrieval-Algorithms-Development_R1089",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-29"
    },
    {
      "title": "“Postdoc Position: Interaction of Dust and Water Ice Clouds in the Martian Atmosphere”",
      "externalPath": "/job/JPL-Campus/XMLNAME--Postdoc-Position--Interaction-of-Dust-and-Water-Ice-Clouds-in-the-Martian-Atmosphere-_R3181",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-23"
    }
  ],
  "userAuthenticated": false
}
