{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technical-Designer-II_R4507",
    "id": "731ce68d6c0b1001c352dd5df0590001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Wanted</b>: A <b>Technical Designer</b> with a range of skills related to the design, documentation, implementation, assembly, and test of Ground Support Equipment for flight mission testbeds and path-to-flight development tasks.  Responsibilities may include CAD modeling and drawing release of mechanical GSE parts; drawing generation and release management for modified COTS cables and custom harnesses; and design and assembly of MGSE component racks and testbeds (test frames, assemblies, actuator mounts, etc.).</p><p></p><p>This opportunity is within the <b>Embedded Robotic Systems Group </b>of the<b> Mobility and Robotics Systems Section</b>. We develop, design, engineer, fabricate, package, program and analyze climbing/roving/flying robots, robotic arms, testbeds, and ground support equipment (GSE) for terrestrial and space systems.  The systems you will work on span the range of early technology development, to verification and validation of flight systems relative to project requirements. Every project is part of something remarkable, and you always play a key role.  <span>Our work is many things, but never, ever boring.</span></p><p></p><p><b>Qualifications</b>:</p><ul><li><p>Typically requires a High school diploma with a minimum of 6 years of related experience, or Associates degree with 1&#43; years of related experience.</p></li><li><p>Experience in the design, implementation and verification of Mechanical Ground Support Equipment (MGSE) and assemblies for development and flight testbeds.</p></li><li><p>Experience in design of CAD models, and generation and release of mechanical part drawings, based on requirements provided by system engineering.</p></li><li><p>Experience in production and release of technical drawings for COTS or custom cable harnesses (e.g., Visio), based on diagrams provided by system engineering.</p></li><li><p>Release and maintain CAD parts/assemblies/drawings through EPDM.</p></li><li><p>Experience in production and maintenance of specification documents which define the scope, functional requirements, block diagrams, and BOM of MGSE components.</p></li><li><p>Excellent interpersonal and communication skills to work effectively in a team environment.</p></li></ul><p></p><p><b>Preferred Skills: </b></p><ul><li><p>Experience in mechanical design using one or more CAD programs such as: SolidWorks, UGNX, or Pro/ENGINEER.</p></li><li><p>Experience with hardware design and assembly, 3D rapid prototyping, machining skills, including fasteners, connectors, cabling, and other mechanical assembly.</p></li><li><p>Knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$74,984 - $99,944<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Technical-Designer-II_R4507",
    "jobReqId": "R4507",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 2 Days Ago",
    "startDate": "2023-06-29",
    "timeType": "Full time",
    "title": "Technical Designer II"
  },
  "userAuthenticated": false
}
