{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Project-Information-Management-Engineer-II_R4193",
    "id": "b958ef6f88d5100169be532c15ae0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u><span>Responsibilities:</span></u></b></p><p></p><p><span>Do you have a passion for space exploration and Information Management Systems? Are you a strategic thinker who enjoys the challenge of developing and improving engineering practices and processes?</span></p><p></p><p><span>We invite you to join the Special Programs Information and Configuration Management Group to serve as an <b>Information</b> <b>Management Engineer Level 2.</b> Reporting functionally to the <b>Special Programs Information and Configuration Management Group Supervisor </b>and programmatically to one or more line organizations (including Program Offices, Groups, Sections, Divisions, Directorates)<b>. </b></span></p><p></p><p><span>We seek a motivated individual who can work independently and within a team environment, be able to strategically lead teams, and initiate and lead tasks that need to be performed across a spectrum of business and engineering organizations.</span></p><p></p><p><span>As a member of the Special Programs Information and Configuration Management Group, the Information Management Engineer (IME) is responsible for tailoring and implementing the institutional requirements within line organizations. Through strategic intervention, Information Management Engineers:</span></p><p></p><ul><li><p><span>Recommend best practices and improved processes for the creation of information.</span></p></li><li><p><span>Optimize the findability and usability of information, including improvements to the end-user experience in JPL’s enterprise search solution (manually boosting search results and advising information creators on how they can improve documentation practices for better findability).</span></p></li><li><p><span>Improve the longevity, robustness, and reusability of documents and other information produced as a result of daily operations.</span></p></li><li><p><span>Improve processes to track changes and remove redundancies for more resilient information.</span></p></li><li><p><span>Work with IT teams to assess systems to determine their optimal integration with the broader enterprise information ecosystem (i.e., what is the difference between SharePoint and Confluence and which should teams use?).</span></p></li><li><p><span>Liaise between the IT Directorate (and specifically the search team), the Digital Transformation organization, the Enterprise and Information Systems Engineering organization, and end users.</span></p></li><li><p><span>Apply Library and Information Science principles in innovative ways to provide creative, sustainable solutions to complex information challenges.</span></p></li></ul><p></p><p><b><u><span>Qualifications:</span></u></b></p><p><span>Bachelor’s degree in Engineering, Library and Information Science, or related field with a minimum of 3 years of related experience or a Master’s degree with 1 year of related experience. The applicant must understand information management; have experience coordinating and collaborating efficiently in a multifaceted environment; and have excellent verbal and written communication skills.</span></p><p></p><p><b><u><span>Preferred Skills:</span></u></b></p><p><span><span>· </span></span><span>Ability to manage stakeholder relationships and expectations</span></p><p><span><span>· </span></span><span>Experience creating, updating, and maintaining MS Office information</span></p><p><span><span>· </span></span><span>Experience using advanced features of a wiki platform such as Confluence</span></p><p><span><span>· </span></span><span>Experience managing and tracking actions and tasks in JIRA</span></p><p><span><span>· </span></span><span>Experience using an enterprise content management system such as SharePoint</span></p><p><span><span>· </span></span><span>Customer service experience a plus</span></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$81,744 - $100,256<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Project-Information-Management-Engineer-II_R4193",
    "jobReqId": "R4193",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 5 Days Ago",
    "startDate": "2023-04-05",
    "timeType": "Full time",
    "title": "Project Information Management Engineer II"
  },
  "userAuthenticated": false
}
