{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Division-Business-Manager--Division-31-Systems-Engineering-Division--_R4483-1",
    "id": "df7d6edb07091000d27529941bca0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p></p><p><b>The Engineering and Science Directorate (ESD) </b>is seeking a <b>Division Business Manager</b> for the <b>Systems Engineering Division (31)</b> to provide broad leadership, management, direction and oversight for finance, human resource, facilities, acquisitions, communications, safety and administrative operations across the Division. This position will report to the <b>Directorate Operations and Business Manager</b> and be a valued partner to the Division Manager and Deputy Division Manager, working closely with them to support the day-to-day operations and strategic direction of the Division. The ability to successfully navigate this matrix leadership model will be key to the success of this role.</p><p></p><p><b>Specific responsibilities include:</b></p><ul><li><p>Providing management, direction and oversight to the business team supporting the division and sections, either directly or through a supervising manager. Develop and communicate business operating strategies based on the organizational goals of the Directorate and Division.</p></li><li><p>Leading a diverse, highly-qualified staff, providing career coaching, growth and professional development for direct reports.  Encouraging the same commitment from direct reports to their teams.  Developing and implementing training and educational opportunities for the Division’s business and support staff.</p></li><li><p>Leadership in all areas of financial strategy, budgeting, forecasting, and planning activities for the Division, including burden (operations and investments) and direct portfolios. Through subordinate supervisors and administrators ensure integrity of routine financial reporting and performance within schedule/budget constraints. Confirm the appropriate business processes and supporting financial management reporting tools are in place to meet the ongoing and future needs of the division. </p></li><li><p>Ensuring successful line business administration support to CAMs/PDMs in cost and schedule planning, forecasting, analysis, performance measurement, reporting, cost estimation, and acquisition activities across all phases of the project lifecycle.</p></li><li><p>Coordinating the quarterly Institutional Workforce Forecast (IWF) exercises.  Supporting management by analyzing historical data and workforce trends, understanding current needs, and forecasting the future state to ensure the division has the people they need to successfully execute their portfolio.</p></li><li><p>Overseeing the Division’s personnel management operations, including the annual salary review process, rewards &amp; recognitions programs, talent management activities, onboarding/offboarding, and overall position management in Workday. Collaborating with HR on all human capital activities and initiatives.</p></li><li><p>Recommending, developing and monitoring business policies, procedures and processes to improve the overall effectiveness of the Division.</p></li><li><p>Establishing, coordinating, and facilitating communications designed to enhance the exchange of information throughout the organization.</p></li><li><p>Ensuring employee awareness and compliance with Laboratory policies, procedures and practices, and regulatory requirements.</p></li><li><p>Implementing laboratory safety programs, including the identification of proper equipment, procedures and training.</p></li><li><p>Overseeing the Division’s offices and technical facilities and ensuring their effective use.</p></li><li><p>Collaborating with the Division and Directorate on strategic planning efforts.</p></li><li><p>Participating in the planning, design and implementation of laboratory initiatives and policies by representing the Division/Directorate on various laboratory committees and teams.</p></li></ul><p></p><p><b>Qualifications:  </b></p><ul><li><p>Bachelor’s degree in Business Administration, Finance or related discipline with a minimum of 4 years of management experience.</p></li><li><p>Deep multidisciplinary knowledge of finance, workforce planning, personnel management, service center management, acquisition processes, and project business management.</p></li><li><p>Outstanding leadership, interpersonal, and communications skills with demonstrated ability to collaborate effectively and influence others at all levels of Laboratory management.</p></li><li><p>Exceptional analytical reasoning skills with the ability to organize complex materials and concepts in a manner that is clear, persuasive, logical and builds a consensus.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Breadth of experience in managing and implementing cost estimation, cost and schedule planning, forecasting, analysis, and EVM.</p></li><li><p>Demonstrated experience in flight projects, with emphasis on the formulation and implementation phases.</p></li><li><p>Demonstrated ability to navigate changing project scenarios and life cycle cost.</p></li><li><p>Understanding of facilities planning, property management, acquisition, and safety/environmental compliance.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$151,840 - $203,528<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Division-Business-Manager--Division-31-Systems-Engineering-Division--_R4483-1",
    "jobReqId": "R4483",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Yesterday",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-21",
    "timeType": "Full time",
    "title": "Division Business Manager (Division 31 Systems Engineering Division )"
  },
  "userAuthenticated": false
}
