{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Business-Financial-Analyst_R4603-1",
    "id": "7b80074bcd971001162822fcbbee0001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Responsibilities </u></b></p><p>As a Business Analyst you will be working for JPL&#39;s Communications and Education Directorate supporting the folks who are responsible for inspiring the next generation of explorers and sharing the excitement of our missions with the world.<br /><br />Some of your responsibilities include:</p><ul><li>Lead the JPL Awards activities, including calls for NHAs/centralized/decentralized awards.</li><li>Conduct IWF reporting and analysis.</li><li>May lead the facilities activities:  participates in strategic and detailed planning.</li><li>Assists cognizant individuals with all aspects of acquisitions, including tracking, budgeting and costing of items.</li><li>Conducting financial analysis which include detailed reviews of planned Cost<br />and Obligations, Plan vs. Actual and explanation of all variances on direct cost<br />accounts within the section.</li><li>Contributes as a key team member on teams inside and outside organization, project, activity or function.</li><li>Help manage OCOMM Task Plan with HQs.</li><li>Help lead the 18x proposal and budgeting process with Program Directorates.</li><li>Assess and validate the schedule/cost baseline integrity to ensure that it is effective, accurate, and executable.</li><li>Identify and communicate anomalies in the schedule data, analyze horizontal logic and critical path traceability.</li><li>May assist with schedule creation, editing and/or monitoring.</li><li>Participate in and assist with budget planning for cost accounts.</li><li>Provide financial reporting &amp; analysis, including preparation for MMRs, QMRs, and ad hoc reviews.</li><li>Assist in the production and present high level summary schedule reports to 18x Management.</li><li>Develops time-phased budgets and EACs in accordance with schedule plans.</li><li>Prepares reports using JPL reporting systems relative to budget creation. Analyzes findings and report issues to business team.</li><li>Analyzes funding reports and researches funds status and burn rates and communicates funding needs to business team and/or supervisor.</li></ul><p></p><p><b><u>Qualifications</u></b></p><ul><li>Typically requires a Bachelors degree in Business Administration or related discipline<br />with a minimum of 3 years of related experience; Masters degree in similar disciplines<br />with a minimum of 1 years of related experience; or PhD in similar disciplines with a<br />minimum of 0 years related experience.</li><li>Analytical skills (including statistical charting).</li><li>Knowledge in the areas of financial analysis and reporting, human resources<br />and acquisitions.</li><li>Proficiency with Microsoft Office Applications such as Excel (advance excel, macros, pivot table, vlookup, etc.), Word and PowerPoint.</li><li>A customer service philosophy and professionalism when interfacing with all<br />levels of personnel.</li><li>Excellent written and oral communication skills.</li><li>Ability to implement best business practices in achieving the goals of the<br />organization.</li></ul><p><br />Preferred Skills:</p><ul><li>Knowledge of JPL policies, procedures, processes and financial<br />systems</li><li>Administrative experience in the areas of financial analysis, budgeting, cost<br />analysis, asset management, workforce planning, and human resources</li><li>Experience with ORACLE financials and requisition modules</li><li>Strong analytical skills</li><li>Strong excel skills</li><li>Experience with Excel BI, Power BI, PowerPivot</li><li>Strong oral and written communication skills</li><li>Experience with system administration and databases.</li><li>Experience with leading small groups or teams</li><li>Experience with website design, development and maintenance</li><li>Experience with Wiki development</li><li>Some programming experience preferred</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$83,304 - $101,400<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Business-Financial-Analyst_R4603-1",
    "jobReqId": "R4603",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 25 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-08",
    "timeType": "Full time",
    "title": "Business/Financial Analyst"
  },
  "userAuthenticated": false
}
