{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/User-Interface-Developer-Level-I_R4162",
    "id": "e69c71fb5b7e1001589aa6ee5f960000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Job Details:</b></p><p>NASA Jet Propulsion Laboratory continues to strive to push the boundaries for space exploration. This is in part to the outstanding team that gets assembled overcoming any challenges. The Artificial Intelligence (AI), Analytics and Innovative Development Division in the Information Technology and Solutions Directorate (ITSD) is looking for a <b><u>Visualization and User Interface Developer I</u></b> to be part of the Data Visualization and Infusion (174C) group. This group’s mission is to bring together immersive technology, computer vision, data visualization, and application development to create compelling new ways for scientists and engineers to conduct their research and operations at JPL, NASA and beyond.</p><p></p><p><b>Responsibilities:</b></p><p></p><p>The Visualization and UI Developer will be conducting front end or full-stack application development, as part of a team of designers, developers, and system engineers. The Developer should have experience working with a variety of application development languages and frameworks, including 3D and immersive reality applications – as well as quickly learn new ones as needed. Because the 174C Group provides both R&amp;D and operational support services to lab, the Developer must understand and be able to adapt to the different nuances and requirements of each scenario, even simultaneously.</p><p></p><p>The Developer will work with their team to gather requirements and deliver iterative software releases to customers. The ability to collaborate and communicate comfortably with all levels of staff and management is a must; the successful candidate will possess excellent interpersonal skills, professionalism, and self-awareness.</p><p></p><p><b><u>Required Skills: </u></b></p><ul><li>Typically requires a Bachelor’s degree in Engineering, Computer Science, Information Systems or related discipline with 1 year of related experience; Master’s degree in similar disciplines with a minimum of 0 years of related experience</li><li>Knowledge in one or more related fields including: full stack development, user interface design and development, user experience research, 3D modeling and development, immersive reality application development</li><li>General understanding and application of principles, theories, concepts and techniques in software design and implementation</li><li>Experience with Java, C#, Python, HTML/CSS, JavaScript and JS-based frameworks such as NextJS, React, Angular, etc.</li><li>Experience with back end / full stack frameworks such as NodeJS, Django, Flask, etc.</li><li>Experience with 3D modeling and 3D asset generation</li><li>Experience with AR/VR/XR software and hardware</li><li>Experience working with a team of developers, designers, and project leads to successfully complete a project, on time and on budget</li><li>Experience with leading a software development project</li></ul><p></p><p><b><u>Desired Skills: </u></b></p><ul><li>Demonstrated excellent communication (both oral and written) with ability to present technical results to a wide audience</li><li>Automated testing experience: Mocha, Karma, Jasmin, or similar</li><li>Experience with cloud applications</li><li>Familiarity with Linux/Unix development environment</li><li>Self-motivated, organized, detail oriented, able to work on multiple projects simultaneously</li><li>Knowledge or interest in space mission design, analysis, and operations</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$82,368 - $106,496<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "User-Interface-Developer-Level-I_R4162",
    "jobReqId": "R4162",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Yesterday",
    "startDate": "2023-03-29",
    "timeType": "Full time",
    "title": "User Interface Developer Level I"
  },
  "userAuthenticated": false
}
