{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Electric-Propulsion-Technologist-II_R4240",
    "id": "590602e9529a1001542a74022f2f0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the <b>Mechanical Systems Engineering, Fabrication and Test Division </b>which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breadth of mechanical disciplines and is applied from architectural concept development through operations.</p><p></p><p>As an Electric Propulsion Technologist, you will be working for the <b>Propulsion, Thermal and Materials Engineering Section</b> which provides leadership and unique world-class expertise in a wide range of technologies and technical discipline areas of chemical and electric propulsion, thermal, materials, contamination control, analytical chemistry, geochemical instruments, planetary protection, physics-based modeling, and multiphase flow. Will be a member of the <b>Electric Propulsion (EP) Group</b> and will report to the Group Supervisor. </p><p></p><p>Primary responsibility will be to provide test engineering and flight operations support for the EP laboratories at JPL that are engaged in the development and qualification of a broad range of electric thrusters including Hall thrusters, gridded ion thrusters, electrospray thrusters, and advanced propulsion systems.</p><p></p><p>NOTE: This position may be classified at one level higher than the posted level. A determination will be made once the final candidate has been identified.</p><p></p><p><b><u>Responsibilities:</u></b></p><ul><li>Will provide test engineering support for the EP laboratories at JPL in the areas of: vacuum systems, gaseous and liquid-metal propellant feed systems, high-voltage power electronics, electric thrusters, plasma diagnostics, and data acquisition systems.</li><li>Will apply EP expertise to the operation of flight Hall thruster systems.</li><li>Will apply experimental or theoretical principles and scientific methods to the design, development, optimization, testing, and analysis of complex vacuum systems, data acquisition systems, plasma diagnostics, and electric thrusters.</li><li>Will develop laboratory test plans and procedures and present at test readiness reviews.</li><li>Will install and operate electric thrusters and diagnostics.</li><li>Will analyze electric thruster and diagnostic test data, write reports, and present results.</li><li>Will support and maintain EP vacuum facilities and related support equipment such as propellant feed systems, high-voltage power electronics, data acquisition systems, and diagnostics. </li></ul><ul><li>Will work with technicians in the EP group and provide guidance and support of their tasks.</li><li>Will develop and validate technical specifications to comply with project/program requirements.</li><li>Will partner with other researchers to develop technologies with potential flight or other research application.</li></ul><p></p><p><b><u>Required Skills: </u></b></p><ul><li>Typically requires BS degree in Aerospace Engineering, Mechanical Engineering, Electrical Engineering, Applied Physics, or Physics with a minimum of 3 years of experience, or MS degree with a minimum of 1 years of experience, or Ph.D. degree in related technical discipline with a minimum of 0 years of experience.</li><li>Prior academic or work experience in a relevant laboratory setting including direct experience with one or more of the following:vacuum systems, plasmas, electric thrusters, data acquisition systems, and diagnostics.</li><li>Experience with LabVIEW-based data acquisition and control systems.</li><li>Experience with scripting and programming languages such as Python.</li><li>General understanding and application of standard principles, theories, concepts and techniques in electric propulsion.</li><li>General knowledge of applicable industry and/or academic practices and standards.</li></ul><p></p><p><b><u>Desired Skills: </u></b></p><ul><li>Prior work experience in a government or industry setting in <u>electric propulsion</u> development, qualification, and flight implementation.</li><li>Prior academic or work experience in a relevant laboratory setting including direct experience with all of the following:vacuum systems, plasmas, electric thrusters, data acquisition systems, and diagnostics.</li><li>Broad experience and programming capability with LabVIEW-based data acquisition systems and control systems for power electronics and instrumentation.</li><li>Experience with mechanical design, 3D solid modeling, and the generation of drawings for fabrication.</li><li>Prior work experience with electric propulsion system requirements for deep space robotic spacecraft.</li><li>General knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</li></ul><p></p><p><b><u>JPL offers: </u></b></p><ul><li>Being part of a team of passionate and dedicated explorers of the universe with some of the world’s best capabilities in science, technology and engineering, working on space missions and projects you can’t do anywhere else.</li><li>The pride of working at NASA and Caltech creating missions that make a difference in people’s lives around the world.</li><li>A comprehensive benefits plan including tuition reimbursement and generous Caltech retirement contributions.</li><li>A flexible work schedule, including a 9/80 and telecommuting options.</li><li>An open and casual work environment on a beautiful 177-acre campus-like facility.</li><li>Come thrive in an environment that encourages innovation and creativity!</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$75,608 - $114,816<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Electric-Propulsion-Technologist-II_R4240",
    "jobReqId": "R4240",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 8 Days Ago",
    "startDate": "2023-06-28",
    "timeType": "Full time",
    "title": "Electric Propulsion Technologist II"
  },
  "userAuthenticated": false
}
