{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Delivery-Manager-IV-V_R4381",
    "id": "753d3026a57c100112dab451b8a20000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><h1><b>Overview</b></h1><p></p><p>JPL’s Mission Design and Navigation Section 392 builds maps and tools for interplanetary navigation, designs efficient routes for spacecraft to reach remote solar system locations, and safely pilots spacecraft to their ultimate destination. We are responsible for: mapping the trajectory design and navigation trade-space to efficiently maximize science return while adhering to operational constraints and mitigating mission risks, science-based modeling, filtering and optimization, balancing trajectory knowledge and control, and quantifying observability and uncertainty.</p><h1></h1><p></p><h1><b>Responsibilities</b></h1><p></p><ul><li><p>Will be a member of the  Flight Path Control Group in the Mission Design and Navigation (MDNAV) Section. Will report administratively to the Flight Path Control  Group Supervisor and programmatically to the Near-Earth Object (NEO) Surveyor Project Mission System Manager. Will be responsible for managing the trajectory design/mission analysis, mission planning, and navigation activities for the NEO Surveyor Project. </p></li><li><p>Will manage and provide leadership to the NEO Surveyor Mission Design Team (MDT) and will ensure objectives, goals, and commitments (i.e., performance, risk, cost, and schedule) are met.  Will determine performance metrics for the MDT and regularly report progress to project management.  Will negotiate budgets, work agreements, deliverables, and resources with the project and line organizations.  Will lead the generation, approval, and issuance of MDT products (e.g., Mission Plan, Navigation Plan, Target Specification, etc.) as well as lower-level implementation plans, on schedule and within agreed upon costs.</p></li><li><p>Will ensure the quality, accuracy, and integrity of the deliverables in compliance with JPL standards and project plans and policies.  Will lead development of enabling technologies in the area of MDNAV to support the NEO Surveyor Project.  Will provide unbiased risk assessments in the area of MDNAV and maintain an understanding of key trajectory and navigation related margins.  Will serve as the spokesperson for the team or project in the area of MDNAV and will be a key presenter at project reviews.  Actions and decisions by the Mission Design Manager will have a significant impact on the  Project, JPL, and NASA.  Erroneous decisions or recommendations may result in failure to achieve the organization’s critical objectives and affect its reputation and credibility.</p></li></ul><p></p><h1><b>Qualifications</b></h1><p></p><h2>Required Skills</h2><ul><li><p>Bachelor&#39;s degree in Aerospace Engineering, or related technical discipline with a minimum of 9 years of related experience; Master&#39;s degree in similar discipline with a minimum of 7 years of related experience; or PhD in similar discipline with a minimum of 5 years related experience.</p></li><li><p>Wide-ranging experience and advanced knowledge in Mission Design and Navigation.</p></li><li><p>Demonstrated experience developing and implementing Mission Design and Navigation systems.</p></li><li><p>Demonstrated ability to present technical results to a broad range of audiences.</p></li><li><p>Experience interfacing with Project Management and Lead Engineers (e.g., Project Manager, Mission System Manager, Project Chief Engineer, Project System Engineer, Flight System Engineer, and Flight System Phase Leads).</p></li><li><p>Experience interfacing with other project and spacecraft teams both internal and external to JPL (e.g., Spacecraft Team, Attitude Control System Team, Sequence Team, Launch Vehicle Provider).</p></li><li><p>Excellent communication and interpersonal skills.</p></li></ul><p></p><p></p><h2>Desired Skills</h2><ul><li><p>Previous JPL technical team leadership experience.</p></li><li><p>Previous participation in project and peer reviews.</p></li><li><p>Recognized expert in Mission Design and Navigation.</p></li><li><p>Ability to interact with other senior project leadership in the development and implementation of complex and broad reaching solutions to key and driving aspects within the project.</p></li><li><p>Demonstrated experience in staff/budget planning and cost/schedule management.</p></li><li><p>Multidisciplinary and in-depth expertise used in the application and development of principles, theories, and concepts in Mission Design and Navigation.</p></li><li><p>Knowledge of Laboratory policies and procedures (including JPL Flight Project Practices and Design Principles), NASA policies and procedures, and government regulations across a range of applications related to Mission Design and Navigation.</p></li></ul><p></p><p><b><i>NOTE: </i></b><i>This position may be classified at one level higher than the posted level. A determination will be made once the final candidate has been identified. </i><i>The typical full time equivalent annual hiring range for this job at a<br />level higher in Pasadena, California. <span>$187,512-$235,976</span> </i></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$153,816 - $191,360<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Delivery-Manager-IV-V_R4381",
    "jobReqId": "R4381",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "startDate": "2023-05-30",
    "timeType": "Full time",
    "title": "Delivery Manager IV/V"
  },
  "userAuthenticated": false
}
