{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Structural-Engineer-III_R4057",
    "id": "a1502bcb371310015cccc32bc2480000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Antenna Mechanical &amp; Structural Engineering Group is looking for a <b>Civil/Structural Engineer</b> to become part of the Deep Space Network (DSN), working on large antenna foundations and steel structure for fully steerable antennas ranging from 34m to 70m diameter. This role will be responsible for the design, analysis, documentation, and implementation of new structures or systems, both as an individual and/or as the lead of a small team. In this role you will do the following:</p><ul><li><p>Design, detail, analyze, and document civil and structural components and assemblies: Earthwork/Excavation, Reinforced Concrete Foundation, Structural Steel (building and platforms) and Antenna Structure</p></li><li><p>Work with vendors (third party Architectural &amp; Engineering firms) in development of complex foundations or structural components</p></li><li><p>Conduct in-depth reviews and/or approve the designs, analysis, drawings, specifications, submittals, and documentation of others in the group</p></li><li><p>Review the technical integrity, quality, and value of the work performed through functional requirements, interface agreements, and peer reviews</p></li><li><p>Lead the monitoring and inspections of existing Antenna structures and be capable of interpreting historical and current data to analyze structural integrity</p></li><li><p>Provide field oversight for critical activities or inspections at any of the three DSN sites (California, Spain, Australia)</p></li><li><p>Work as a Contract Technical Manager (CTM) to ensure successful deliverables by contract engineering</p></li><li><p>Present at DSN process reviews as a core contributor to larger project teams</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>You must have a Bachelor’s degree in Civil or Mechanical Engineering or related technical field with a minimum of 6 years related professional experience, or a Master’s degree with a minimum of 4 year of related experience, or Ph.D with 2 years of relate experience</p></li><li><p>Extensive knowledge of Civil Engineering design, with an emphasis in foundation or structural design readily applicable to large moving structures (1 million pounds or greater)</p></li><li><p>Background in steel structural analysis or reinforced concrete analysis</p></li><li><p>Proficiency of standard building codes such as ASCE, ACI, AISC, and IBC</p></li><li><p>Outstanding written and oral communication skills as well as the ability to effectively negotiate with others</p></li><li><p>Proven ability to work in a broad team environment</p></li><li><p>Able to travel, to supported domestic and foreign locations, sometimes with short notice</p></li></ul><p></p><p><b>Preferred Skills: </b></p><ul><li><p>Experience working on large antennas or similar large, slow moving structures</p></li><li><p>Experience working with geotechnical studies and analysis</p></li><li><p>Experience performing forensic engineering and risk analysis of various structures and components</p></li><li><p>Experience working with multi-national teams operating in multiple time zones</p></li><li><p>Prior knowledge of CAD (AutoCAD, Solidworks) and structural design and analysis software such as SAP 2000 or ETABS</p></li><li><p>Familiar with a broad area of civil and environmental engineering design such as excavation, grading, drainage, road ways, and underground storage tanks</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$115,336 - $141,544<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Structural-Engineer-III_R4057",
    "jobReqId": "R4057",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 29 Days Ago",
    "startDate": "2023-03-09",
    "timeType": "Full time",
    "title": "Ground Antenna Civil and Structural Engineer III"
  },
  "userAuthenticated": false
}
