{
  "jobPostingInfo": {
    "id": "5e374ff5ac1e1001630a31182e600000",
    "title": "Mars Sample Return Lander Payload Fault Protection Engineer IV",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><h2><b>Responsibilities:</b></h2><p>If you are passionate about spacecraft design, we invite you to join the <b>Flight Systems Engineering, Integration and Test Section</b>. We provide systems engineering for the design and implementation of spacecraft for the laboratory’s key flight projects. Our work spans spacecraft systems engineering, payload systems integration, electrical systems integration, fault protection and autonomy design, landing systems design, spacecraft assembly and test, systems verification and validation, and systems modeling.</p><p></p><p>Note: <b>Fault Protection</b> (FP) is an exciting and cross-cutting systems engineering discipline with the charter of ensuring that the mission can be accomplished in the presence of an off-nominal condition or event (“fault”). Fault protection engineers perform rigorous analyses to understand all of the ways the mission can fail due to a fault, and they architect complex software behaviors to autonomously detect those faults and to restore system functionality. As a result, fault protection engineers develop a <b>strong technical knowledge</b> across the <b>breadth</b> of a particular flight system, as well as a <b>depth</b> in several areas. Their knowledge of the system behavior in off-nominal conditions makes them essential for diagnosing and responding to in-flight anomalies.</p><p></p><p>We are seeking a highly motivated and experienced <b>Systems Engineer IV</b> to join the <b>Autonomy and Fault Protection Group</b>, reporting administratively to the Technical Group Supervisor and programmatically to both the Sample Return Lander Payload Lead Systems Engineer and the Fault Protection Lead. Your initial assignment will be to serve as a fault protection engineer Mars Sample Return Lander (SRL) project. Some of your initial tasks may include performing various system fault protection and reliability analyses, documenting the preliminary payload fault protection design, and specifying the design for the flight software team to implement.</p><p></p><p>You will work independently and within a team environment, collaborating on tasks performed across a spectrum of disciplines and have excellent writing and oral presentation skills.</p><p></p><h2><b>Tasks may include but not limited to:</b></h2><ul><li><p><b>Lead the fault protection architecture</b> and design for <b>all SRL Payloads</b> – this includes the Mars Launch System, the Sample Transfer and Handling System, and the Sample Recovery Helicopters</p></li><li><p>Coordinate with the System Fault Protection lead to <b>deliver standard System FP products</b> related to the payloads, including the system reliability analyses, design and documentation for flight software implementation of FP behaviors, and verification and validation planning</p></li><li><p><b>Coordinate with external providers</b> to provide guidance on Payload-internal fault protection vs JPL Lander-based fault protection</p></li><li><p>Capture various aspects of the fault protection design in <b>clear and concise documentation</b>, including in design documents and in flight software dictionaries</p></li><li><p>Be responsible for <b>verifying and validating</b> the payload fault protection design by running suites of tests on various hardware and software-based test venues</p></li><li><p>Assess the impact of deficiencies identified in the system and <b>convey possible solutions and risks</b> to project leadership</p></li></ul><p></p><h2><b>Qualifications:</b></h2><ul><li><p>Bachelor’s degree in Engineering, Physics, or related technical discipline with a minimum of 9 years of professional experience, or Master’s degree with a minimum of 7 years of experience, or Ph.D with a minimum of 5 years of experience.</p></li><li><p>Significant knowledge in one or more of the following areas: <b>systems engineering, aerospace engineering, and reliability trades/analyses</b></p></li><li><p>Familiarity with the principles, theories, concepts, designs, analyses, and techniques applied in <b>autonomous space systems and fault protection</b></p></li><li><p>Significant knowledge of the <b>function and operation of spacecraft</b> systems and subsystems</p></li><li><p>Ability to <b>synthesize the unique discipline knowledge</b> of a broad range of technical subject matter experts</p></li><li><p>Be a <b>self-motivated</b> individual who can work independently, in a team environment</p></li><li><p>Must have <b>excellent written and oral communication</b> skills</p></li></ul><p></p><h2><b>Preferred Skills:</b></h2><ul><li><p>Experience with payload systems engineering</p></li><li><p>Comfortable with <b>architecting and assessing complex autonomous software behaviors</b></p></li><li><p>Ability to work independently on major project assignments, with accountability for technical performance, budget and schedule</p></li><li><p>Ability to participate in requirements development for systems</p></li><li><p><b>Excellent problem-solving skills</b></p></li><li><p>Ability to deal with multiple issues, tasks and priorities concurrently</p></li><li><p>Ability to interact effectively across multiple disciplines with government and non-government agencies</p></li><li><p>Experience leading tasks and coordinating working groups on large-scale projects in system development, test, and/or operations</p></li><li><p>Experience with development and delivery of system documentation, such as requirements documents, test plans, and release description documents</p></li><li><p>Experience with functional requirement development and translation into system / subsystem / architecture, design, and implementation</p></li><li>Willingness to obtain a security clearance if asked.</li></ul><p></p><h2><b>Note: Must be U.S. Citizen or Permanent Resident</b></h2><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$143,312 - $183,248<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-11",
    "timeType": "Full time",
    "jobReqId": "R3728",
    "jobPostingId": "Mars-Sample-Return-Lander-Payload-Fault-Protection-Engineer-IV_R3728",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Mars-Sample-Return-Lander-Payload-Fault-Protection-Engineer-IV_R3728"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Mission Interface Engineering Manager",
      "externalPath": "/job/JPL-Campus/Mission-Interface-Engineering-Manager_R3193",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer IV (MassChange Project V&V Lead)",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-IV--MassChange-Project-V-V-Lead-_R4035",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 15 Days Ago",
      "startDate": "2023-03-01"
    },
    {
      "title": "System Engineer IV (Europa Clipper GNC Flight Systems Engineer)",
      "externalPath": "/job/JPL-Campus/System-Engineer-IV--Europa-Clipper-GNC-Flight-Systems-Engineer-_R3191",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer IV (TS/SCI)",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-IV--TS-SCI-_R2918",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    }
  ],
  "userAuthenticated": false
}
