{
  "jobPostingInfo": {
    "id": "870347114ed710015871d0134f1e0000",
    "title": "Section Staff Assistant",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Wanted Section Staff Assistant</b>.  This position is an outstanding opportunity to be part of JPL&#39;s <b>Autonomous Systems Division</b>. Our division is responsible for technology, advanced concepts, design, development, delivery, integration &amp; test, verification &amp; validation, operation of hardware, flight software, power systems, robotic systems, and Guidance &amp; Control of a multitude of JPL products. We are looking for a motivated and dedicated Staff Assistant, to join our team within the <b>Business Administration Section</b>. You will report to the Business Administration Manager.</p><p>As a <b>Section Staff Assistant </b>for the <b>Mobility and Robotics Section (347)</b>, you will provide administrative support for Section Management, the Business Administration Manager and technical staff.  This is a position that requires solid customer service, strong organizational skills and flexibility in the performance of the job. Should be a motivated and collaborative teammate, thorough, with ability to take initiative to establish and implement process-improvements and have a willingness to learn.</p><p></p><p><b><i>Responsibilities:</i></b></p><ul><li><p>Serve as the lead to the Section’s Staff Assistant team to develop and improve processes and procedures.</p></li><li><p>Coordinate and maintain busy and complex calendars; schedule and maintain technical interchange meetings, set up and host WebEx conference calls.</p></li><li><p>Processing and preparing complex domestic and foreign travel logistics/bookings, authorization requests, and expense reports.</p></li><li><p>Scheduling meetings via Outlook and maintain conference room schedules.</p></li><li><p>Assisting in the sections recruiting process</p></li><li><p>Processing affiliate badge requests for domestic and foreign visitors, and escorting, as necessary.</p></li><li><p>Assisting with preparation of presentations, graphics, and website inputs, including proofreading and editing.</p></li><li><p>Coordinate events for the Section, such as workshops, conferences and/or morale events.</p></li><li><p>Participate on teams within the Section; may also participate on teams outside of the Section.</p></li><li><p>Other ad hoc duties, as assigned.</p></li></ul><p></p><p><b>Qualifications </b></p><ul><li><p>Typically requires a High School diploma with a minimum of 8 years of related experience; Associates degree with a minimum of 4 years of related experience; or Bachelor’s degree with a minimum of 1 year of related experience and/or related required training.</p></li><li><p>Extensive expertise in the administrative profession with strong organizational, computer and interpersonal skills.</p></li><li><p>Excellent planning and scheduling skills.</p></li><li><p>Ability to work optimally under pressure on multiple complex tasks, and work independently with minimal direction to meet commitments with high quality products.</p></li><li><p>Motivated self-starter who takes the initiative to establish and implement process improvements.</p></li><li><p>Ability to evaluate situations and apply good judgment in any necessary resolution.</p></li><li><p>Possess excellent written and verbal communication skills.</p></li><li><p>Ability to interact effectively with all levels of personnel and provide excellent customer service.</p></li><li><p>Ability to exercise proper discretion when handling assignments of a discreet nature and when dealing with sensitive material.</p></li><li><p>Proficient in Microsoft Word, Excel, PowerPoint, and Outlook.</p></li></ul><p></p><p> <b>Preferred Skills </b></p><ul><li><p>Extensive understanding of JPL/ESD policies, procedures, and practices.</p></li><li><p>Experience in a technical group or section office environment.</p></li><li><p>Experience with JPL tools such as JPLID, UCS, Concur Travel, and Timekeeping.</p></li><li><p>Knowledge of JPL procurement processes such as Purchase Requisition, P-Card and iProcurement.</p></li><li><p>Familiarity with the JPL-ID process and on-boarding of volunteers, affiliates, and foreign nationals.</p></li><li><p>Experience with JPL foreign and domestic travel policies and procedures.</p></li><li><p>Willingness to look for, learn, and apply new Information Technology (IT) tools to office procedures and processes (e.g. Wiki, SharePoint).</p></li><li><p>Teaming skills and professionalism in working with all levels of personnel within and across multiple organizations.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$69,576 - $88,608<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-02-08",
    "timeType": "Full time",
    "jobReqId": "R3889",
    "jobPostingId": "Section-Staff-Assistant_R3889",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Section-Staff-Assistant_R3889"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Staff Assistant III (People Operations)",
      "externalPath": "/job/JPL-Campus/Staff-Assistant-III--People-Operations-_R3808",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-03"
    },
    {
      "title": "Staff Assistant III (Leadership & Organizational Development)",
      "externalPath": "/job/JPL-Campus/Staff-Assistant-III--Leadership---Organizational-Development-_R3809",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-23"
    }
  ],
  "userAuthenticated": true
}
