{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/System-Safety-Engineer-III_R3738",
    "id": "5e374ff5ac1e100105fb40f29d470000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>From design through launch, the <b>System Safety Office</b> works closely with projects to ensure the protection of personnel, flight-critical hardware and facilities. As a <b>System Safety Engineer,</b> you will work closely with JPL projects providing support that includes technical advice and direction, hazard analyses, risk mitigation techniques and hazardous operations support, ensuring compliance with JPL, NASA, Range and launch site requirements, safety practices, standards and regulations. JPL is undertaking many amazing missions to explore Mars, Jupiter and our own home planet, and we are seeking a candidate that has a system safety engineering technical background or aptitude to join our team and contribute to mission success!<br /> </p><p><b>Responsibilities:</b><br />As a System Safety Engineer, you will be responsible for the System Safety Program for one or more complex and critical projects</p><ul><li><p>Provide system safety engineering expertise to JPL Projects to lead efficient and effective system safety programs</p></li><li><p>Responsible for overall safety and hazard analysis for one or more highly complex projects</p></li><li><p>Perform system-level hazard analysis to identify potential safety issues, develop and improve system architecture to prevent or mitigate identified potential safety issue</p></li><li><p>Evaluate and assess hazards associated with hardware and software system design and operations, ensure all system safety inhibits and/or constraints are implemented.</p></li><li><p>Lead assigned project(s) in the implementation of appropriate mitigation techniques, safeguarding equipment, facilities, and the environment</p></li><li><p>Provide coordination with JPL institutional organizations, NASA centers, and external organizations on system safety issues</p></li><li><p>Prepare safety compliance documentation for the Project</p></li><li><p>Implements and evaluates complex programs and procedures to assure personnel, flight hardware and facility safety</p></li><li><p>Oversee mishap/close call investigations</p></li><li><p>May need to travel in support of projects Including launch campaign<br /> </p></li></ul><p><b>Qualifications:</b></p><ul><li><p>Bachelor of Science (BS) degree in Aerospace Engineering, Electrical Engineering, Mechanical Engineering, Computer Science, or related technical discipline with typically a minimum of 6 years of related experience; or Master’s degree in similar disciplines with a minimum of 3 years of relevant experience; or PhD in similar disciplines with a minimum of 1 year of relevant experience.</p></li><li><p>Engineering experience in electrical hardware design such as power, battery, and charging systems.</p></li><li><p>Wide-ranging experience in the field of System Safety or Systems Engineering.</p></li><li><p>Demonstrated ability to lead team members in the development and operation of critical systems, and to work with customers to ensure successful implementation of system safety programs.</p></li><li><p>Ability to prioritize schedules in support of multiple customers and identify potentially hazardous operations, and conditions that could directly involve or potentially impact personnel or space flight hardware.</p></li><li><p>Experience in performing independent risk assessment of products and processes.</p></li><li><p>Excellent interpersonal skills and ability to work well in team environment as lead or team member.</p></li><li><p>Excellent verbal and written communication skills, including presentation skills.</p></li></ul><p></p><p><b>Desired Skills:</b></p><ul><li><p>Familiarity with safety requirements (AFSPCMAN 91-710 or NS 8719.24)</p></li><li><p>Knowledge of NASA policies and procedures</p></li><li><p>System Safety Engineering field/floor experience</p></li><li><p>Experience in working well with all levels of personnel and management</p></li><li><p>Extensive experience in technical documentation</p></li><li><p><b>Ability to obtain TS/SCI clearance</b></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$118,144 - $142,792<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "System-Safety-Engineer-III_R3738",
    "jobReqId": "R3738",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30 Days Ago",
    "startDate": "2023-05-08",
    "timeType": "Full time",
    "title": "System Safety Engineer III"
  },
  "userAuthenticated": false
}
