{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Engineering-Development-Technician-III_R4544",
    "id": "c9a1e72849c11000ceded2d076ff0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><h2><b>Responsibilities: </b></h2><p>The <b>Microdevices &amp; Sensor Systems Section</b> operates under the Instrument Division and charters the development and delivery of sensors, instruments, instrument electronics, and flight software technologies needed by JPL/NASA to enable new terrestrial, astrophysics, and planetary in situ and remote science experiments and observations. The Section provides research and technology for science instrument as well as flight instrument engineering.</p><p></p><p>We are seeking a <b>Microdevices Engineering Development Technician III</b> with expertise in semiconductor manufacturing and maintenance of semiconductor equipment to join our outstanding Microdevices Laboratory team. Will be a key member of the Central Processing and MDL Support Group and will report to the <b>Group Supervisor</b> as well as the senior lead engineer assigned to maintaining the semiconductor processing equipment in the <b>Microdevices Laboratory (MDL).</b></p><p></p><h2><b>Tasks include, but are not limited to:</b></h2><ul><li><p>Provide oversight, coordination, and direct hands-on aid for all facilities and infrastructure maintenance in MDL, a semiconductor fabrication facility utilizing Hazardous Production Materials. </p></li><li><p>Interface and coordinate with other JPL facilities organizations when required.  The work includes maintaining vacuum equipment, life safety systems, gas distribution systems, plumbing systems, air handling systems, chemical exhaust systems, DI/RO water plant, compressors, LN2 distribution systems, LN2 deliveries, etc.</p></li><li><p>Provide upkeep and oversight of Spinners, Spin Track Systems, Deposition Systems, Etchers, and Characterization systems</p></li><li><p>Assist in the acquisition and incorporation of new pioneering systems for the MDL including providing specialized semiconductor equipment specifications for Patterning, Deposition, Etching, and Characterization</p></li><li><p>Provide support in the oversight and operation of semiconductor device processing equipment within the facility, including user training</p></li><li><p>Aid in the service of Life Safety Systems (including monitoring, exhaust systems, etc.);</p></li><li><p>Manage relevant information on the MDL web site such as condition updates of equipment</p></li><li><p>Provide Direct Processing service for others in conjunction with JPL’s Microdevices Laboratory (MDL) operations;</p></li><li><p>Act as an alternate gas handler</p></li><li><p>Act as a first floor warden</p></li><li><p>Position will involve some a periodic after hour work and respirator/ SCBA certification</p></li><li><p>There will be daily monitoring of the walk through of the MDL facility, logging state-required permit values where required.</p></li><li><p>Critical work includes tracking inventory and providing ordering and stocking of necessary supplies and materials including gas orders.</p></li></ul><p></p><h2><b>Qualifications: </b></h2><ul><li><p>High School with 8 years of related experience or Associates Degree in Electronics Engineering, Computer Science related subject area with 4 years of design and trouble-shooting of electronic systems/components experience or Bachelor’s with 1 year of related experience.</p></li><li><p>Multifaceted experience and expansive knowledge in the maintenance, upgrade, installation, and operation of high-tech semiconductor equipment (i.e. Patterning (Lithography), Deposition, wet and dry etching, Characterization, Dicing, and Packaging.)</p></li><li><p>Knowledge/experience of vacuum technology (sealing, and pumping systems), plasma physics, semiconductor processing, optics, computer control systems, electronic diagnostics, leak detection, and hands-on repairing of mechanical system.</p></li><li><p>Ability to respond to after hours emergency calls.</p></li></ul><p></p><h2><b>Preferred Skills:</b></h2><ul><li><p>Wide-ranging knowledge in at least one semiconductor processing area involving innovative processing equipment.</p></li><li><p>Ability to detect and repair electronics at the component level.</p></li><li><p>Proficiency in diagnosing and remedying computer problems, configure websites, and build networks with appropriate firewalls addressing IT Cybersecurity requirements.</p></li><li><p>Knowledge of life safety system monitoring and controls, cleanroom technology and operations, contamination control, Electrostatic Discharge Control, Facilities construction and maintenance (structural, electrical, plumbing—UHP water and UHP gas, HVAC,).</p></li><li><p>Knowledge of Si, GaAs, GaN, and superconductor processing, and general chemistry.</p></li><li><p>Excellent interpersonal skills (verbal and written).</p></li><li><p>Proficiency in communicating across a wide range of technical backgrounds and educational levels – Scientific and Facility trades as well as with outside regulatory agencies and inspectors.</p></li><li><p>Demonstrated ability to work on a team and build work relationships &amp; a strong ability to multi-task on different tasks.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$78,312 - $98,592<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Engineering-Development-Technician-III_R4544",
    "jobReqId": "R4544",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 3 Days Ago",
    "startDate": "2023-07-17",
    "timeType": "Full time",
    "title": "Engineering Development Technician III"
  },
  "userAuthenticated": false
}
