{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Flight-Software-Engineer-II_R4554",
    "id": "c9a1e72849c11001c54252d6c71d0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>Join a NASA flight software team working on the Mars Sample Return mission to return samples collected by the Mars Perseverance Rover to Earth!</span></b><span> This unique opportunity is part of the Autonomous Systems Division, which is responsible for technology development, advanced concepts, design, development, delivery, integration and test, verification and validation, and operation of Command and Data Handling (C&amp;DH) Hardware, Flight Software, Power Systems, Robotic Systems, and Guidance and Control.</span></p><p></p><p><span>This position is part of the <b>Advanced Flight Software Group</b> (348B), where you will be working for JPL&#39;s Flight Software and Avionics Systems Section, which provides leadership and unique world-class expertise in Avionics Systems Engineering, Spacecraft Flight Software development, Avionics Integration, Test, and Operations and Advanced Processor and Software Research.</span></p><p></p><p><span>As a Flight Software V&amp;V Engineer, you will be responsible for the design and execution of tests that exercise spacecraft capabilities such as communication, data management, device management, and fault protection.  You will pursue innovative strategies to continuously improve the test process in order to support verification and validation of the flight software. You will work closely with both the Flight Software Development Team as well as the Flight Software Systems Engineering Team to ensure the highest level of software quality. </span></p><p></p><p><b><span>Responsibilities:</span></b></p><ul><li><p><span>Design and implement test plans to verify and validate the Flight Software</span></p></li><li><p><span>Identify and solve issues with the flight software, surrounding simulations, and hardware in an integrated test environment </span></p></li><li><p><span>Work on a team with experienced flight software developers and flight software systems engineers</span></p></li><li><p><span>Have a genuine interest in learning about the entire flight system in order to develop flight like scenario tests as well as stress and robustness tests </span></p></li><li><p><span>Show a mindset of innovation in one or more of the following areas (test frameworks, process automation, data visualization)</span></p></li></ul><p></p><p><b><span>The following qualifications are required:</span></b></p><ul><li><p>Bachelor’s degree in Computer Engineering, Electrical Engineering, Computer Science/Electrical Engineer or related technical discipline with at least 3 years of related experience or Master’s degree in similar disciplines with at least 1 year of related experience</p></li><li><p>Experience developing or testing embedded systems in one of the following industries(aerospace, industrial automation, automotive)</p></li><li><p>Experience with software unit and integration test frameworks</p></li><li><p>Experience in both verification and validation of a software product</p></li><li><p>Excellent communication skills and ability to thrive in team environment</p></li><li><p>Excellent Python programming skills</p></li><li><p>Coursework and/or some knowledge in programming languages, software engineering, computer science theory, embedded programming</p></li></ul><p></p><p><b><span>Preferred Qualifications:</span></b></p><ul><li><p>Experience with full software development lifecycle of a flight software product</p></li><li><p>Experience working with hardware in the loop test environments</p></li><li><p>Familiarity with formal verification and validation test processes including requirement gathering and review, test plan/procedures specification and review, test results analysis and review</p></li><li><p>C/C&#43;&#43; experience</p></li><li><p>Experience with writing or reviewing requirements that follow INCOSE guidelines</p></li><li><p>Coursework and/or some knowledge in operating systems, computer architecture, algorithms, and data structures</p></li><li><p>Working knowledge of real-time operating systems such as Green Hills/Integrity or VxWorks</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$112,070 - $121,992<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Flight-Software-Engineer-II_R4554",
    "jobReqId": "R4554",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 17 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-07-20",
    "timeType": "Full time",
    "title": "Flight Software Engineer II"
  },
  "userAuthenticated": false
}
