{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Resource-Analyst_R4165",
    "id": "e69c71fb5b7e10015e6847b7196e0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Institutional Business Operations Office (IBOO) is seeking a candidate who will provide cost control, planning, reporting, and analysis in a cross functional environment.  The successful candidate will work as a Project Resource Analyst (PRA) and must possess effective communication, analysis, and teamwork skills. This must be an individual who knows how to exercise excellent judgement. In this role, you will partner with other IBOO team members as well as possess ownership over specific responsibilities. Examples of Resource Analyst responsibilities include, but are not limited to: </p><ul><li><p>Serve as the JPL Point of Contact (POC) to NASA HQ for R&amp;A reporting.  </p></li><li><p>Support the lab wide 533 reporting to NASA HQ and function as the key POC.</p></li><li><p>Develop the financial position relative to Institutional deliverables for the Institutional Business Forecast, NF533, Cost Phasing, and monthly/quarterly reviews. </p></li><li><p>Conduct in-depth performance analysis, including budget/forecast to actuals, variance analysis, and workforce.</p></li><li><p>Support Annual Mission IT Data Call and Research Data Call.</p></li><li><p>Responsible for the management of the Division 25 website.</p></li><li><p>Provide back-up support as the Division 25 website administrator, telecons with the NASA HQ, and Planning, Programming, Budgeting, and Execution (PPBE) communications.</p></li></ul><p></p><p>A successful candidate will have the following experience and skills:</p><ul><li><p>Typically requires a Bachelor degree in Business Administration or similar discipline with a minimum of 6 years of related experience; Master degree in similar discipline with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years related experience.</p></li><li><p>Demonstrated experience in leading the implementation of resource planning, control activities in a complex environment</p></li><li><p>Wide-ranging experience with financial planning and analysis</p></li><li><p>Experience in interpreting and carrying out policies, processes, and procedures.</p></li><li><p>Must be resourceful and self-motivated with excellent verbal and written communication skills.</p></li><li><p>Demonstrated ability to work on critical, often self-initiated, assignments under only consultative direction, typically exercising considerable judgement and discretion.</p></li><li><p>Expert user of Microsoft Office (Excel, Word, and PowerPoint)</p></li><li><p>Demonstrated ability to manage competing priorities</p></li><li><p>Experience interfacing effectively with all levels of laboratory management, organizations, peers, and the sponsor.</p></li></ul><p></p><p><b>Preferred Qualifications:</b></p><ul><li><p>Previous experience in a team environment with reporting, cost, and workforce planning.</p></li><li><p>Experience with cost-schedule baseline change control processes. Prior experience with Cobra, Work Definition, IBT, Data Extractor, and/or OBIEE.</p></li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$101,192 - $116,584<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Resource-Analyst_R4165",
    "jobReqId": "R4165",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 4 Days Ago",
    "startDate": "2023-03-29",
    "timeType": "Full time",
    "title": "Resource Analyst III"
  },
  "userAuthenticated": false
}
