{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Dynamics-Environments-Engineer-Level-III_R4634",
    "id": "cae64fcd52b11001d1a2e97ed9ff0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the <b>Mechanical Systems Engineering, Fabrication and Test Division</b> which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breadth of mechanical disciplines and is applied from architectural concept development through operations.  </p><p></p><p>As a <b><i>Dynamics Environments Engineer III</i></b>, you will be a member of JPL’s <b>Spacecraft Mechanical Engineering Section 352</b> reporting administratively to the Technical Group Supervisor for the Dynamics Environments &amp; Aerospace Nuclear Safety Engineering Group. You would work with a team leading the development of mission enabling technology and end-to-end mechanical systems for JPL projects and missions. You would support projects as large as the Mars Sample Return Sample Retrieval Lander and Capture Containment and Return System, as well instruments and CubeSats.</p><p><b><i>Section 352</i></b><i> creates innovative, technically excellent products in an inclusive team environment that offer creative and novel solutions for JPL’s boldest missions.</i></p><p>We value diverse skills, perspectives, and experiences. Your qualification could add tremendous value to our team. We also provide industry-leading flexibility for partial telework accommodations contingent on project requirements.</p><p></p><p>In this role you would:</p><ul><li><p>Work independently as a Dynamics Environments Engineer in the Dynamics Environments &amp; Aerospace Nuclear Safety Engineering Group, and under the direction of the group supervisor, project management, technical leads, and proposal managers as required</p></li><li><p>Provide sustained support as a lead and/or support engineer for a multiple flight projects or instruments in the requirements derivation and verification of <span>assembly</span> and component for dynamic environments</p></li><li><p>Develop and perform finite element, boundary element, and statistical energy models and analyses</p></li><li><p>Generate formal documentation related to dynamic environments requirements, such as analysis reports, test plans and test reports</p></li></ul><ul><li><p>Plan, conduct and support dynamics testing (random and sine vibration, sine burst, acoustic and shock) of spacecraft, instruments, subsystems and components, including engagement in pre- and post-test activities, meetings and reviews</p></li><li><p>Collaborate with cognizant engineers, subject matter experts, contractors, and other internal/external stakeholders to develop and verify compliance with requirements</p></li><li><p>Contribute effectively to the team’s performance including executing technical work, budget and schedule through all project phases</p></li><li><p>Participate in mentorship and contribute towards lessons learned and technical best practices</p></li></ul><p></p><p><b><u>Required Skills:</u></b></p><ul><li><p>Bachelor’s degree in Mechanical Engineering, Aerospace Engineering, Civil Engineering or related technical discipline with a minimum of 6 years of related experience; or Masters degree in similar disciplines with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 year related experience.</p></li><li><p>Extensive expertise with finite element, boundary element, and statistical energy analysis for flight projects and/or technology tasks and/or proposal developments.</p></li><li><p>Extensive experience with pre-test analysis, test conduct, and documentation for hardware dynamic testing.</p></li><li><p>Advanced knowledge of verification requirements for structural analyses combined with experience performing spacecraft or instrument level dynamic testing</p></li><li><p>Strong ability to work <span>multiple tasks, and adept at communicating with multiple interfaces</span></p></li><li><p>Proven ability to work independent or in a team environment with internal and external stakeholders</p></li><li><p>Good communication (oral, written, presentation), interpersonal, negotiation and organizational skills.</p></li></ul><p></p><p><b><u>Desired Skills:</u></b></p><ul><li><p>Proficient with FEMAP, MATLAB, Nastran, VAOne, and classical hand analyses</p></li><li><p>Experience with finite element model development.</p></li><li><p>Experience with structural measurements, including data acquisition and digital signal processing.</p></li><li><p>Experience with structural, stress, and coupled loads analysis, and rigid body dynamics.</p></li><li><p>Familiarity with JPL and NASA policies and procedures, and government regulations for a range of applications.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$115,336 - $141,544<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Dynamics-Environments-Engineer-Level-III_R4634",
    "jobReqId": "R4634",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 16 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-03",
    "timeType": "Full time",
    "title": "Dynamics Environments Engineer Level III"
  },
  "userAuthenticated": false
}
