{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Engineering-Applications-Software-Engineer-IV_R4493",
    "id": "731ce68d6c0b10011cf56bd2ae990000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Mission Design and Navigation Section (Section 392) within JPL consist of multidisciplinary teams of engineers and technologists who provide expertise across the domains of astrodynamics, statistical orbit determination, spacecraft maneuvers, and astrodynamics software.</p><p></p><p>We are responsible for:</p><ul><li>Developing the ephemerides and orientation models for the natural bodies of the solar system.</li><li>Designing mission trajectories in support of science and engineering objectives.</li><li>Performing statistical orbit determination and maneuver design for interplanetary and near-earth missions.</li><li>Developing and maintaining the scientific engineering software to support these activities and distribute the geometric engineering data and models in support of the world-wide planetary science community.</li></ul><p></p><p>Our engineering teams build and operate high performance astrodynamics software for managing the flight of spacecraft in support of science discovery, research, operations, and applications. They support JPL and NASA missions, as well as other science-based projects. Our research and technology development teams create new onboard and ground-based technologies for trajectory analysis, modeling, visualization, management, access and analytics essential to JPL’s and NASA’s planetary science programs.</p><p></p><p>The Mission Design and Navigation Software Group (392P) is seeking a science and engineering software developer to extend and maintain the computing tools that are essential for the Mission Design and Navigation Section’s role in the design and navigation of NASA’s planetary science missions.</p><p></p><p><b><u>Job Responsibilities</u></b><b>:</b></p><ul><li>Will be a member of the Mission Design and Navigation Software group and report to the Technical Group Supervisor.</li><li>Will work on the implementation of capabilities that extend the Monte software system and/or the Autonomous Flight Navigation and Maneuver system.</li><li>Lead development in targeted applications.</li><li>Work collaboratively with members of the Mission Design and Navigation Software Group as well as subject matter experts and analysts from across the Mission Design and Navigation section.</li></ul><p></p><p><b><u>Required Skills/Qualifications</u></b><b>:</b></p><ul><li>Bachelor’s degree with 9 years of experience, masters with 7 years of experience, or Ph. D. with 5 years of experience in Astrodynamics, Mathematics, Physics, Computer Science or related discipline.</li><li>Expertise in one or more object-oriented programming languages and experience in developing object-oriented software.</li><li>Proficiency in C&#43;&#43; and Python</li><li>Wide ranging experience in one or more of the following disciplines: numerical analysis, network programming, database design, software architectures, astrodynamics, computer graphics, graphical user interface design</li><li>Familiarity with modern software development methodologies, tools, and industry best practices.</li><li>Excellent written communication skills</li></ul><p></p><p><b><u>Desired Skills/Qualifications</u></b><b>:</b></p><ul><li>Expert proficiency in C&#43;&#43; and Python</li><li>Knowledge of Numerical Analysis, Optimization, Numerical Integration, Estimation, Astrodynamics</li><li>Strong presentation and interpersonal skills.</li><li>Knowledge of JPL’s policies and practices relating to software and software development</li><li>Familiarity with Agile and DevOps development models</li><li>Familiarity with the SPICE software system</li><li>Familiarity with CMMI process models.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$151,216 - $188,968<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Engineering-Applications-Software-Engineer-IV_R4493",
    "jobReqId": "R4493",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 3 Days Ago",
    "startDate": "2023-06-27",
    "timeType": "Full time",
    "title": "Engineering Applications Software Engineer IV"
  },
  "userAuthenticated": false
}
