{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Dining-Services-and-JPL-Store-Liaison_R4195",
    "id": "b958ef6f88d51001be021a5447e40000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><div><p><span>In this role, you will be a member of the Facilities and Logistics Division and will report to the Division Manager. You will be responsible for leading the dining services contract at the laboratory and ensuring compliance with applicable NASA Procedural Requirements. The dining contract includes cafeteria service, on-site catering, and employee store operations. This position will be the primary point of contact with outside public agencies with respect to health inspections and food service audits. The ideal candidate with have extensive experience in the food and retail service industry.</span></p><p></p></div><div><div><div><div><p>Required Skills</p><ul><li><p>Fully understand the California Retail Food Code and ensure compliance of the Code <a href=\"https://www.cdph.ca.gov/Programs/CEH/DFDCS/CDPH%20Document%20Library/FDB/FoodSafetyProgram/RetailFood/CRFC.pdf\" target=\"_blank\"><span>https://www.cdph.ca.gov/Programs/CEH/DFDCS/CDPH%20Document%20Library/FDB/FoodSafetyProgram/RetailFood/CRFC.pdf</span></a></p></li><li><p>Fully understand the FDA Code and ensure compliance of the Code <a href=\"https://www.fda.gov/food/retail-food-protection/fda-food-code\" target=\"_blank\"><span>https://www.fda.gov/food/retail-food-protection/fda-food-code</span></a></p></li><li><p>Responsible for leading the Eurest contract requirements</p></li><li><p> Fully understand NPR 1800.1E.4.12 and ensure compliance with the NPR</p></li><li><p> <u>Be the primary point of contact for the LA County Health Department.  Coordinate and participate in the Quarterly LA County Health Inspections </u></p></li><li><p> Using extensive knowledge of corporate dining and catering operations, oversee the Laboratory’s dining and catering operations</p></li><li><p> Using extensive knowledge of food service equipment and smallwares, inventory and purchase items as required</p></li><li><p>Fully understand the NASA OCHMO audit requirement and process and participate as the lead for dining services</p></li><li><p>Fully understand the role of a CTM and act as the CTM for the dining services contract.</p></li><li><p>Develop creative, practical solutions for the continued improvement of JPL dining and store operations</p></li><li><p>Understand industry food service contracts and provide guidance to Acquisitions on development of RFI and RFP</p></li><li><p>Understanding different system tools and software relating to food service and sales</p></li></ul><p></p><p>Contract Compliance</p><ul><li><p>Eurest Monthly financial review</p></li><li><p>Eurest Quarterly Business review</p></li><li><p>Review Eurest training records</p></li><li><p>Review and participate in third party audits</p></li><li><p>Review monthly manager audits</p></li><li><p>Ensure CRFL, FDA requirements are met every day</p></li><li><p>Work with Acquisitions on contract issues and updates</p></li><li><p>Participate in LA County Public Health audits</p></li><li><p>Review Café price adjustments as needed</p></li></ul><p></p><p>High Level Responsibilities</p><ul><li><p>Support Eurest team to provide the JPL community with excellent quality, safe, food, merchandise and customer service. Act as a liaison to meet these goals and standards</p></li><li><p>Provide guidance and direction to Eurest team on JPL expectations</p></li><li><p>Work with Acquisitions to source and purchase all food service equipment and smallwares for the Cafés and JPL Store</p></li><li><p>Support the onboarding process for Eurest employees</p></li><li><p>Trouble shoot any and all service and quality issues</p></li><li><p>Work with PSD on any issues that may arise. Support team with onboarding, service and visitor requests</p></li><li><p>Know who to call to get answers</p></li><li><p>Coordinate all large special events such at Explore JPL, Family Days etc</p></li><li><p>Provide operational and financial information to senior leadership as requested</p></li><li><p>Work with Facilities IT support to ensure all POS software and hardware are working and up to date with the latest hardware and software. Act as a liaison between MICROS, JPL and Eurest to ensure POS is operating efficiently.</p></li><li><p>Attend special interest group meetings such as Green Club, Vegan Club meetings</p></li></ul><p></p><p>Safety</p><ul><li><p>Ensure operations are safe and that Eurest is maintaining safe practices</p></li><li><p>Work with OSPO on all safety related issue ie: food safety, customer complaints, facility safety</p></li><li><p>Troubleshoot any safety issues and ensure they are resolved in a timely manner</p></li><li><p>Attend Quarterly OCHMO Food Safety Working Group meeting</p></li><li><p>Correspond with NASA Headquarters, OCHMO Food Safety representatives</p></li><li><p>Attend Quarterly FWSG (NASA Food Service Working Group) meetings</p></li></ul><p></p><p></p><p>Customer Comments</p><ul><li><p>Field customer <span>comments/complaints/requests</span> with Eurest staff and develop next steps in resolving requests/issues. Connect with customers on plans of action</p></li></ul><p></p><p>Catering</p><ul><li><p>Work closely with 9th floor to coordinate all on Lab catering events for Director Office</p></li><li><p>Run catering website</p></li><li><p>Verify cost allowability of all catering events using JPL funds</p></li><li><p>Approved all catered event through catering website <a href=\"https://catering.jpl.nasa.gov/\" target=\"_blank\"><span>https://catering.jpl.nasa.gov/</span></a></p></li><li><p>Work with Eurest staff to ensure that deliveries and pick-ups are made in a timely order</p></li><li><p>Coordinate real time catering changes daily</p></li><li><p>Work and advise catering customers on menus, quantities, set up and delivery of catering events</p></li><li><p>Edit and update catering website ensure accurate billing</p></li><li><p>Review weekly catering billing via Markview</p></li><li><p>Coordinate all rentals for catering and special events. Decide layout, set up and design.</p></li><li><p>Lead set up, service standards, time lines and breakdown of all catering for special events</p></li><li><p>Coordinate after hours meals and snack as requested to projects</p></li><li><p>Work on all large special event such at Explore JPL, Family Days, Launches, Landing, project landmark events etc.</p></li><li><p>Train JPL employees using JPL funds for catering on allowability and how to use TCUP</p></li></ul><p></p><p>Facilities and Maintenance</p><ul><li><p>Call in Trouble call for all dining services activities as needed</p></li><li><p>Submit FSR’s for Facilities requirements as needed</p></li><li><p>Coordinate any janitorial as needed</p></li><li><p>Coordinate all transportation needs for Café and catering as needed</p></li><li><p>Coordinate all after hours activities with PSD</p></li><li><p>Ensure all PMs are conducted on Café equipment</p></li><li><p>Coordinate installation of new equipment</p></li><li><p>Coordinate all equipment to be excessed</p></li></ul><p></p><p>Communications</p><ul><li><p>Coordinate with 18X all communications for Dining Services, the JPL Store and catering on JPL Space, The café monitors, Slack and all other media outlets</p></li><li><p>Work with 18X on special event coordination</p></li><li><p>Update Division 28 Dining services webpage</p></li><li><p>Ensure JPL search information is up to date and accurate</p></li><li><p>Respond to customers on Slack as appropriate</p></li></ul><p></p><p>JPL Store</p><ul><li><p>Work with JPL projects and 18x on all project merchandise ordered through the JPL Store. This includes brand compliance, delivery and quality assurance</p></li><li><p>Collaborate with project teams to create mission merchandise for team and for sale at the JPL Store</p></li><li><p>Coordinate all Director’s office purchased from The JPL Store</p></li></ul><p></p><p>Vending machines</p><ul><li><p>Coordinate types, numbers, locations communication related to food vending machines on Lab</p></li><li><p>Handle customer complaints and requests as needed</p></li></ul><p></p><p>Professional Development</p><ul><li><p>Attend industry conferences to stay current on Industry food, service, catering, safety and sustainability trends</p></li><li><p>Conduct periodic site visits of other similar facilities to learn standard processes</p></li></ul></div></div></div></div><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$99,944 - $125,008<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Dining-Services-and-JPL-Store-Liaison_R4195",
    "jobReqId": "R4195",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 2 Days Ago",
    "startDate": "2023-04-06",
    "timeType": "Full time",
    "title": "Dining Services and JPL Store Liaison"
  },
  "userAuthenticated": false
}
