{
  "jobPostingInfo": {
    "id": "d354008c57170101e9f9802e9d7f0000",
    "title": "Project Schedule Controls, Group Supervisor",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As a Project Schedule Controls Group Supervisor (252L) in the Project Controls Section (252) you will report to the Assistant Section Manager responsible for Scheduling. You will lead a team of schedule analysts, identify training needs, assign work, assess performance, implement process improvements, set goals and measure achievements, manage salaries, guiding personnel career growth opportunities, help to generate/update standard processes, and improve standardization of products. This is a great opportunity for individuals with people leadership skills! Together we can help develop the leaders of JPL&#39;s future!</p><p></p><p><u>Responsibilities</u></p><p></p><p>As a Project Schedule Controls Group Supervisor, you will:</p><ul><li><p>Lead a team of schedulers to support project needs.</p><ul><li><p>Provide training, mentoring, and personnel development for direct reports in the group.</p></li><li><p>Implementation of a quality control plan for scheduling processes, practices, and products, including a schedule peer review process at appropriate lifecycle reviews.</p></li></ul></li><li><p>Participate in the implementation of the Section’s goals and objectives.</p></li><li><p>Perform scheduling strategic planning, develop tactical plans, and prepare for the future.</p></li><li><p>Manage and provide leadership to advance the scheduling proficiency within JPL.</p><ul><li><p>Support the Section in establishing official and standard scheduling processes and procedures.</p></li><li><p>Continually improve our processes and procedures in order to ensure being on the forefront of scheduling capabilities and products.</p></li><li><p>Identify schedule discipline training requirements and provide training direction that advances the scheduling processes, tools and capabilities of the group.</p></li></ul></li><li><p>Advise and provide recommendations on hiring decisions, promotions, salary changes, skills and development training, performance appraisals, and layoffs.</p><ul><li><p>Support the implementation of attracting, developing, and retaining a diverse, highly qualified staff.</p></li><li><p>Work with Technical Managers, Business Operations Managers, and Project Business Managers to determine current and future needs.</p></li><li><p>Support Section Management with short term and long-term workforce forecasts.</p></li><li><p>Support and implement the Section’s recruitment and retention strategies.</p></li><li><p>Support and establish a career path development plan for the schedulers in the group.</p></li></ul></li><li><p>Gather schedule lessons learned and successes to be shared across projects for efficiency and to potentially resolve similar needs or problems.</p></li><li><p>Lead by example through participating on Institutional teams and supporting critical business initiatives.</p></li><li><p>Develop and maintain effective working relationships across the JPL business community.</p></li><li><p>Maintain a safe working environment for employees.</p></li></ul><ul><li><p>Foster and model JPL’s Leadership Capabilities.</p></li><li><p>Be willing to fulfill a different assignment based on the needs of PBMD and the Institution.</p></li></ul><p></p><p><u>Qualifications</u></p><p></p><p>Typically requires a Bachelors degree in Business Administration, Finance, Accounting, Economics, or related field with 9 years of related experience; Master’s degree 7 years of experience; or PhD with a minimum of 5 years related experience. Minimum of 2 years of leadership experience.</p><ul><li><p>Proven leadership skills and demonstrated ability to develop, motivate, mentor, and maintain an impactful team in a leadership role.</p></li><li><p>Strong leadership ability and proficiency in decision making and delegation, personnel management, attentive listening, communication, time management, problem solving, conflict resolution, ability to prioritize and strategic leadership.</p></li><li><p>Sustained successful performance as a scheduler on sophisticated technical developments.</p></li><li><p>Experience implementing scheduling throughout the lifecycle of project.</p></li><li><p>Demonstrated schedule domain credibility within, program/project management, and external customers.</p></li><li><p>Working knowledge of the JPL matrix organizational structure and its policies and procedures.</p></li><li><p>Effective communication skills in verbal, written, and presentation forms.</p></li><li><p>Demonstrated ability to anticipate and mitigate complex managerial problems.</p></li><li><p>Detailed knowledge of Laboratory policies and procedures, applicable prime contract requirements, NASA procedural requirements, and government regulations across a range of applications.</p></li><li><p>Broad, multidisciplinary knowledge and extensive experience in managing schedule planning, forecasting, analysis, performance measurement, assessment and reporting.</p></li></ul><p></p><p><u>Preferred Qualifications</u></p><ul><li><p>Experience in leading and providing consultation to team regarding integrated cost-schedule planning, baseline planning, EVM, and various performance measurement techniques.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$127,920 - $160,784<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 12 Days Ago",
    "startDate": "2023-03-07",
    "timeType": "Full time",
    "jobReqId": "R1452",
    "jobPostingId": "Group-Supervisor_R1452",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Group-Supervisor_R1452"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
