{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Head-of-Information-and-Technology-Solutions_R4660",
    "id": "7b80074bcd971001763492adc9db0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Your Responsibilities</b></p><ul><li><p>Develop and execute an IT operations process that leverages the JPL IT strategy to its fullest potential.</p></li><li><p>Provide direct leadership to the IT organization, which includes multiple people leaders, process and execution roles, and business and analytics functions.</p></li><li><p>Ensure day to day management of all aspects of a high capacity and fast paced IT function to support JPL employees, affiliates, and other partners with computing, and software, compliance, and IT systems and hardware support.</p></li><li><p>Understand the policies and requirements of the Laboratory’s unique role as NASA’s FFRDC, and how you support our agile and innovative culture.</p></li><li><p>Understand the requirements of a hybrid work model and have a demonstrated ability to support this model through IT solutions.</p></li><li><p>Work with accountable organizations to ensure the Laboratory’s information systems are compliant with all standards and requirements set forth in the Prime Contract with NASA and other applicable regulatory agencies.</p></li><li><p>Partner with stakeholders to effectively manage budgetary requirements regarding IT operations.</p></li><li><p>Partner with the IT leaders/teams, Mission/Project, Engineering and Science, Business, and HR to understand relevant IT requirements, and to develop those requirements into an integrated and prioritized JPL IT operational plan.</p></li><li><p>Support innovation by being a visible champion and leader for laboratory infrastructure modernization, to significantly improve user work experiences (e.g., reduce tool duplication and complexities, increase process automation, enable data and system integration, etc.).</p></li><li><p>Implement actions, in partnership with the CDIO and key stakeholders, that increase the value extracted from information technology through the reuse of data, software, tools, and capabilities across JPL.</p></li><li><p>Create an effective operational plan to execute on innovative information technology capabilities for engineering, missions, and science to help keep JPL at the forefront of technology and science.</p></li><li><p>Establish partnerships with organizations across JPL to create, adopt, adapt and infuse information technology. Participate in cross-functional teams as appropriate to determine needs and create operational solutions to support.</p></li><li><p>Partner with cyber-security to coordinate policies, requirements, and their implementation.</p></li><li><p>Use data and results to provide management with insights and recommendations, as well as execution and action plans.</p></li><li><p>Ensure positive working relationships between the IT team and internal and external stakeholders. Assess satisfaction and monitor and refine service level agreements with key stakeholders as needed.</p></li></ul><p></p><p><b>The First Year</b></p><ul><li><p>Understand and build appreciation for JPL’s culture and mission</p></li><li><p>Develop an operational roadmap for IT solutions implementation – including mission support</p></li><li><p>Work with Lab leadership and functional teams to support ongoing IT enhancement projects</p></li><li><p>Participate in the planning process to prioritize and manage the investment planning for JPL’s federated IT, software, data, and advanced computing enterprise</p></li><li><p>Build effective and collaborative relationships with internal and external stakeholders, as appropriate</p></li><li><p>Focus on critical skills, retention, and recruitment of talent to support the strategic plan and roadmap for JPL IT functions within IT</p></li><li><p>Implement analytics, metrics, and management dashboards</p></li><li><p>Turn data into insights</p></li></ul><p></p><p><b>Qualifications &#43; Success Factors</b></p><ul><li><p>Master’s degree with 12&#43; years of management experience including successful leadership of an organization of similar complexity</p></li><li><p>Technical expertise – a thorough understanding of IT, software, advanced computing, and associated architectures</p></li><li><p>Operational expertise – ability to translate a vision and strategy into an effective operating model</p></li><li><p>Demonstrated ability to lead and mentor staff in a team environment where collaboration, engagement, and knowledge transfer are critical</p></li><li><p>Inclusive management with influencing skills and experience that demonstrates an ability to effect change</p></li><li><p>Experience building strong partnerships, both inside and outside the organization</p></li><li><p>Demonstrated ability to interact with senior executives and to influence decisions</p></li><li><p>Flexibility, adaptability, and tenacity with the ability to meet deadlines, prioritize demands, and effect creative problem solving</p></li><li><p>In-depth experience in developing and managing a highly skilled workforce; with a knowledge of affiliate and contract workforce requirements</p></li><li><p>Robust analytical capabilities with the ability to support decisions and strategy with facts and data</p></li><li><p>Excellent communication skills - written, verbal, and presentation</p></li><li><p><b>The selected candidate must be willing and able to obtain a security clearance</b></p></li><li><p><b>Ability to work hybrid schedule on lab (Pasadena, CA)</b></p></li></ul><p></p><p><b>Preferred Qualifications</b></p><ul><li><p>Experience working within an engineering and/or science community and culture</p></li><li><p>Background working with the federal government in a research environment</p></li><li><p>Demonstrated ability to create a culture of innovation across an organization</p></li><li><p>Proven experience driving new ideas, technologies and capabilities</p></li><li><p>Demonstrated collaborations with different external organizations – industry, academia, government, international</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$241,384 - $316,368<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Head-of-Information-and-Technology-Solutions_R4660",
    "jobReqId": "R4660",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 20 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-09",
    "timeType": "Full time",
    "title": "Head of Information and Technology Solutions"
  },
  "userAuthenticated": false
}
