{
  "jobPostingInfo": {
    "id": "eef8fbb385b410016db628218b480000",
    "title": "Cost Engineer lll",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Responsibilities:<br /><br />In this role at JPL you will enable mission success by developing credible early-lifecycle cost estimates using relevant historical data from JPL projects and a variety of cost estimation toolsets.  The Engineering Cost Estimation group uses analogous, parametric, and grassroots methods to create competitive mission proposals, support key technical trades, and help decision-makers strategize the future of robotic space exploration. </p><p></p><p>A typical cost engineering assignment focuses on project formulation, independent assessment, or cost data archiving.  Cost engineers frequently work on several assignments at any given time, and there is significant knowledge overlap among these three types of assignments.  As a Cost Engineer III, you are expected to work independently with general guidance and expectations from management.</p><p></p><p>You will be able to work on complex missions that require expert guidance for the selection and implementation of various cost estimation methods and products.  </p><p>Primary responsibilities include;</p><ul><li><b><span>Capture cost, schedule, and technical performance parameters for JPL projects at key milestones (e.g., NASA Cost Analysis Data Requirement records)</span></b></li><li><b><span>Partner with technical and business experts to develop early formulation cost estimates and cost risk analysis </span></b></li><li>Lead and support independent cost and schedule assessments of ongoing JPL projects in order to ensure compliance with NASA business requirements</li><li>Learn, maintain, and develop innovative uses of cost estimation tools</li></ul><p><br /><b><u><span>Qualifications</span></u></b></p><ul><li>Typically requires a Bachelor’s degree in Business, Engineering, or related field with a minimum of 6 years of related experience; Masters degree in similar disciplines with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years of related experience</li><li><b><span>Demonstrated experience in one or more of the following areas: cost estimation, mission concept development, historical data mining and analysis, cost/schedule analysis, risk analysis, or proposal development</span></b></li><li>In-depth understanding of the concepts and application of grassroots estimation, analogy-based estimation, and parametric estimation in early formulation</li><li><b><span>Preferred Qualifications:</span></b></li><li>Experience in NASA cost estimation, project formulation, and/or project assessment</li><li>Experience working with multi-disciplinary teams, especially teams including business, engineering, and management roles</li><li>Experience working on a range of project types and valuations - Ability to guide teams and make independent decisions in terms of cost estimation processes</li><li>Advanced knowledge of Microsoft Excel, especially VBA development, advanced functions, pivot tables, goal seek, and scenario development</li><li>Experience with PRICE TruePlanning, SEER, PCEC, NICM, SSCM, and other civil space cost estimation toolsets</li><li>Experience with ProPricer</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$96,720 - $117,416<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-22",
    "timeType": "Full time",
    "jobReqId": "R2629",
    "jobPostingId": "Cost-Engineer-lll_R2629",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Cost-Engineer-lll_R2629"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Cost Engineer / Programmatic Risk Analyst",
      "externalPath": "/job/JPL-Campus/Cost-Engineer---Programmatic-Risk-Analyst_R1963",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-20"
    }
  ],
  "userAuthenticated": true
}
