{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technologist-II--Water-and-Ecosystems-Group_R4489",
    "id": "731ce68d6c0b1001122e8b8e27b30000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Coasts are highly susceptible to the compounding impacts from climate change and other anthropogenic activity. Climate change is driving increases in the frequency and severity of wildfires, which can significantly alter flows of water, carbon, sediment and other nutrients into nearshore coastal waters. Climate change is also driving sea level rise, increasing the vulnerability of coastal habitats particularly as it relates to saltwater intrusion and storm surge, underscoring the important of adaptation and developing climate resilience. Coastal ecosystems are regions of high productivity and biological diversity and play a critical role in the global carbon cycle.</p><p></p><p>We seek a technologist who will support a variety of research and applications activities that investigate the impacts of wildfires on coastal hydrology and nearshore ecosystems, particularly with respect to the transport of carbon and sediment from land to sea and post fire changes to water cycle budgets. The technologist will also support efforts to link Earth science research, results, and datasets to applications benefits – advancing partnerships in the areas of water resources management, coastal resilience, and acid mine drainage.</p><p></p><p>In this role you will be responsible for the following:</p><p>• Run Soil Water Assessment Tool (SWAT) to model watershed response to wildfires, leveraging a variety of remote sensing and in situ datasets to support calibration / validation of model</p><p>• Support remote sensing-based analysis of ocean color products, focusing on nearshore systems, and the impacts of coastal darkening on kelp ecosystems</p><p>• Support investigation into post-wildfire impacts on regional water balances in coastal California</p><p>• Support partner engagement on topics of wildfires and coastal resilience</p><p>• Support data science and data analysis needs for 329F research and application areas, and other JPL earth science missions include EMIT and ECOSTRESS</p><p>• Participate in regular 329F team meetings</p><p>• Participate in proposal writing opportunities with 329F team members</p><p>• Support collection and analysis of spectral datasets from in situ, airborne, and satellite sources</p><p>• Support other data analysis and code implementation activities in support of 329F projects</p><p>• Run Soil Water Assessment Tool (SWAT) to model watershed response to wildfires, leveraging a variety of remote sensing and in situ datasets to support calibration / validation of model</p><p>• Support remote sensing-based analysis of ocean color products, focusing on nearshore systems, and the impacts of coastal darkening on kelp ecosystems</p><p>• Support investigation into post-wildfire impacts on regional water balances in coastal California • Support partner engagement on topics of wildfires, coastal resilience and other water quality concerns including acid mine drainage</p><p>• Support data science and data analysis needs for 329F research and application areas, and other JPL earth science missions include EMIT and ECOSTRESS</p><p>• Participate in regular 329F team meetings</p><p>• Participate in proposal writing opportunities with 329F team members</p><p>• Support other data analysis and code implementation activities in support of 329F projects</p><p></p><p><b>The following qualifications are required:</b></p><p>• PhD degree in Earth science, geoscience, hydrology, or similar related field</p><p>• Direct experience with SWAT, aquatic remote sensing, marine resources management, marine biogeochemistry, trace metal contaminants</p><p>• Demonstrated problem-solving ability in research and broad range of experimental skills including modeling, remote sensing, laboratory and field studies</p><p>• Demonstrated ability to contribute to winning proposals and grants (ie, NASA)</p><p>• Demonstrated interest in applications, science outreach, and partnership development</p><p>• Experience in leading or conducting field campaigns</p><p>• Excellent oral and written communication skills</p><p>• Experience or interest in Earth science applications</p><p>• A track record of recent contributions to peer-reviewed publications</p><p>• Experience and /or interest in contributing to broader fields of water cycle research, investigating land-sea connectivity, and water resources applications</p><p>• Experience in operating spectral imaging radiometers for field data collection, including downloading and evaluating acquired spectra for water quality analysis</p><p></p><p><b>The following qualification is preferred:</b></p><p><span>• At least two years of related experience in Earth science, geoscience, hydrology, or similar field</span></p><p></p><p><b><span>Complete applications will include a CV, cover letter, and the names and contact information for three references.  Please combine all documents into one PDF. </span></b></p><p><b><span> </span></b></p><p><b><span>Applications received by Friday, July 28, 2023 will receive full consideration. </span></b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$75,608 - $114,816<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Technologist-II--Water-and-Ecosystems-Group_R4489",
    "jobReqId": "R4489",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 28 Days Ago",
    "startDate": "2023-06-27",
    "timeType": "Full time",
    "title": "Technologist II, Water and Ecosystems Group"
  },
  "userAuthenticated": false
}
