{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Administrative-Liaison-II_R4520",
    "id": "e890d213f5861001f7915a399d800000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><div><p><span><span>This outstanding opportunity is part of the </span></span><b><span>Mechanical Systems Engineering, Fabrication and Test Division! </span></b><span>This division<span> engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breath of mechanical fields and is applied from architectural concept development through operations.</span></span><span> </span></p></div><div><p><span> </span></p></div><div><div><p><span><span>As </span><span>an </span></span><span><span>Administrative Liaison II</span><span>, you will be supporting </span><span>the </span></span><b><span>Propulsion</span><span>, Thermal, and Materials Engineering Section</span></b><span><span>, which provides leadership and outstanding world-class expertise in a wide range of technologies and technical field areas of chemical and electrical propulsion, thermal, materials, contamination control, analytical chemistry, geochemical instruments, physics-based modeling, and multiphase flow. </span><span> The Administrative Liaison II</span><span> will</span><span> report to the </span><span>Business Administration Manager (BAM)</span><span>, with </span><span>responsibilities that include, but are not limited to:</span></span><span> </span></p></div><div><p><span> </span></p></div><div><p><u><span>Responsibilities:</span></u><span> </span></p></div><div><p><span> </span></p></div><div><ul><li><p><span><span>Perform moderately sophisticated job functions and activities to assist, coordinate</span><span>,</span><span> and perform aspects of acquisitions, facilities, logistics, safety and property for the </span><span>Electronic Manufacturing, Packaging, &amp; Technical Services Section</span><span>.</span></span><span> </span></p></li></ul></div></div><div><div><ul><li><p><span><span>Implement new Associated Purchase Orders and provide funding for ongoing equipment calibrations and rentals.</span></span><span> </span></p></li><li><p><span><span>Generate standard procurement requisitions, placing orders via P-card and iProcurement with information provided by requestor. Reconcile </span><span>P-card orders</span><span> to validate supplier payment. </span></span><span> </span></p></li><li><p><span><span>Confer with vendors to acquire product or service information such as price, availability, delivery schedule, </span><span>and </span><span>negotiate pricing for one-time items.</span></span><span> </span></p></li><li><p><span><span>Arrange urgent shipment when vital in collaboration with JPL’s logistics group to meet project schedules.</span></span><span> </span></p></li><li><p><span><span>Develop and maintain filing systems sufficient to support procurement policies and procedures.</span></span><span> </span></p></li></ul></div></div><div><div><ul><li><p><span><span>Exercise judgment in planning, coordinating and performing work; supervise performance and report status within area of responsibility. </span></span><span> </span></p></li><li><p><span><span>Assure that</span><span> the</span><span> quality of service meets internal and external customer requirements.</span></span><span> </span></p></li><li><p><span><span>Collaborate with internal and external collaborators to ensure that invoices are approved in a timely fashion.</span></span><span> </span></p></li><li><p><span><span>Maintain, collate, assemble and prepare a variety of information, reports and records; may assist with coordination of organizational projects and/or collection of related information.</span></span><span> </span></p></li><li><p><span><span>Other duties as assigned may include processing requests for office and/or technical facilities and processing paperwork for surplus equipment and missing property. May scan inventory items, perform safety walkthroughs and work with the property or safety representative to ensure property and facilities meets security and safety requirements. Process standard shippers for transporting equipment.</span></span><span> </span></p></li></ul></div></div><div><div><p><span> </span></p></div><div><p><u><span>Qualifications</span><span>:</span></u><span> </span></p></div><div><p><span> </span></p></div><div><ul><li><p><span><span>Typically requires a High School diploma with </span><span>6</span><span> years of </span><span>related</span><span> work experience;</span> </span>Associates with 1 years of related experience and Related required training</p></li><li><p><span><span>Must have moderate understanding, and experience in the following areas: </span><span> </span><span>Business administration, budgeting, computer science, acquisitions</span><span>,</span><span> and </span><span>fi</span><span>nancial planning and analysis</span><span>.</span></span><span> </span></p></li></ul></div></div><div><div><ul><li><p><span><span>Proficient in MS Office Suite (Word, Excel, PowerPoint, Access, Outlook, etc.)</span></span><span> </span></p></li><li><p><span><span>Strong analytical and </span><span>problem</span><span>-solving</span><span> skills with the ability to resolve sophisticated issues</span><span>.</span></span><span> </span></p></li><li><p><span><span>Self-starter with the ability to work both independently and in a team environment</span><span>.</span></span><span> </span></p></li><li><p><span><span>Review and prioritize assignments</span><span>.</span></span><span> </span></p></li><li><p><span><span>Ability to u</span><span>se tact and discretion when working with critical or confidential data</span><span>.</span></span><span> </span></p></li></ul></div></div><div><div><ul><li><p><span><span>Strong customer service, organizational, interpersonal, verbal and written communication skills</span><span>.</span></span><span> </span></p></li><li><p><span><span>Work well with all levels of personnel and provide excellent customer service</span><span>.</span></span><span> </span></p></li></ul></div><div><p><span> </span></p></div><div><p><u><span>Preferred Skills:</span></u><span> </span></p></div><div><p><span> </span></p></div></div><div><div><ul><li><p><span><span>Knowledge of </span><span>Laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications</span><span>.</span></span><span> </span></p></li><li><p><span><span>Experience in tools such as</span><span> Order Release Marketplace,</span><span> </span><span>U</span><span>C</span><span>S</span><span>, </span><span>requisitioning, </span><span>iProcurement, P</span><span>-</span><span>card, and EBIS suite of tools.</span></span><span> </span></p></li><li><p><span><span>Experience l</span><span>earn</span><span>ing </span><span>and apply</span><span>ing</span><span> new Information Technology (IT) tools to office procedures and processes.</span></span><span> </span></p></li></ul></div></div><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$55,952 - $72,800<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Administrative-Liaison-II_R4520",
    "jobReqId": "R4520",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 15 Days Ago",
    "startDate": "2023-07-07",
    "timeType": "Full time",
    "title": "Administrative Liaison II"
  },
  "userAuthenticated": false
}
