{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Postdoc--Assessing-Potential-for-Acid-Rock-Drainage-with-EMIT-Data-and-Use-Case-Development_R4828",
    "id": "9470feecfdae100105c2f480209e0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and on Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and in communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to both contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The Postdoctoral scholars at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</p><p></p><p>The Earth Science Section at JPL seeks an outstanding postdoc researcher. The successful candidate will be a member of JPL’s Water and Ecosystems Group in the Earth Sciences section. The group develops new methods for using remote sensing data to understand the interaction of water and the environment, including contaminant mobilization and transport. This position will be based in at JPL in Pasadena, California.</p><p></p><p>This project will focus on risks of acid mine drainage (AMD) in the western US. AMD results from mining activities, particularly those involving sulfide-rich minerals like pyrite. When exposed to air and water, these minerals generate sulfuric acid that contaminates soil and groundwater. AMD releases highly acidic water into rivers and groundwater, harming aquatic ecosystems by lowering pH levels, rendering it inhospitable for aquatic life. Additionally, AMD often carries toxic heavy metals like lead, cadmium, copper, and zinc, posing risks to both aquatic life and human health through the food chain. In the western United States, where mining is a significant part of the economy, AMD remains a persistent issue, requiring a balance between economic interests and environmental and public health concerns.</p><p>We are seeking a Postdoctoral Researcher to design and implement an applied sciences project focused on mapping areas with the potential for acid rock drainage, applying data from the Earth Surface Mineral Dust Source Investigation (EMIT). The successful candidate will have expertise in visible to shortwave infrared imaging spectroscopy, geochemical contamination, or acid mine waste remediation. This role will involve collaboration with the United States Geological Survey (USGS) and relevant government agencies to contribute to environmental decision-making in.</p><p></p><p>Key Responsibilities:</p><p>Data Analysis and Mapping:</p><ul><li>Use EMIT level 2b mineralogy products to assess the feasibility of spaceborne visible to shortwave infrared imaging spectroscopy data for identifying acid rock drainage potential across the western US.</li><li>Generate detailed maps and reports highlighting areas at risk of acid rock drainage based on spectral analysis.</li></ul><p>Fieldwork and Laboratory Coordination:</p><ul><li>Conduct fieldwork to validate remote sensing data and gather ground-truth information.</li><li>Collaborate with laboratory teams to analyze samples and refine data interpretation.</li></ul><p>Collaboration with USGS:</p><ul><li>Work closely with USGS partners to explore practical applications for mineral leachability maps in prioritizing acid mine waste remediation efforts.</li></ul><p>Establish Working Group:</p><ul><li>Establish and lead a working group that includes representatives from agencies such as the Environmental Protection Agency (EPA), Bureau of Land Management (BLM), and United States Forest Service (USFS) to ensure effective data utilization and decision-making.</li></ul><p></p><p>Required Qualifications:</p><ul><li>Ph.D. in a relevant field, such as geosciences, remote sensing, or environmental science.</li><li>Proven ability to initiate and lead projects independently.</li><li>Excellent communication and teamwork skills for working with interdisciplinary teams and government agencies.</li></ul><p></p><p>Preferred Qualifications (but not required):</p><ul><li>Expertise in visible to shortwave infrared imaging spectroscopy, geochemical contamination, or acid mine waste remediation.</li><li>Strong analytical skills and experience with geospatial data analysis tools and software.</li><li>Fieldwork experience and proficiency in coordinating laboratory analysis.</li><li>Remote sensing experience.</li><li>Proficiency in Python programming.</li><li>Experience in working groups, user needs assessment, or applied sciences.</li></ul><p></p><p>Applicants may be subject to additional program requirements by NASA. Postdoctoral Scholar positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years. Candidates should submit the following to this site: CV, representative publications, contact information for three references, and a cover letter stating their research accomplishments and interests.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$82,180 - $82,180<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Postdoc--Assessing-Potential-for-Acid-Rock-Drainage-with-EMIT-Data-and-Use-Case-Development_R4828",
    "jobReqId": "R4828",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 26 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-10-17",
    "timeType": "Full time",
    "title": "Postdoc: Assessing Potential for Acid Rock Drainage with EMIT Data and Use Case Development"
  },
  "userAuthenticated": false
}
