{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-IV--Psyche-_R4600",
    "id": "db763f83b2ba100150b70791acd50000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p></p><p>If you are passionate about spacecraft design, we invite you to join the <b>System V&amp;V, Integration, Test, &amp; Launch Engineering Section</b>. We provide the systems engineering relating to V&amp;V, System Testbeds, ATLO, and Launch Systems Engineering for the laboratory’s key flight projects. Our efforts span the entire implementation lifecycle, and include both leadership and execution roles in these key disciplines.</p><p></p><p>We are seeking a highly motivated and experienced engineering <b>Systems Engineer IV</b> to serve as the <b>Project Flight Director and Deputy Cruise Phase Lead</b> for the <b>Psyche Project</b>. You will report to the Group Supervisor for the System Verification and Validation Engineering Group and serve the Integrated Psyche Systems Engineer as your primary technical stakeholder. Your primary responsibility will be to conduct cruise phase validation exercises and mission operations of the Psyche Project during launch and initial checkout activities.</p><p></p><p>You will work independently and within a team environment, collaborating on tasks performed across a spectrum of disciplines and have excellent writing and oral presentation skills.</p><p></p><p><b>Tasks may include but not limited to:</b></p><ul><li><p>Track, manage, and report progress of Cruise Phase verification &amp; validation activities and requirements closeout to institutional and project management, and at major reviews, </p></li><li><p>Lead the development of Cruise Phase V&amp;V products and activities; plan and execute V&amp;V reviews and audits, and lead the closure of V&amp;V activities</p></li><li><p>Plan for and lead Cruise Phase V&amp;V activities that may be deferred post-launch</p></li><li><p>Lead the flight control team in the Mission Support Area</p></li><li><p>Be responsible for safe operation of the spacecraft and execution of activities approved by Mission Manager</p></li><li><p>Lead real-time operations and collect status from subsystem flight controllers and the navigation team to enable real-time decisions on conduct of activities &amp; anomaly resolution</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in Engineering, Physics, or related technical discipline with a minimum of 9 years of professional work experience, or Master’s degree with a minimum of 7 years of professional work experience, or Ph.D. with a minimum of 5 years of professional work experience.</p></li><li><p>System V&amp;V or I&amp;T experience with flight projects during spacecraft assembly, integration, test and launch preparations (Phase C/D).</p></li><li><p>Operations experience with flight projects during launch and cruise operations (Phase E).</p></li><li><p>Significant knowledge of mission scenario development and use in mission scenario testing.</p></li><li><p>Significant knowledge of the function and operation of spacecraft systems and subsystems.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Demonstrated subject matter expert at the group level or higher in Systems Engineering or V&amp;V.</p></li><li><p>Proven ability to lead the activities of and to synthesize the unique discipline knowledge of a broad range of technical subject matter experts.</p></li><li><p>Experience leading tasks and coordinating working groups on large-scale projects in system development, test, and/or operations.</p></li><li><p>Familiarity with operations uplink processes and downlink analysis</p></li><li><p>Experience in recovering a spacecraft after an anomaly</p></li><li><p>Experience in leading a flight team through operations conducted real-time in the MSA</p></li><li><p>Experience operating electric propulsion missions</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$143,312 - $183,248<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Systems-Engineer-IV--Psyche-_R4600",
    "jobReqId": "R4600",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 3 Days Ago",
    "startDate": "2023-07-27",
    "timeType": "Full time",
    "title": "Systems Engineer IV (Psyche Project Flight Director and Deputy Cruise Phase Lead)"
  },
  "userAuthenticated": false
}
