{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Robotics-Technologist-II_R4120",
    "id": "32bbf743df711001fe1739a7c1300000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL. Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p><b>Opportunity:</b> To work with an enthusiastic multi-disciplinary workforce that originates and executes robotics technology development and space flight projects for terrestrial and planetary exploration applications. This role is focused on supporting and leading the development of robotic systems for the Mobility and Robotic Systems section at JPL. The Robotics Modeling and Simulation Group provides engineering and technology leadership within JPL in the development of component, sub-systems, and system-level models for simulation of autonomy of complex dynamic systems relevant to JPL missions which include: concept, design, implementation, deployment, testing, and operation, and encompasses expertise in all aspects of integrated modeling and simulation. As part of the Robotics Modeling and Simulation Group, this role will be supporting various projects: distributed robotics applications such as CADRE and EELS; development of M&amp;S technologies for possible future missions such as for comet sample return, Venus balloons, and Ocean Worlds; and support development of advanced models, simulations, and analysis for multiple NASA and non-NASA customers. </p><p></p><p>Responsibilities:</p><ul><li>Standard duties for these projects include modeling and simulation development, engineering analyses, developing, testing, and implementing vehicle dynamics models, software development, and proposals for future planetary mission activities.</li><li>Candidate will support one or more technology development or flight projects. These projects will span research systems for NASA and non-NASA sponsors as well as NASA missions destined for space.</li><li>The roles could include robotic system concept development, publication of novel concepts, and proposal writing for NASA and non-NASA programs.</li><li>You may be working at the individual level with some oversite, as a part of a larger team, or leading a small technical team.</li></ul><p></p><p>What it takes:</p><ul><li>Completed M.S. or Ph.D. degree in Aerospace, Electrical, or Mechanical Engineering, Computer Science, or Applied Mathematics.</li><li>Candidate needs to be experienced in 3D visualization software development using three.js or OpenGL, and/or in photorealistic images using Blender.</li><li>Knowledge and expertise in one or more of the following areas: spacecraft engineering, terrestrial and planetary robotics, multibody dynamics, structural mechanics, computational methods, mechanics of materials, dynamics and vibration, continuum and discrete-element mechanics, control and estimation, machine learning.</li><li>Knowledge and experience with Matlab, Python, C&#43;&#43; programming is highly desirable.</li></ul><p></p><p>What would help:</p><ul><li>Demonstrated innovation, initiative, and leadership.</li><li>System engineering and software integration experience</li><li>Working experience in one or more of the following areas: Space Systems, Robotics Systems/Subsystems, Mechanisms, Mechatronics, Perception, Motion Planning, Manipulation, and Robot Navigation/Controls/Operations.</li><li>General knowledge of applicable industry and/or academic practices and standards in engineering theoretical and experimental analyses, mathematical modeling and numerical simulation. </li><li>Knowledge and experience with CAD and robotic system simulation software such as ADAMS, Chrono::Engine, ROS.</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$109,408 - $139,672<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Robotics-Technologist-II_R4120",
    "jobReqId": "R4120",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 8 Days Ago",
    "startDate": "2023-03-17",
    "timeType": "Full time",
    "title": "Robotics Technologist II"
  },
  "userAuthenticated": false
}
