{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Public-Engagement-Undergrad-APX-Internship_R4724",
    "id": "df7d6edb070910017412f5dd82700000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>JPL Public Engagement Internship, Earth Public Engagement</b></p><p>The Earth Public Engagement intern will support the Earth Public Engagement team with product development and communications project management activities. This position will primarily focus on supporting recent/upcoming NASA Earth Science missions (EMIT, SWOT, NISAR, etc.) to better inform the public about mission status updates, timely research, and more. Additional assignments may include supporting Earth thematic web and social initiatives and content as well as content related to Climate Change.</p><p><br />In addition to directly liaising with project scientists, the intern will work with multiple teams of professional communicators, including web designers, graphic artists, and others to create compelling products to engage the public and share NASA’s advances in Earth science.</p><p></p><p><b>Responsibilities: </b></p><ul><li>Will assist with updating publicly released images for missions (tasks may include but are not limited to assisting with the curation of images, writing captions, and obtaining product approvals)</li><li>Will assist in the development of internal reporting products on behalf of the Earth Public Engagement Team (Ex. Assist in project management of design of reports, Climate in the News culling, pulling completed and upcoming activities from team organization tools, writing and laying out content, generating metrics reports)</li><li>Will assist in developing outreach products for public events</li><li>Will assist in development of strategic communications and product plans, including development of messaging and storytelling arcs</li><li>Will research industry best practices and provide ongoing improvements to public engagement programs and products.</li><li>Will assist with sharing NASA science/storytelling using digital communication tools (web, mobile, social media, digital and or video) as well as print products to effectively communicate a message that aligns with NASA’s communication priorities. </li><li>Will communicate regularly with stakeholders including weekly significant events, monthly reports and annual reviews including gathering metrics and reporting on project milestones, program impacts and will make informed suggestions for improvements. Attends project meetings regularly and reports out on efforts and/or communications news.</li></ul><p></p><p><b>Requirements:</b></p><ul><li>Excellent written and verbal communications skills, including excellent grammar skills, and ability to work in a team environment, including the ability to brainstorm, incorporate feedback, and participate in meetings and other venues where interaction with others is crucial</li><li>Ability to work under pressure, juggle multiple projects, prioritize tasks, solve problems, use critical thinking and analytical skills, and meet deadlines</li><li>Completed or ongoing coursework with exposure to standard communications principles, theories, concepts and techniques </li><li>Proficient Microsoft Office skills </li><li>Successful candidate must be punctual, detail-oriented, resourceful, and a self-motivated individual with the ability to work independently and apply judgment in planning, prioritizing, and completing tasks</li></ul><ul><li>Must be currently enrolled at least half-time at an accredited college or university pursuing a Bachelor&#39;s degree in journalism, communications, media, science writing, or related discipline</li><li>Must be able to work a minimum of 20 hours per week and full time during the summer</li><li>Minimum GPA 3.0</li><li>Proven experience using communication tools (web, mobile, social media, print, digital and or video) to effectively communicate a message</li><li>Ability to multitask and prioritize tasks with a strong attention to detail. Strong problem solving, critical thinking and analytical skills</li><li>Excellent written and oral communications skills</li><li>Previous outreach/web/writing experience, especially with NASA, is considered a plus</li><li>Reporting skills</li><li>Well-organized, detail-oriented and flexible</li><li>Open to new ideas, new experiences and learning on the job</li><li> Critical thinking and analytical skills</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $16.11 as a freshman, $19 as a sophomore, $22 as a junior, $25 as a senior</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Public-Engagement-Undergrad-APX-Internship_R4724",
    "jobReqId": "R4724",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 3 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-23",
    "timeType": "Part time",
    "title": "Public Engagement Undergrad APX Internship"
  },
  "userAuthenticated": false
}
