{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Executive-Staff-Coordinator_R4164",
    "id": "e69c71fb5b7e10012148fe527e7e0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The <b>JPL Proposal Office</b> is seeking to expand our existing team supporting the approval and submission of research proposals. Every year, proposal office staff coordinates the submission of 700 to 800 proposals by principal investigators across JPL. We are seeking an upbeat and driven Executive Staff Coordinator I with strong customer orientation, extraordinary interpersonal skills, and an agile and flexible workstyle. This position reports to the <b>Manager of the Proposal Office. </b></p><p><b>As a staff member, your responsibilities will include but not limited to: </b></p><ul><li><p>Serve as the frontline user support for submitters and approvers from across JPL interacting with the proposal submission and approval process that ensures proposals are fully authorized and meet all institutional and NASA requirements prior to submission.</p></li><li><p>Resolve recurring issues by working with workflow engine at the administrator level.</p></li><li><p>Test new functions within the approval work flow engine and report and anomalies to the development team.</p></li><li><p>Collect and report on user feedback that may lead to future system improvements.</p></li><li><p>Maintain the digital and physical campaign archives of submitted proposals to meet institutional record keeping requirements.</p></li><li><p>Handle proposals room access, track supply inventories, and create facilities requests for the proposal center.</p></li><li><p>Work is reviewed for accuracy and overall adequacy.</p></li><li><p>Actions and decisions may have a positive impact on a functional organization due to suggestions for improvements in methods, use of technology, and/or policies.</p></li><li><p>Failure to accomplish results can normally be overcome but may impact schedules, budget and projects.</p></li><li><p>Exercises judgment in applying applicable policies, procedures and practices to new situations and take appropriate action</p></li></ul><p><b>Qualifications:</b></p><ul><li><p>Typically requires a Bachelor’s degree in Business Administration, or related field with a minimum of 1 year of related experience; Master&#39;s degree in similar fields with a minimum of 0 years of related experience</p></li><li><p>Ability to maintain excellent customer relations, while working on day-to-day assignments under general supervision; typically receiving only general instructions on new assignments.</p></li><li><p>Motivated and able to become a subject matter authority on the JPL proposal process.</p></li><li><p>Ability to use established procedures as guides to work methods and deliver results.</p></li><li><p>Motivated self-starter who takes the initiative to recommend process improvements.</p></li><li><p>Must exercise appropriate discretion when handling assignments of a discreet nature and when handling sensitive material</p></li><li><p>Must be proficient in Microsoft, Word, Excel, PowerPoint, and Outlook</p></li><li><p>Extensive experience in providing confidential business support to senior management.</p></li><li><p>Strong background in effectively directing and following up on management action items.</p></li><li><p>Extensive background in dealing with top-level management and high-profile contacts.</p></li><li><p>Consistent record to partner, communicate and interact optimally at all levels of management, influence others and resolve complicated issues.</p></li><li><p>Ability to initiate and compose correspondence on behalf of the team</p></li><li><p>Excellent written and verbal communication skills.</p></li><li><p>Solid knowledge and experience in planning, coordinating, and scheduling calendars and tasks for upper-level management.</p></li><li><p>Strong organizational and interpersonal skills; detail oriented.</p></li></ul><p><b>Preferred Skills: </b></p><ul><li><p>Experience with workflow management system or other web-based customer facing systems.</p></li><li><p>Experience with proposal management and institutional compliance</p></li><li><p>Extensive knowledge of applicable Laboratory and NASA policies and procedures, and government regulations.</p></li><li><p>Familiarity with JPL acronyms and terminology.</p></li></ul><ul><li><p>Property Manager Gateway Administrator, timekeeping and JPL-ID.</p></li></ul><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments. However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$99,320 - $130,208<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Executive-Staff-Coordinator_R4164",
    "jobReqId": "R4164",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30 Days Ago",
    "startDate": "2023-03-29",
    "timeType": "Full time",
    "title": "Executive Staff Coordinator (Standard Temporary Employment Program)"
  },
  "userAuthenticated": false
}
