{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Staff-Assistant-II_R4138",
    "id": "e69c71fb5b7e10010a0de553fd700000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As a <i><b>Staff Assistant II</b></i>, you will be supporting JPL’s <b>Component Engineering &amp; Assurance Office</b> this team provides electronic parts, products and services for JPL, NASA and other customers.</p><p></p><p>The selected candidate will provide Staff Assistant support to 3 technical supervisors and their groups within the section. Will schedule and coordinate meetings via Microsoft Teams, make domestic and foreign travel arrangements, prepare and process travel expense reports, order office and lab supplies using iProcurement, and assist in the preparation and distribution of Interoffice Memorandum (IOMs) via the section’s on-line IOM system. Will be the subject matter authority for travel and timekeeping related issues. Will employ teaming and social skills to provide excellent customer service to all levels of personnel, across multiple organizations. Will perform ad hoc staff assistant assignments as requested. Will report administratively to the Supervisor of the Section 514 Business Administration Group (5114).</p><p></p><p><b><u>Qualifications</u></b>:</p><ul><li><p>Typically requires a High School diploma with a minimum of 6 years of related experience; Associates degree with a minimum of 1 year of related experience and related required training.</p></li><li><p>Solid understanding of job aspects and work techniques in the area of secretarial or administrative assistant; as well as practical applications to problems and situations ordinarily encountered.</p></li><li><p>Detailed understanding of office procedures and personal computer applications using Microsoft 365 (Word, Excel, Power Point, Adobe Acrobat, etc.).</p></li><li><p>Excellent typing, spelling, grammar, written and verbal communication skills.</p></li><li><p>Ability to work effectively under pressure on multiple sophisticated tasks, and work independently with minimal direction to meet commitments with high quality products.</p></li><li><p>Motivated self-starter who takes the initiative to perform activities and resolve unusual or nonstandard problems.</p></li><li><p>Ability to evaluate situations and apply good judgment in any vital resolution.</p></li><li><p>Exercise accurate discretion when handling assignments of a discreet nature and when taking care of critical material.</p></li><li><p>Great teammate.</p></li></ul><p></p><p><b><u>Desired Skills: </u></b></p><ul><li><p>Extensive understanding of JPL business policies, procedures, and practices.</p></li><li><p>Subject Matter Expert (SME) in Timekeeping and calendaring</p></li><li><p>Knowledge of P-Card, PMG, and Data Extractor/Discoverer.</p></li><li><p>Experience in PC based tools such as MS 365, DocuShare, Alfresco, UMS, iProcurement and EBIS suite of business applications.</p></li><li><p>Experience with JPL foreign and domestic travel regulations.</p></li><li><p>Willingness to look for, learn, and apply new Information Technology (IT) tools to office procedures and processes.</p></li><li>Excellent planning and scheduling skills.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$57,096 - $74,984<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Staff-Assistant-II_R4138",
    "jobReqId": "R4138",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 28 Days Ago",
    "startDate": "2023-03-28",
    "timeType": "Full time",
    "title": "Staff Assistant II"
  },
  "userAuthenticated": false
}
