{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Engineering-Undergraduate-Internship---Mars-Missions-Concept-Studies_R4179",
    "id": "e69c71fb5b7e1001fea01a3b81520000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Project Systems Engineering &amp; Formulation Section (312) provides lifecycle leadership in the formulation, planning and execution of the project systems engineering function for JPL space flight missions from concept development through completion of post-Launch checkout and commissioning.  The Section provides formulation services from concept ideation, to the full expression of that concept in formulation phase products such as formal proposals and Mission Concept Reviews. The Section is responsible for the systems engineering leadership that includes both the leadership of the project-wide systems engineering effort, and the delivery of the project-level systems engineering products. The section’s expertise spans a wide variety of project systems engineering products and disciplines, including, project system and mission architectures, project-level requirements, and exploration of very large mission-level trade spaces.</p><p></p><p>Innovation drives so much of what we do at JPL, and our inclusiveness helps drive that innovation.</p><p></p><p><b>WHAT WE OFFER  - JPL SUMMER INTERNSHIP PROGRAM</b></p><p>You can be part of JPL’s Summer Internship program which is a full-time internship opportunity during the summer months for undergraduate and graduate students. Summer interns gain practical work experience that they can apply to their studies when they return to school in the fall. </p><p></p><p>As a summer intern you will receive guidance and support from a JPL advisor to help strengthen your skills and develop your career path.  You’ll also build relationships and experience through networking events, seminars, tours, informational interviews, technical training, and more. This is your chance to join an innovative team that dares mighty things every day.</p><p></p><p>The selected intern will support Support development of Mars mission concept studies and future study work with commercial industry partners, will support development of design reference mission scenarios in a concurrent engineering environment, will perform trade studies and comparative analysis at system and subsystem level for Mars spacecraft architectures and will support Mars Exploration Programs advanced studies office near-term activities with regards to Mars strategy implementation and planning.</p><p></p><p><b>WHAT IT TAKES</b> </p><ul><li>Must be currently enrolled in a college or university pursuing a Bachelors, in a major (s) related to work assignment as listed above.</li><li>Must have at least 1 semester or quarter remaining to complete degree.</li><li>Must be enrolled full time in Fall 2023.</li><li>Must be able to work full time (40 hours/week) for 10-16 weeks during the summer.</li><li>Must have a minimum cumulative 3.0 out of 4.0 GPA.   </li></ul><p></p><p><b>WHAT WOULD HELP</b></p><ul><li>Majors in the following fields: Aeronautical &amp; Astronautical Engineering, Computer Science, Electrical/Electronic Engineering, Mechanical Engineering, Physics, Systems Engineering, or related</li><li>Strong analytical skills</li><li>Strong oral and written communication skills</li><li>Team player with strong collaboration skills</li><li>Related internship experience</li></ul><p></p><p></p><p>T<span>he typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Engineering-Undergraduate-Internship---Mars-Missions-Concept-Studies_R4179",
    "jobReqId": "R4179",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Yesterday",
    "startDate": "2023-03-31",
    "timeType": "Full time",
    "title": "Engineering Undergraduate Internship – Mars Missions Concept Studies"
  },
  "userAuthenticated": false
}
