{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Schedule-Analyst-III_R2283",
    "id": "4e57a7183d181000bd571d09c3ea0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>We are seeking a Project Schedule Analyst (PSA) to become an integral team member on the project business team, supporting one of our exciting programs and/or projects in Earth Science or Planetary Science Directorate. This is an exciting opportunity to be involved in the business planning of a JPL mission from the concept studies phase! Together we can make a big difference to explore the unknown to help benefit humanity.</p><p></p><p><b>In This Role, you will do the following: </b></p><ul><li><p>Build Integrated Master Schedule (IMS), maintain, analyze, and report schedule concerns, associated metrics, and schedule products.</p></li><li><p>Assess and validate the schedule/cost baseline integrity to ensure that it is effective, accurate, and executable.</p></li><li><p>Identify and communicate anomalies in the schedule data, analyze horizontal logic and critical path traceability.</p></li><li><p>Work closely with the Project Resource Analyst (PRA) team to implement and verify cost and schedule integration plan.</p></li><li><p>Maintain detailed network schedules in Microsoft Project Server including the extraction and analysis (DCMA 14-Point Assessment) of various schedule related data required for monthly/quarterly reporting.</p></li><li><p>Support monthly change control board meetings, and incorporate approved liens (Baseline Change Requests) into the project baseline or estimate at complete (EAC).</p></li><li><p>Assist in the production and presents high level summary schedule reports to key engineering partners.</p></li><li><p>Conduct and report “what-if” scenarios that can be easily understood by technical leadership</p></li><li><p>Generate Quantifiable Back-up Data (QBD) planning and also manage the progress for Earned Value (EV) reporting</p></li><li><p>Use technical knowledge about a project to derive schedule risks and potential negative impacts/opportunities to the project schedule</p></li><li><p>Work with Lead Scheduler on integrating schedule impact artifacts into schedule presentation package and be able to identify and/or present major takeaways from any set of PSA analysis presentation charts</p></li><li><p>Works on critical, often self-initiated, ad-hoc assignments and projects with minimal direction.</p></li></ul><p></p><p><b>This position requires the following qualifications:</b></p><ul><li><p>Typically requires a Bachelor degree with a minimum of 6 years of related experience; Master degree with 4 years of related experience; or PhD with 2 years related experience.</p></li><li><p>Utilizes knowledge, understanding and application of project planning and control principles and standards, including cost estimation, budgeting, and scheduling; performance measurements, including earned value, as required for the planning and implementation of complex projects</p></li><li><p>Able to interface effectively with program/project management, technical organizations, industry partners, and bypass centers.</p></li><li><p>Resourceful and self-motivated with excellent verbal and written communication skills.</p></li><li><p>Strong user of Microsoft Office (Excel, Word and PowerPoint).</p></li><li><p>Experienced user of Milestones Pro, STATs Health Check</p></li></ul><p></p><p><b>We prefer a candidate with the following qualifications:</b></p><ul><li><p>Previous experience in a project team environment with project reporting, integrated cost/schedule planning, Earned Value Management (EVM), and various performance measurement techniques.</p></li><li><p>Experience with cost-schedule baseline change control processes</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$93,808 - $110,136<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Schedule-Analyst-III_R2283",
    "jobReqId": "R2283",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "startDate": "2023-07-10",
    "timeType": "Full time",
    "title": "Schedule Analyst III"
  },
  "userAuthenticated": false
}
