{
  "jobPostingInfo": {
    "id": "5e374ff5ac1e1000d13ab614541c0000",
    "title": "Technologist III-X243",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the <b>Mechanical Systems Engineering, Fabrication and Test Division </b>which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breath of mechanical disciplines and is applied from architectural concept development through operations.</p><p></p><p>As the <i>Technologist </i>in thermal engineering domain<i>, </i>you will be working for JPL&#39;s <b>Propulsion, Thermal and Materials Engineering Section</b> which provides leadership and unique world-class expertise in the wide range of technologies and technical discipline areas of chemical and electrical propulsion, thermal, materials, contamination control, analytical chemistry, geochemical instruments, physics-based modeling, and two-phase flow heat and mass transfer. This requisition is specifically seeking for a new member of Two-phase Thermal Technology Laboratory.</p><p></p><p><b>Your responsibilities include:</b></p><ul><li>Identify thermal fluids research and technology development needs which enable future JPL flight missions</li><li>Conceive and write technical proposals for JPL R&amp;TD funds and outside JPL funding opportunities</li><li>Provide sustained thermal engineering support on a technology development task by yourself or as a lead of a small team to meet thermal element deliverables</li><li>Present technology development and research outcomes as published literature and at technical conferences</li><li>Identify a feasible thermal architecture and mature designs through conceptual, preliminary, and detailed design phases using practical passive and active thermal control techniques</li><li>Support design trades that successfully balance performance margins, resource use, risk, cost, and schedule</li><li>Draft and make effective presentations at major reviews or routine team meetings</li><li>Build trusting relationships between customer, team members, and Line management</li><li>Mentor junior team members as needed</li><li>Evaluate and devise approaches to meet engineering requirements</li><li>Develop complex mechanical/thermal components from design requirements</li><li>Partner with other engineers and project personnel to evaluate tests and verify mechanical/thermal performance</li><li>Conduct complex design analyses and oversees assembly and test of mechanical/thermal components</li><li>Apply extensive knowledge of applicable industry and/or academic practices and standards to ensure all design documentation is created</li><li>Partner with other engineers to complete interface agreements</li><li>Extensive understanding and wide application of principles, theories, concepts and techniques in a relevant field of knowledge</li><li>Broad knowledge in one or more related fields of knowledge</li><li>Extensive knowledge of applicable industry and/or academic practices and standards</li><li>Responsible for completing significant project or assignment milestones</li></ul><p></p><p><b><u>Required Qualifications</u></b></p><ul><li>Bachelors with 6 years of related experience, Masters with 4 years of related experience, or PhD with 2 years of related experience</li><li>Experience in a laboratory work setting including experimental test setup design and measurement system setup</li><li>Essential understanding of two-phase heat transfer concepts and associated technologies</li><li>Understanding of Constant Conductance Heat Pipe and Loop Heat Pipe operation and fabrication  </li><li>Experience in research and development of two-phase heat transfer devices such as heat pipes</li><li>Advanced experience in writing proposals to secure funding for research and technology development tasks</li><li>Capability to derive analytical equations to understand and model two-phase flow heat transfer</li><li>Capability to develop conceptual thermal designs, perform trade studies, and deselect to a design baseline</li><li>Identifies creative designs within available project resources to meet requirements without appreciable Line management oversight</li><li>Extensive knowledge of industry thermal practices</li><li>Demonstrated capability of task ownership and commitment to working extra hours to meet key milestones</li><li>Excellent verbal, written, interpersonal, and organizational skills</li></ul><p></p><p><b><u>Desired Skills: </u></b></p><ul><li>Thermal systems experience in thermal design, analysis and hardware</li><li>Knowledge of manufacturing and mechanical design techniques associated with additive manufacturing</li><li>Thermal software experience (Thermal Desktop, SINDA/FLUINT, NX Space Systems Thermal or equivalent)</li><li>Computational Fluid Dynamics software experience (ANSYS or equivalent)</li><li>Computer Aided Design experience (Solidworks, AutoCAD, and/or Siemens NX)</li><li>Experience with thermal testing (thermal vacuum, thermal ambient, instrumentation, data acquisition, test planning and test execution)</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$103,064 - $141,648<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-09",
    "timeType": "Full time",
    "jobReqId": "R3733",
    "jobPostingId": "Technologist-III-X243_R3733",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technologist-III-X243_R3733"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Senior Quantum Optics Research Technologist",
      "externalPath": "/job/JPL-Campus/Senior-Quantum-Optics-Research-Technologist_R3938-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 27 Days Ago",
      "startDate": "2023-02-13"
    }
  ],
  "userAuthenticated": false
}
