{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Public-Engagement-Events-Specialist--Solar-System-Thematic_R4315",
    "id": "91531aa0918f1001b0da6486f4b30000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities: </b></p><ul><li><p>The Solar System Communications Events Specialist will coordinate and implement events for the Solar System team through a wide variety of exhibits using graphics, animation, text, multimedia, dynamic and/or interactive content presentation.</p></li><li><p>Implement essential communication plans using innovative ideas for crafting and improving public engagement event products and programs to share NASA science via unique and engaging storytelling.</p></li><li><p>Research industry trends and provide ongoing improvements to public engagement events and products, including online and in-person visitor center/conference experiences to effectively communicate a message that aligns with NASA’s communications priorities.</p></li><li><p>Working with our Design Services, support end to end creation of exhibits, models and products including concepts, inventory management and storage requirements and represent JPL/NASA communication initiatives at professional conferences.</p></li><li><p>Coordinates with various stakeholders at NASA HQ and JPL for approvals and awareness and communicates regularly with all partners providing updates on weekly significant events, monthly reports and annual reviews.</p></li><li><p>Propose ideas and plans to the Group Supervisor and team members and occasionally present to senior management both at JPL and NASA Headquarters.</p></li><li><p>Work closely with managers to coordinate and review the budget including proposing appropriate budget levels to support communication products and outreach events.</p></li><li><p>Capture metrics and report on project achievements program impacts and provide informed suggestions for improvements.</p></li><li><p>Attend project meetings regularly and report on program results and/or communications news.</p></li><li><p>Up to 25% business travel.</p></li></ul><p></p><p>Qualifications:</p><ul><li><p><b>Bachelor&#39;s degree in Communications, Public Administration, Business Administration, Business Development/Management, Science/Technology, Marketing, Economics, or similar degree with a minimum of 6 years of related experience; or Master&#39;s degree with at least 4 years of relevant experience.</b></p></li><li><p>Excellent written and verbal communication skills including effective presentation skills.</p></li><li><p>Knowledge of best practices with public engagement events (including events and exhibits)</p></li><li><p>Consistent track record producing and delivering high impact events, experiences and products.</p></li><li><p>Experience working with senior level partners handling a variety of strategic and budgetary issues.</p></li><li><p>Ability to establish partnerships with partners and work well in a team environment.</p></li><li><p>Experience creating written critical communications plans with success metrics to demonstrate efficacy.</p></li><li><p>Proficiency with Microsoft Office applications (Word, Excel, Outlook, PowerPoint).</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Experience with Communications, Public Engagement or informal Education including non-profits, academic institutions and research organization</p></li><li><p>Experience developing and implementing campaigns</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$97,552 - $119,392<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Public-Engagement-Events-Specialist--Solar-System-Thematic_R4315",
    "jobReqId": "R4315",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 29 Days Ago",
    "startDate": "2023-05-12",
    "timeType": "Full time",
    "title": "Public Engagement Events Specialist, Solar System Thematic"
  },
  "userAuthenticated": false
}
