{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Payroll-Assistant_R4336-1",
    "id": "7887ef81446a1001ca08c5c9a6d90001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As a <b>Payroll Assistant,</b> you will be a key member of the Payroll and Timekeeping Group. Your responsibilities will include performing professional accounting work requiring knowledge of the theory and practice of recording, classifying, examining, and analyzing the data and records of payroll and timekeeping transactions.  You will interface with Human Resources, Cost Accounting, Financial Accounting and Cash Management, Enterprise Business System Support and various organizations for payroll and timekeeping, including adjustments and data resolution.  You will also interface with internal and external customers across organizations, as the job requires. </p><p></p><p>Your responsibilities will consist of assisting with (1) inquiries related to payroll/timekeeping transactions such as recording of labor, reimbursements, payroll deductions, direct deposits, tax with holdings and applicable tax limits; (2) fiscal year-end closing; (3) calendar year-end closing; (4) reviewing and performing analysis of payroll transactions on a weekly/bi-weekly basis; (5) requests from internal and external audits; (6) reviewing and performing analysis of labor transactions on a weekly/bi-weekly basis; (7) assisting with statistical reports as required; (8) troubleshooting payroll/timekeeping transaction inquiries; as well as responding to and/or supporting requests from various organizations and external customers; and (9) performing other duties as assigned by manager.</p><p></p><p>In this role, you will also:</p><ul><li><p>Provide customer support and troubleshoot Payroll/Timekeeping issues and provide resolutions.</p></li><li><p>Coordinate Payroll/Timekeeping issues with various organizations as necessary.</p></li><li><p>Apply advanced knowledge of Payroll/Timekeeping to coordinate and perform day-to-day customer support.</p></li><li><p>Apply advanced understanding of applicable policies, procedures, and practices.</p></li><li><p>Take responsibility and ownership of: (1) customer service; (2) time card entry; (3) suspense log; (4) check printing and delivery; (5) Payroll/Timekeeping statistical and metric reports as may be required; (6) time card storage and organization; (7) receive and distribute incoming mail; (8) Workday employee self-service subject matter expert (SME); (9) file maintenance; and (10) back-up to payroll team.</p></li></ul><p></p><p><b><u><span>Qualifications:</span></u></b></p><ul><li><p>Typically requires a High School diploma with a minimum of 10 years of related experience; or Associate&#39;s Degree in Business Administration, Finance, Accounting, Human Resources or related discipline with a minimum of 6 years of related experience; or a Bachelor’s degree in a similar discipline with a minimum of 3 years of related experience.</p></li><li><p>Extensive knowledge in related fields of: Accounting, HR, California Labor Laws, Tax Regulations, Multi-State Taxation, Federal Labor Laws.</p></li><li><p>Extensive experience with a payroll system, such as, Workday Payroll.</p></li><li><p>Extensive understanding and application of standard principles, theories, concepts and techniques in Payroll and Labor Accounting Standards.</p></li><li><p>Excellent computer skills, particularly in Excel and Word, strong quantitative ability.</p></li><li><p>Strong analytical and problem-solving skills with the ability to resolve complex issues.</p></li><li><p>Ability to work effectively in a dynamic environment.</p></li><li><p>Ability to establish and meet deadlines, set and manage multiple priorities, and work well with management, other organizations and other team members.</p></li><li><p>Must be a self-starter and be willing to assist employees with their Payroll and Timekeeping inquiries.</p></li><li><p>Excellent oral and written communication skills, ability to handle potentially difficult situations in a professional manner.</p></li><li><p>Ability to work independently on important assignments/projects with only limited supervision, typically receiving only general instruction.</p></li><li><p>Ability to exercise discretion and independent judgment to compare and evaluate various methods, approaches, and resources and decide which will best accomplish each aspect of such <span>assignments/projects.</span></p></li></ul><p></p><p><b><u>Desired</u></b><u><span><b> Qualifications</b></span></u></p><ul><li><p>Knowledge of applicable industry and/or academic practices and standards in Payroll Accounting and Human Resources.</p></li><li><p>Broad knowledge of State by State Regulatory Provisions, General Accounting, Employment and Benefits Laws.</p></li><li><p>Broad knowledge of aerospace, non-profit or higher education accounting practices.</p></li><li><p>Strong analytical skills with experience in performing special unplanned analysis requiring quick turnaround in a dynamic environment.</p></li><li><p>Experience working with a large and integrated Payroll/HR system, preferably Workday.</p></li><li><p>Extensive knowledge of Payroll/Timekeeping systems, policies, and procedures.</p></li><li><p>Strong interpersonal, oral and written communication and presentation skills.</p></li><li><p>Strong desire to know accounting processes and data flow.</p></li><li><p>Proficient with Microsoft Office, Excel, PowerPoint and Word.</p></li><li><p>Designation of Payroll Practitioner, preferably CPP or FPC.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$65,936 - $84,656<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Payroll-Assistant_R4336-1",
    "jobReqId": "R4336",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-05-25",
    "timeType": "Full time",
    "title": "Payroll Assistant"
  },
  "userAuthenticated": false
}
