{
  "jobPostingInfo": {
    "id": "32bbf743df711001bbd96bfb89320000",
    "title": "Staff Assistant II",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This is an outstanding opportunity to be part of JPL&#39;s Autonomous Systems Division. Our division is responsible for technology, advanced concepts, design, development, delivery, integration &amp; test, verification &amp; validation, operation of hardware, flight software, power systems, robotic systems, and Guidance &amp; Control of a multitude of JPL products. This position will be part of the Section 347 Business team and report to the Business Administration Manager.</p><h2>Primary responsibilities include:</h2><ul><li><p>Providing office support to multiple technical groups within the Mobility and Robotics Systems Section.</p></li><li><p>Demonstrate proven customer service orientation, phenomenal organization skills, and flexibility in the performance of the job.</p></li><li><p>Prioritizing work and completing assignments accurately and in a timely manner.</p></li><li><p>Taking charge of foreign and domestic travel, generating travel reports, affiliate badge requests for domestic and foreign visitors, P-card purchasing, requisitions, iProcurement</p></li><li><p>Coordinating meetings via Outlook, maintaining conference room schedules, assisting with preparation of presentations, graphics, and website inputs, including proofreading and editing.</p></li><li><p>Coordinate JPL new hire preparations including new employee checklist and initial technical training setup</p></li><li><p>Plan section events and coordinate day-of logistics</p></li><li><p>Regularly supporting multiple and multifaceted ad hoc assignments.</p></li><li><p>Providing back-up support to the Section and other groups as needed.</p></li></ul><h2><b>Qualifications </b></h2><p>Typically requires a High School diploma with at least 6 years of related experience or an Associate’s degree with a minimum of 1 year of relevant experience.</p><ul><li><p>Must be very detail oriented, highly organized, and be able to work independently and within teams.</p></li><li><p>Solid understanding of general job aspects specifically within office support roles.</p></li><li><p>Detailed understanding of office procedures and office automation applications: Microsoft Suite, Power Point, Adobe Acrobat, Outlook and applies knowledge and skills in this area.</p></li><li><p>Demonstrated ability to work effectively on multiple tasks while meeting commitments with high quality results and output.</p></li><li><p>Familiar with MS Project, Access, SharePoint, Photoshop, Publisher</p></li><li><p>Basic Database knowledge</p></li><li><p>Ability to identify, learn, and apply new processes to improve office operations.</p></li><li><p>Willingness to learn new technologies and tools to enhance and/or improve office processes.</p></li><li><p>Motivated self-starter who takes the initiative to perform activities and resolve unusual or nonstandard problems.</p></li><li><p>Demonstrated ability in successfully handing discreet information.</p></li><li><p>Must have excellent written and oral communications skills.</p></li><li><p>Ability to interact effectively with all levels of personnel and provide excellent customer service.</p></li><li><p>Demonstrated success in the administrative support profession with the ability to maintain patience and composure in a dynamic work environment that includes interruptions and changing priorities.</p></li></ul><h2>Preferred Skills:</h2><ul><li><p>Knowledge of JPL/ESD policies, procedures, and practices.</p></li><li><p>Experience with JPL international/domestic travel processes and requirements.</p></li><li><p>Subject Matter Expert (SME) in timekeeping, travel, and calendaring.</p></li><li><p>General understanding of JPL facilities, safety, and property policies and procedures.</p></li><li><p>Experience using JPL-based tools such as Concur, Service Order Modules, Requisitions, P-card, WAMs, Property Manager Gateway Administrator, and JPL-ID.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$57,096 - $74,984<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 2 Days Ago",
    "startDate": "2023-03-16",
    "timeType": "Full time",
    "jobReqId": "R4109",
    "jobPostingId": "Staff-Assistant-II_R4109",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Staff-Assistant-II_R4109"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Staff Assistant II",
      "externalPath": "/job/JPL-Campus/Staff-Assistant-II_R3624",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 4 Days Ago",
      "startDate": "2023-03-14"
    },
    {
      "title": "Staff Assistant II",
      "externalPath": "/job/JPL-Campus/Staff-Assistant-II_R4025",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 18 Days Ago",
      "startDate": "2023-02-28"
    },
    {
      "title": "Staff Assistant II (Standard Temporary Employment Program)",
      "externalPath": "/job/JPL-Campus/Staff-Assistant-II--Standard-Temporary-Employment-Program-_R3998",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 24 Days Ago",
      "startDate": "2023-02-22"
    }
  ],
  "userAuthenticated": false
}
