{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Business-Application-Developer_R4480",
    "id": "731ce68d6c0b1001d429380bb6fd0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Do you live to code, love problem solving, analyzing data and technical challenges? Do you enjoy interacting with business partners and domain experts to understand their business problems and needs, then conveying the passion and expertise to transform these problems or needs from requirements to technical solutions that deliver value? We are looking for technical talent to do just that!</p><p>This opportunity seeks an Enterprise Software Engineer within the Enterprise Business Information Services (EBIS) Division joining a dedicated team of IT professionals in the Project and Institutional Financial Information Services Section. The new team member will have opportunities to innovate and apply technologies across a spectrum of industry standard methodologies in financials, project controls and contracts business domains. In this highly impactful, far-reaching role, you can demonstrate highly collaborative behavior, be results-oriented, and exhibit domain expertise whose experiences couple both technology and business sense. The ideal candidate works independently and in collaboration with other team members, is analytical, applies judgment, and has multi-tasking skills to successfully support the business systems needs of both internal and external customers, including the timely accomplishment of performance, delivery, and schedule landmarks.</p><p>The EBIS Division maintains stewardship over the ever-evolving Business IT portfolio of applications and systems required to support JPL&#39;s robust and complex business processes. EBIS manages the full system lifecycle across all major business processes, provides analytical and technical services, and strategically partners with the Laboratory&#39;s business community to ensure continuous delivery of business IT services. Key initiatives include a business intelligence program, data analytics, and embracing agile methodologies and tools.</p><p><b>Qualifications:</b></p><ul><li>Bachelor degree with at least 3 years’ experience or Master’s degree with 1 year of related experience in Computer Information Systems, Computer Science, Business Information Systems or related disciplines</li></ul><p><b>Job Requirements:</b></p><ul><li>Elicit and collect relevant requirements and help users discover their real business needs</li><li>Participate in software feasibility and trade studies</li><li>Build use cases, generate user stories, test scripts and test plans</li><li>Design, setup, develop and test business software applications and interface solutions that will be delivered into JPL’s enterprise computing system environment according to JPL/EBIS software development standards</li><li>Coordinate and communicate system upgrades, new features and changes to users and business process owners</li><li>Participate in technologies evaluation and recommend solutions to optimize IT and business processes</li><li>Analyze and resolve technical/functional production issues</li><li>Work with users to gain understanding of business processes</li><li>Remain in regular contact with users throughout the project to present prototypes, conduct demos, problem solve, allay concerns, validate requirements, etc.</li><li>Craft intuitive and visually appealing user interfaces and dashboards</li><li>Provide estimates and schedules to project management</li><li>Help drive our products to greatness</li><li>Keep our products fresh and relevant by proposing improvements as business needs change, or as new features become available</li></ul><p><b>Skills:</b></p><ul><li>Has experience in some of these areas: SQL, Oracle PL/SQL, Shell Scripts, JSON, XML, Python, Java, JavaScript, Angular, Node.js, HTML5, or CSS</li><li>Ability to communicate ideas, instructions, and requirements clearly and concisely; ability to tell a story</li><li>Has experience building APIs and services using REST, SOAP, etc.</li><li>Analytical and problem-solving skills</li><li>Ability to translate requirements into business system solutions</li><li>Ability to build prototypes and mockups</li><li>A self-starter with the ability to think creatively and to work well as part of a diverse team and as an individual contributor</li><li>Good interpersonal skills, integrity and self-awareness, to communicate comfortably with all levels of staff and management</li><li>Superb writing and presentation skills</li></ul><p><b>Desired Skills</b></p><ul><li>Familiarity with software development methodologies including waterfall and agile/scrum</li><li>Familiarity with data security methods and safe guarding different classification of information, both in place and in transit</li><li>Familiarity with basic toolsets that support development, such as Jira and GitHub</li><li>Familiarity of continuous integration, continuous delivery (CI/CD)</li><li>Experience with or desire to learn one or more of the following: EVMS/Project Controls System, Oracle eBS (Financials or Projects), Contract Lifecycle Management System, or MS Project Server</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$112,070 - $122,096<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Business-Application-Developer_R4480",
    "jobReqId": "R4480",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-06-29",
    "timeType": "Full time",
    "title": "Business Application Developer"
  },
  "userAuthenticated": false
}
