{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Europa-Clipper-Navigation-Team-Chief_R4428",
    "id": "bbec4f87682d1000d785628e87e30000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><h1><u>Overview</u></h1><p>JPL’s Mission Design and Navigation (MDNAV) Section (392) builds maps and tools for interplanetary navigation, designs efficient routes for spacecraft to reach any remote solar system location, and safely pilots spacecraft to their ultimate destination. Within the MDNAV Section, the Outer Planet Navigation Group (392J) focuses on missions to the outer planets, dwarf planets (such as Ceres and Pluto), comets, and asteroids. The group performs operational orbit determination (OD) during flight, as well as OD analyses for missions prior to launch.</p><p></p><h1><u>Responsibilities:</u></h1><p>Will be the Navigation Team Chief for the Europa Clipper Mission, responsible for planning and executing all navigation activities according to Mission Design, Navigation and Operations Plans. Will provide leadership, technical direction, guidance and oversight to the Europa Clipper Navigation Team. Will be a member of the Outer Planet Navigation Group. Will report administratively to the Outer Planet Navigation Group Supervisor and programmatically to the Europa Clipper Mission System Manager. Will manage all navigation activities as the point-of-contact for the Navigation Team. Will be responsible for planning schedules and budgets, and have the authority to advise and control navigation resources and schedule. Will manage updating and maintaining navigation requirements, processes, and procedures as well as coordinate verification and validation activities, test, and training exercises. Will interface with software, system administration / network, and project operations teams to ensure collaborative operations. Additional responsibilities will be to lead and direct navigation trade studies, organize navigation peer reviews, participate in project reviews and report on navigation system status at monthly management reviews.</p><p></p><h1><u>Qualifications:</u></h1><h2>Required Qualifications:</h2><ul><li>Bachelor’s degree in Aerospace Engineering, or related technical discipline with typically a minimum of 9 years of related experience; Master’s degree in similar disciplines with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years related experience.</li><li>Multifaceted experience and sophisticated knowledge in one or more of the following areas: statistical orbit determination, optical navigation, flight-path control, mission/trajectory design, mission/flight operations, ground data system, and/or mission planning.</li><li>Extensive understanding and wide application of advanced principles, theories, concepts and techniques in mission design and navigation resulting in contributions to the development of new theories and methods.</li><li>Extensive knowledge of industry and/or academic practices and standards across a range of applications related to aerospace engineering, navigation analysis, and mission/spacecraft flight operations.</li><li>Proven navigation-related technical/leadership skills and operational experience</li><li>Leads and directs the technical and programmatic work of a project team that is responsible for the technical performance, mission success and delivery of a highly complex project element, subsystem, instrument or system.</li><li>Approves final product for delivery.</li><li>Demonstrated ability to present technical results to a wide-audience.</li><li>Conducts ongoing assessment of team’s progress and reports status to management and peers.</li><li>Presents status report and progress briefings at project reviews.</li><li>Represents JPL through regular interface with representatives of organizations outside JPL.</li></ul><p></p><h2>Desired Qualifications:</h2><ul><li>Ability to lead a multifunctional and/or multidisciplinary team for a project, activity, or function.</li><li>Experience working on missions orbiting the Gas Giants (Jupiter and Saturn).</li><li>Proven experience in staff/budget planning and cost/schedule management.</li><li>Ability to interact with other Project leadership in the development and implementation of complex and broad reaching solutions to key and driving Project requirements and/or technical issues.</li><li>Knowledge of Laboratory and NASA policies and procedures, industry and academic practices and standards, and government regulations across a range of applications related to Mission Design, and Navigation.</li></ul><p></p><p><i>NOTE: This position may be classified at a level higher than the posted level. A determination will be made once the final candidate has been identified. The typical full time equivalent annual hiring range for this job at a level higher in Pasadena, California. $187,512 - $235,976</i></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$153,816 - $191,360<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Europa-Clipper-Navigation-Team-Chief_R4428",
    "jobReqId": "R4428",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 5 Days Ago",
    "startDate": "2023-06-13",
    "timeType": "Full time",
    "title": "Europa Clipper Navigation Team Chief"
  },
  "userAuthenticated": false
}
