{
  "jobPostingInfo": {
    "id": "16fcebb1c5d31000bc850a8077a70000",
    "title": "Staff Assistant III (Leadership & Organizational Development)",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Administrative support is one of the most important roles at JPL. The <b>Human Resources</b> organization is seeking an experienced<b> Staff Assistant </b>to be a lifeline to the success of our workforce and the Lab. This motivated individual takes direction well while also thriving independently, using good judgement and precision. This is a great role for a strong communicator with experience providing confidential administration support with significant discretion, judgment, tact, and diplomacy. The right candidate is organized and conscientious, and enjoys creating order out of complexity, puzzling together the perfect schedule, organizing events, and thinking about the details everyone else forgets. In addition to handling senior management calendars and scheduling, you will collaborate closely with Procurement, the travel office, and other JPL departments. <b>This role will support the Leadership and Organizational Development, Technical Training, Change Management, and HR Information Systems groups, and will report to the Head of Leadership and Organizational Development.</b></p><p></p><p><b>Responsibilities include, but are not limited to: </b></p><ul><li><p>Provide excellent office support to multiple groups within the organization.</p></li><li><p>Represent HR leaders to JPL and Caltech personnel, industry, and academia.</p></li><li><p>Independently resolve administrative issues in a timely manner, as actions may have significant impact to the organization. This may include troubleshooting roadblocks and finding creative and innovative solutions.</p></li><li><p>Review, evaluate and direct incoming requests for information and action, as appropriate. Initiate and write routine correspondence on behalf of leaders.</p></li><li><p>Run and maintain busy and complex calendars; schedule meetings using professional business etiquette, including setting up conference rooms and/or virtual calls (using WebEx); maintain standing meetings, and respond to meeting requests.</p></li><li><p>Build reports or presentations from verbal instructions or at own initiative with limited supervision.</p></li><li><p>Write and edit correspondence, presentation materials, graphics, and website inputs.</p></li><li><p>Track important actions or milestones for management and provide updates or reminders as needed.</p></li><li><p>Process and prepare travel logistics and bookings, authorization requests, and expense reports, ensuring compliance of travel policies, procedures, and timekeeping.</p></li><li><p>Submit paper timecards, update employee charge codes (WAMs), and keep track of HR personnel equipment in the institutional tools.</p></li><li><p>Update the HR directory, and maintain email distribution lists, org charts, and project calendars.</p></li><li><p>Submit visitor requests and assist with escorting visitors and handling logistics for short-term visitors.</p></li><li><p>Coordinate new hire preparations, office moves, and ergonomic evaluations.</p></li><li><p>Take care of procurements using institutional tools and following appropriate processes and rules (e.g. iProcurements and P-Cards).</p></li><li><p>Coordinate events, such as all-hands meetings or workshops, and team offsite events.</p></li><li><p>Collaborate proactively with other teams within HR, as well as outside own organization.</p></li><li><p>Maintain the facilities, ongoing inventory and restocking of office supplies for the groups</p></li><li><p>Interpret applicable internal Laboratory and NASA processes, policies, requirements, and procedures.</p></li></ul><p><br /><b>Qualifications:</b></p><p>Typically requires a High School diploma with a minimum of 8 years of related experience; Associates degree with a minimum of 4 years of related experience; or Bachelors degree with a minimum of 1 year of related experience; related required training.</p><ul><li><p>Strong attention to detail and ability to maintain confidentiality in daily work, as well as excellent planning and scheduling skills.</p></li><li><p>Extensive expertise in office operations with strong organizational, computer and interpersonal skills.</p></li><li><p>Experience with commonly used applications such as Google Drive, Sharepoint, Microsoft Teams, Concur, Workday, Content Management Systems (CMS), project management tools, and Wikis, as well as experience with custom applications for handling personnel needs.</p></li><li><p>Ability to multitask, and create high-quality materials on short timeframes, with minimal direction.</p></li><li><p>Motivated self-starter who takes the initiative to establish and implement process improvements.</p></li><li><p>Ability to evaluate situations and apply good judgment in any necessary resolution.</p></li><li><p>Excellent written and verbal communication skills, allowing them to partner and interact effectively at all levels of management, influence others and resolve challenging issues.</p></li><li><p>Excellent customer service skills.</p></li><li><p>Experience exercising appropriate tact when handling discreet assignments and sensitive material.</p></li><li><p>Proficient in Microsoft, Word, Excel, PowerPoint, Outlook, and Project.</p></li><li><p>Proven background in anticipating requests and initiating actions in support of the business needs of senior management.</p></li><li><p>Experience in highly collaborative environments, and willingness to contribute to all areas.</p></li><li><p>Proven track record in maintain a professional demeanor while working in a fast-paced environment.</p></li><li><p>Proven ability to effectively prioritize and coordinate multiple assignments.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Administrative Assistant experience in an HR or technical office environment.</p></li><li><p>Extensive understanding of JPL policies, procedures, and practices.</p></li><li><p>Experience with Adobe Acrobat, Visio, Publisher, and website design.</p></li><li><p>Willingness to look for, learn, and apply new Information Technology (IT) tools to office procedures and processes.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$69,576 - $88,608<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-23",
    "timeType": "Full time",
    "jobReqId": "R3809",
    "jobPostingId": "Staff-Assistant-III--Leadership---Organizational-Development-_R3809",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Staff-Assistant-III--Leadership---Organizational-Development-_R3809"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Staff Assistant III (People Operations)",
      "externalPath": "/job/JPL-Campus/Staff-Assistant-III--People-Operations-_R3808",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-03"
    },
    {
      "title": "Section Staff Assistant",
      "externalPath": "/job/JPL-Campus/Section-Staff-Assistant_R3889",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-08"
    }
  ],
  "userAuthenticated": true
}
