{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Robotics-Systems-Engineer-II--Temporary_R4181-1",
    "id": "e69c71fb5b7e10020e1f75c0fd2a0001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Wanted: A <i>Robotics Technologist</i> with a range of skills related to the design, development, and simulation, of space platforms and robotic systems. </b></p><p></p><p><b>Opportunity:</b> To work with a world-class, multi-disciplinary workforce that originates and executes robotics technology development and space flight projects for terrestrial and planetary exploration applications. This <b>temporary employment</b> role is focused on supporting and leading simulation efforts for the Mobility and Robotic Systems section at JPL. The primary projects would be support for simulation of the physics of space, aerial and robotic platforms and their interaction with the atmosphere and terrain environments for landers, mobility, sampling and sensing, and developing tools for understanding the problems robotic engineers will face in designing, deploying and operating these systems.</p><p></p><p>In this position, you will be responsible or the following:</p><ul><li><p>Develop and adapt mathematical and physical models to represent spacecraft, environments, and robotic systems</p></li><li><p>Implement models in simulation and visualization software</p></li><li><p>Test and verify the correctness of models and simulation</p></li><li><p>Collaborate with the development team on advancements in the architecture, design and algorithms for the simulation framework</p></li><li><p>Support customers in flight and technology projects for the development of simulations and their test and integration</p></li><li><p>Report to management on progress and status at reviews</p></li></ul><p></p><p><b>Qualifications</b></p><ul><li><p>Bachelor’s degree in Aerospace Engineering, Mechanical Engineering, Computer Science or other related technical discipline with 3&#43; years related experience , or Master’s degree in similar disciplines with 1&#43; years related experience or Ph.D in similar disciplines</p></li><li><p>Experience and proficiency with both software and simulation</p></li><li><p>Must be proficient in C/C&#43;&#43; and Python</p></li><li><p>Experience with Linux or other Unix-like operating systems</p></li><li><p>Strong written and verbal communication skills to facilitate inter-team information flow and to support review of team products</p></li></ul><p></p><p><b>Preferred Qualifications:</b></p><ul><li><p>Experience and familiarity with the modeling and simulation of robotic and aerospace platform systems and physical environments</p></li><li><p>Knowledge of kinematics and dynamics of mechanical systems</p></li><li><p>Demonstrated innovation, initiative, and leadership</p></li><li><p>Extensive experience with simulation methods and implementation</p></li><li><p>Prior experience in architecting and development of software systems</p></li></ul><p></p><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$109,408 - $139,672<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Robotics-Systems-Engineer-II--Temporary_R4181-1",
    "jobReqId": "R4181",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "startDate": "2023-03-31",
    "timeType": "Part time",
    "title": "Robotics Systems Engineer II, Temporary"
  },
  "userAuthenticated": false
}
