{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Senior-Researcher-in-Atomic-Clock-and-Fundament-Physics_R3560-1",
    "id": "fadcf55cb4a01000c4722320730f0001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is the NASA center for the NASA Fundamental Physics Program in the new division of Biological and Physical Science in the Science Mission Directorate. In anticipation of the growing interest and opportunity in the area of fundamental physics with high performance optical clocks, the JPL Quantum Sciences and Technology Group is seeking a staff researcher in the area of high performance lattice optical clock and precision measurements in support of clock science, optical clock technology maturation with focus on lattice clocks, as well as mission formulation and implementation.</p><p></p><p>As a subject matter expert in the area, the candidate researcher will help lead clock mission science study, requirement definition, capability development, and technology maturation and validation activities in the coming years. The candidate will also provide support for the overall clock science and fundamental physics program development and implementation. </p><p></p><p>As a member of the Quantum Sciences and Technology Group in the Communications Architectures and Research Section, will work with and report to the supervisor of the group. will:</p><ul><li><p>Participate and eventually lead clock mission science studies.</p></li><li><p>Investigate and identify science requirements and technology gaps.</p></li><li><p>Provide technical leadership in laboratory prototype optical clock development.</p></li><li><p>Play a key role in technology maturation and validation activities.</p></li><li><p>Be responsible for design, modeling, fabrication, tests, and analysis.</p></li><li><p>Lead and/or contribute to competitive proposal developments.</p></li><li><p>Support other technical activities in the group as needed.</p></li><li><p>Provide mentorship to junior staff members including postdocs and students.</p></li></ul><p><br /><b>Qualifications</b></p><ul><li><p>Bachelors degree in Physics, or related technical discipline with a minimum of 9 years of related experience; Masters degree in similar disciplines with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years of experience.</p></li><li><p>Broad knowledge and experimental experience in atomic clocks, precision measurements and their roles in gravity and fundamental physics measurements.</p></li><li><p>Extensive understanding and wide application of principles, theories, concepts and techniques in atomic physics, systematic error analysis, and precision measurements.</p></li><li><p>Extensive knowledge of applicable academic practices and standards in area of optical frequency metrology, atomic clocks, laser cooling and trapping of atoms, and their applications.</p></li><li><p>Demonstrated problem-solving ability in research and broad range of experimental skills.</p></li></ul><p></p><p><b>Preferred Qualifications</b></p><ul><li><p>Direct knowledge and experiences in lattice optical clock research and development activities.</p></li><li><p>Recent experience and proven track record in system-wide design and development of a neutral atom lattice optical clock.</p></li><li><p>Experience and Knowledge in atom interferometry and related research activities.</p></li><li><p>Broad research interests, innovative and flexible.</p></li><li><p>Expertise and experience in precision measurements and related systematic analysis.</p></li><li><p>Demonstrated laboratory skills in cold atom, Bose-Einstein condensate, optics, vacuum, electronics, data acquisition and control, modeling and analysis.</p></li><li><p>Background and knowledge in general relativity, special relativity, and dark sector physics.</p></li><li><p>Demonstrated interest and understanding of fundamental physics research through precision measurements.</p></li><li><p>Experience and working knowledge of project and program development.</p></li><li><p>Good track record of significant scientific journal publications.</p></li><li><p>Demonstrated leadership quality and skills.</p></li><li><p>Team player qualities with excellent communication, interpersonal, verbal and presentation skills.</p></li><li><p>Track record of successful competitive proposals.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$133,848 - $175,760<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Senior-Researcher-in-Atomic-Clock-and-Fundament-Physics_R3560-1",
    "jobReqId": "R3560",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 3 Days Ago",
    "startDate": "2023-05-25",
    "timeType": "Full time",
    "title": "Senior Researcher in Atomic Clock and Fundamental Physics"
  },
  "userAuthenticated": false
}
