{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/SAR-Algorithm-Developer_R4632",
    "id": "cae64fcd52b11001ad2c041642680000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>With an unmatched history creating groundbreaking advances in science and technology, JPL has been in the space exploration business since the beginning. Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p>We resonate with people who are looking for ways to go further and offer an opportunity to be part of a team of passionate and dedicated engineers working with some of the world’s best capabilities and cutting- edge technology in science, technology, and engineering. We offer a comprehensive benefits plan, tuition reimbursement and generous Caltech retirement contributions.</p><p>The Radar Science and Engineering Section in the Communications, Tracking, and Radar Division conducts research, development, and flight missions in the field of airborne and spaceborne remote sensing radar for NASA and other government agencies. This section specializes in systems and techniques related to synthetic aperture radar (SAR) imaging, radar interferometry, altimetry, Earth and planetary subsurface sounders, scatterometry, and cloud and precipitation radars. The section is also a leader in the area of planetary landing radars. Our radar program focusses on Earth and planetary science missions, with emphasis on first-of-a-kind radar systems and cutting-edge technology.</p><p></p><p><b><u>Responsibilities</u></b></p><p>We invite you to join the Radar Section to serve as a Synthetic Aperture Radar Algorithm Developer for the Observational Products for End-Users from Remote Sensing Analysis (OPERA) projects. You will report administratively to the Group Supervisor of the SAR Algorithms and Processing Group and programmatically to the lead of OPERA Algorithm Development Team (ADT).</p><p>The OPERA project is focused on implementing and producing derived SAR and optical products in support of the Federal-Civil Satellite Needs Assessment from the Satellite Needs Working Group (SNWG) coordinated through NASA. The OPERA first phase is focused on three products: a North America Displacement product from InSAR data; a near-global Surface Water Extent product from SAR and optical data; and a near-global Disturbance product from optical data.</p><p>The OPERA ADT is responsible for developing advanced algorithms to produce higher-level derived products and time series from Sentinel-1, NISAR, SWOT, Landsat-8, and Sentinel-2 data.</p><p></p><p><u>Some Challenges You Will Tackle</u></p><ul><li>Design, implement, test, and validate algorithms and software to generate and deliver OPERA data products to scientific users and the public</li><li>Deal with specific algorithmic aspects related to phase unwrapping, persistent and distributed scatterer InSAR time series analysis, big data-friendly workflows, and radar data processing for identifying surface disturbance and change detection</li><li>Adapt and process simulated and actual SAR data for algorithm testing and validation</li><li>Use and contribute to the open-source InSAR Scientific Computing Environment Enhanced Edition (ISCE3)</li><li>Work collaboratively with other engineers and scientists to develop, test, and deliver complex algorithms and software systems</li><li>Understand and apply principles, theories, concepts, and techniques in software development</li><li>Communicate results to project team members and the scientific community</li></ul><p></p><p><b><u>Qualifications</u></b></p><p><u>You Must Have</u></p><ul><li>Bachelor’s degree in Electrical Engineering, Computer Science, Geosciences or closely related technical discipline with a minimum of 3 years of related experience; Master’s degree in similar disciplines with a minimum of 1 year of related experience; or PhD with 0 years of experience in similar disciplines</li><li>Strong C&#43;&#43; programming skills</li><li>Experience with optimization problems</li></ul><p></p><p><u>Preferred Qualifications</u></p><ul><li>Demonstrated experience in one or more of the following areas:<ul><li>Network flows</li><li>Programming with CUDA</li><li>Phase unwrapping on radar/optical data</li></ul></li><li>Python programming skills</li><li>Familiarity with SAR or InSAR time series algorithm development and processing techniques</li><li>Experience with Github and open-source development</li><li>Strong oral and writing communication skills</li><li>Ability to work well in a team environment</li><li>Additional remote sensing data processing and GIS software knowledge</li></ul><p></p><p>New ideas are all around us, but only a few will change the world. That is our focus at JPL. We ask the biggest questions and search the universe for answers—literally. We build upon ideas that have guided generations and share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer.</p><p></p><p></p><p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. JPL is a VEVRAA Federal Contractor. For more information about “EEO is the Law,” click here: <a href=\"http://www.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\" target=\"_blank\">http://www.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf</a>.</p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries unless they are Legal Permanent Residents of the U.S. or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available at <a href=\"http://oiir.hq.nasa.gov/nasaecp/\" target=\"_blank\">http://oiir.hq.nasa.gov/nasaecp/</a>.</p><p></p><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$98,592 - $125,840<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "SAR-Algorithm-Developer_R4632",
    "jobReqId": "R4632",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-03",
    "timeType": "Full time",
    "title": "SAR Algorithm Developer"
  },
  "userAuthenticated": false
}
