{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Business-Administrator-Level-II_R3831-1",
    "id": "e69c71fb5b7e1001bd8aba8c85dd0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As a Business Administrator II you will be working for JPL&#39;s Concept Office (1541) within the Office of Formulation (1540), which is a fast-paced, extremely dynamic environment.  You will be supporting Concept Office management, JPL’s Formulation Program Offices, and ESD engineers, scientists, and technologists who collaborate on mission concept development.  Concept studies are conducted using JPL’s concurrent engineering teams:  A-Team, Team X, Team X SmallSat/CubeSat, and Team X Instrument design teams.  Concept development and maturation include:  brainstorming, ideation, initial feasibility, architecture trade-space exploration, science traceability, point design, proposal outlining, and proposal reviews.  Will report to the 1541 Concept Office Manager.<br /><br />Your responsibilities include, but are not limited to:</p><p></p><ul><li>Work directly with the Concept Office Manager, A-Team Innovation Chief, and Team X Lead Engineer, to coordinate the day-to-day business operations which include:process hardware and service requisitions, onboard external study participants, secure charge account number(s) from customer leads, issue Work Authorization Memos (WAMs) to study personnel, monitor staffing status of concept studies, review the utilization of facilities, conduct annual asset inventory reviews, process concept study business metrics, and maintain required concept study archive records.</li><li>Conduct financial analysis, which includes reviews of Plan vs. Actual and explanation of all variances on concept studies.</li><li>Develop study cost estimates and maintain cost reports for all concept studies supported by the Formulation Office.</li><li>Develop and maintain study metrics.</li><li>Collaborate with management and technical staff to resolve and document staffing plans, workforce forecast analysis, workforce reports, and suggest alternative solutions to staffing issues.</li><li>Provide financial oversight of all concept study costs and actuals, review and approve concept study cost estimates, and prepare budgets for all Concept Office concurrent engineering studies (approximately 125&#43; studies per year).</li></ul><p>Qualifications</p><ul><li>Typically requires a Bachelor’s degree in Business Administration, Finance, or related discipline with a minimum of 3 years of related experience; or Master’s degree in similar disciplines with 1 year of related experience.</li><li>Strong analytical and problem-solving skills.</li><li>Knowledge in one or more of the following areas: business administration, finance, workforce planning, or acquisitions.</li><li>Understanding and wide application of standard principles, theories, concepts and techniques in finance, budgeting, financial analysis and reporting.</li><li>Proficiency with Microsoft Office Applications such as Excel (advanced excel, macros,<br />pivot table, vlookup, etc.), Word and Powerpoint.</li><li>Ability to learn internal Concept Office study management system and database software for tracking and archiving studies.</li><li>Must have excellent interpersonal skills, professionalism and customer service.</li><li>Ability to work effectively in a dynamic environment with regular interruptions.</li><li>Strong professional characteristics: trustworthy, responsible, hardworking, intellectually curious individual who takes initiative and ownership of work.</li><li>Demonstrated ability to plan, prioritize, multi-task and complete complex and varied job functions and activities within discipline with minimal supervision.</li></ul><p><br />Preferred Skills:</p><ul><li>Wide breadth of knowledge of JPL policies, procedures, processes and financial systems. </li><li>Extensive administrative experience in the areas of financial analysis, budgeting, asset management, and workforce management. </li><li>Experience with ORACLE financials and requisition modules, as well as reporting tools such as COPA, Discoverer, IBT, CFMR, Project Scheduling and all JPL web applications.</li><li>Demonstrated ability to create and maintain reporting tools/systems to manage business metrics.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$83,304 - $101,400<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Business-Administrator-Level-II_R3831-1",
    "jobReqId": "R3831",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 25 Days Ago",
    "startDate": "2023-03-30",
    "timeType": "Full time",
    "title": "Business Administrator Level II"
  },
  "userAuthenticated": false
}
