{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Laser-Ranging-Interferometer--LRI--Instrument-Systems-Engineer-IV_R4528",
    "id": "4e57a7183d181001f582c0991ba50000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Tracking Systems and Applications Section (335) in the Communications, Tracking, and Radar Division (33) is currently looking to hire a Lead Instrument System Engineer for the Laser Ranging Interferometer (LRI) on the NASA Mass Change mission. This position reports to the Group Supervisor of 335F, the Gravity Sensing Instruments group.</p><p></p><p>As the Instrument System Engineer, you will participate in developing the Laser Ranging Interferometer (LRI) instrument, the primary payload on the NASA Mass Change mission.</p><p></p><p>The Mass Change mission is a NASA Earth Science Decadal Observable mission that measures the long-term movement of water on the earth to study climate change.  This mission will use the LRI to make precise measurements of the distance between two satellites to measure the changing gravity map of the earth.  Mass Change continues its very successful microwave-based predecessors, GRACE and GRACE Follow-on, the latter of which flew the LRI as a successful technology demonstration. Mass Change is a US/German partnership.</p><p></p><p><b>Responsibilities: </b></p><p>As the LRI Instrument System Engineer, you will participate and be responsible for the definition, architecture, development, and performance analysis of the LRI instrument. In this role, you will define, coordinate, balance and integrate technical and programmatic issues in an end-to-end manner to ensure that the total system satisfies the customer&#39;s requirements, expectations, and constraints within the allocated resources and with acceptable risk. You will develop and maintain system architectures, requirements, and interfaces; manage technical resources (mass, power, data, volume etc.); analyze and model the LRI design; verify and validate the instrument system; evaluate and manage risk and control the system change process. You will partner with other engineers on the LRI team and Mass Change Project personnel to accomplish highly complex system engineering tasks of significant impact. You will develop, negotiate, and document complex engineering requirements and interface agreements; perform analyses and trade studies of the LRI instrument; and adapt complex technical models to create improved products for the organization.</p><p></p><p>You will also use and apply advanced understanding of laser metrology principles to support the test definition and development of validation methods and analysis techniques during integration and testing of LRI; You will be responsible for presentations at peer and Project reviews. You will also work closely with the LRI team members in Germany, as part of the instrument is developed by <a href=\"https://www.google.com/url?sa&#61;t&amp;rct&#61;j&amp;q&#61;&amp;esrc&#61;s&amp;source&#61;web&amp;cd&#61;&amp;ved&#61;2ahUKEwjxl7eH6IyAAxUSOUQIHd18Du8QFnoECA4QAQ&amp;url&#61;https%3A%2F%2Fwww.dlr.de%2Fen&amp;usg&#61;AOvVaw1hbpY4Qwm4m3d5dls2-OEe&amp;opi&#61;89978449\" target=\"_blank\"><span>Deutsches Zentrum für Luft- und Raumfahrt </span></a>(DLR) and its subcontractors. You will be required to travel internationally for face to face technical interchanges and reviews. You will support integration and test (I&amp;T) both at JPL and internationally, and assembly, test, and launch operations (ATLO).</p><p></p><p><b>Required skills:</b></p><ul><li><p>Requires a Bachelor&#39;s Degree in Physics, Optical Engineering, Electrical Engineering, or related discipline with a minimum of 9 years of related experience; or a Master&#39;s degree in a related discipline with a minimum of 7 years of related experience; or PhD in a related discipline with a minimum of 5 years of related experience.</p></li><li><p>Wide-ranging experience and advanced knowledge in two or more of the following disciplines: experimental physics, laser stabilization, laser interferometry, phasemeter, electronics, control systems design, test and measurement, data analysis.</p></li><li><p>Extensive understanding and wide application of advanced principles, theories, concepts and techniques in laser systems design and analysis.</p></li><li><p>Excellent ability to read, analyze, and interpret common scientific and technical journals, customer specifications, and other technical documents.</p></li><li><p>Ability to communicate effectively and present technical information verbally to supervisors, managers, and customers.</p></li><li><p>Ability to write technical documents that conform to prescribed style and format.</p></li><li><p>Able to apply wide-ranging experience and advanced knowledge in technical disciplines stated above to provide leadership, oversight, and monitoring to an organization’s technical products, services, and/or capabilities; provides assessment of technical deliverables; resolves technical and resource issues.</p></li><li><p>Proven ability to work well in a team environment.</p></li></ul><p></p><p><b>Desired skills:</b></p><ul><li><p>Expert knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</p></li><li><p>Ability to work independently on key projects and assignments with only limited direction, typically receiving few or no instructions.</p></li><li><p>Significant skills to define problems, collect data, establish facts, and draw valid conclusions.</p></li><li><p>Advanced knowledge in optical system design, or laser interferometry, laser signal processing and analysis, and modeling techniques.</p></li><li><p>Broad hands-on experimental physics/engineering experience.     </p></li><li><p>Experience with any of the following: Matlab, C, C&#43;&#43; or Python, Labview and operating systems such as Windows and Linux</p></li><li><p>Experience leading teams and working with international partners.</p></li></ul><p></p><p>Section 335 conducts research, development, and flight missions in a wide range of technologies that are critical to spacecraft tracking and related applications for NASA and other Government Agencies. For planetary missions we provide the Deep Space Network (DSN) with the precision frequency and time distribution systems, and expertise, required for operations. For terrestrial and near-Earth users, the Section offers the highest accuracy Global Navigation Satellite Systems (GNSS)–based positioning and timing products and services. The Section leverages these capabilities to develop precision position determination systems for distributed spaceborne instruments and spacecraft formations, including the capability to perform detailed systems analysis for design and performance of these and other future tracking systems. Our Section is a world leader in space-based laser interferometry and laser metrology.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$143,312 - $183,248<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Laser-Ranging-Interferometer--LRI--Instrument-Systems-Engineer-IV_R4528",
    "jobReqId": "R4528",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 7 Days Ago",
    "startDate": "2023-07-14",
    "timeType": "Full time",
    "title": "Laser Ranging Interferometer (LRI) Instrument Systems Engineer IV"
  },
  "userAuthenticated": false
}
