{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Engineering-Development-Technician-II_R4709-1",
    "id": "df7d6edb07091000d2600109f5890000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The <b>Technical Inventory Management </b>group is an on-lab service organization that plans, procures, and manages wire and connector parts and accessories, fasteners, metals, ESD and clean room supplies, and flight hardware logistics services. We support every project phase from formulation through launch and beyond. Our materials are used to build some of the most innovative spacecraft in the universe.</p><p></p><p>As an <b>Engineering Development Technician </b><b>II</b> you will report directly to the Group Supervisor of the Technical Inventories Management and Flight Hardware Logistics Group. You will work alongside a talented group of engineers and technicians.</p><p></p><p>Will support the day-to-day operations –</p><ul><li><p>Operate basic metal cutting machines (ie – bandsaw).</p></li><li><p>Perform general housekeeping and basic machine maintenance.</p></li><li><p>Order, receive, and stock consumable cutting tools, raw metal stock, and fasteners.</p></li><li><p>Perform cycle counts to maintain accuracy of stock and prevent stockouts.</p></li></ul><p></p><p>******IMPORTANT*******<br />This position, because of its associated job duties, has been determined by JPL to be safety-sensitive as defined in JPL&#39;s Drug Free Workplace Requirement. An employee holding this position will be subject to periodic, unannounced, random drug testing. Please refer to JPL&#39;s Drug Free Workplace Requirement for more information. Candidates who are hired into designated safety-sensitive positions will be included in a pool from which individuals are randomly selected to participate in the unannounced drug testing.<br /> </p><p><b><u>Required Skills: </u></b></p><p></p><ul><li><p>Typically requires a High School diploma with 6 years of related experience or Associates with 1 year of related experience</p></li><li><p>Experience with cutting tools used in machine shops.</p></li><li><p>Experience with hand tools and measuring tools.</p></li><li><p>Inventory control experience.</p></li></ul><p></p><p><b><u>Desired Skills: </u></b></p><ul><li><p>Tool crib experience</p></li><li><p>Ability to read a drawing/blueprint  </p></li><li><p>Strong people skills</p></li><li><p>Experience using an ERP system for inventory management</p></li><li><p>Forklift experience</p></li><li><p>Familiarity with lean 6 sigma and 5S</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$66,248 - $84,032<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Engineering-Development-Technician-II_R4709-1",
    "jobReqId": "R4709",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-21",
    "timeType": "Full time",
    "title": "Engineering Development Technician II"
  },
  "userAuthenticated": false
}
