{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Staff-Assistant--Level-II_R4682",
    "id": "bbc5223b63e6100109f398530d9c0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p></p><p><span>The <b><span>Power Systems and Technology Section</span></b> is looking for a motivated and dedicated <b><span>Staﬀ Assistant, Level 2. </span></b>We are seeking a person that can provide administrative &amp; clerical support to technical groups within the Section and back‐up support to the Section Oﬃce. </span>This great opportunity requires solid customer service, strong organizational skills, and flexibility in the performance of the job! Looking for a motivated and collaborative teammate, diligent, with a willingness to learn. Will be a member of the Business Administration Group (3416) and report to the <b>Business Administration Manager.</b></p><p></p><p><b><i>The tasks for this position may include, but are not limited to:</i></b></p><ul><li>Providing office support to various technical groups in the section, while demonstrating the ability to maintain perseverance and composure in a dynamic work environment that includes interruptions and changing priorities.</li><li>Handling and coordinating large meetings for technical group members.</li><li>Process and prepare domestic and foreign travel itineraries, authorization requests, and expense reports.</li><li>Submitting material Procurement and Pcard orders</li><li>Maintaining conference room schedules</li><li>Assisting with timekeeping matters</li><li>Assisting with preparation of presentations and graphics, including proofreading, and editing</li><li>Excellent verbal and written communication skills</li><li>Assist with special events for the Section, such as workshops, conferences and/or morale events.</li><li>Providing back-up coverage for the Section Office and other groups as needed</li><li>Perform ad hoc duties as assigned.</li></ul><p></p><p><b>Qualifications </b></p><ul><li>Typically requires a High School diploma with a minimum of 6 years of related experience; Associate degree with a minimum of 1 year of related experience and related required training.</li><li>Proven understanding of general job aspects specifically in the <span>secretarial/administrative</span> support profession with strong interpersonal skills</li><li>Skilled in MS Office Suite (Word, Excel, PowerPoint, Outlook, etc.)</li><li>Consistent track record to work efficiently on multiple tasks while meeting commitments with high quality results and output.</li><li>Prioritize work and completing assignments accurately and in a timely manner.</li><li>Willingness to learn new technologies and tools to enhance and/or improve office procedures and processes.</li><li>Excellent written and verbal communication skills.</li><li>Motivated self-starter who takes the initiative to perform activities and resolve unusual or nonstandard problems.</li><li>Demonstrated ability to successfully handle discreet information.</li><li>Excellent customer service and teaming skills</li></ul><p></p><p> <b>Preferred Skills </b></p><ul><li>Understanding of JPL/ESD policies, procedures, and practices.</li><li>Experience with JPL tools such as JPLID, UCS, Concur Travel, and Timekeeping.</li><li>Knowledge of JPL procurement processes such as Purchase Requisition, P-Card and iProcurement.</li><li>Familiarity with the JPL-ID process and on-boarding of volunteers, affiliates, and foreign nationals.</li><li>Knowledge of JPL foreign and domestic travel policies and procedures.</li><li>Willingness to look for, learn, and apply new Information Technology (IT) tools to office procedures and processes (e.g. Wiki, SharePoint).</li><li>Teaming skills and professionalism in interfacing with all levels of personnel within and across multiple organizations</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$57,096 - $74,984<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Staff-Assistant--Level-II_R4682",
    "jobReqId": "R4682",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 16 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-15",
    "timeType": "Full time",
    "title": "Staff Assistant, Level II"
  },
  "userAuthenticated": false
}
