{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Undergraduate-Mass-Change-Mission-Systems-Engineering-APX-Intern_R4751",
    "id": "4112b9df97be1001b21e3fb1b1c00000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><h2><b>Responsibilities:</b></h2><p>If you are passionate about spacecraft design, we invite you to join the <b>Spacecraft Systems Engineering &amp; Behaviors</b> <b>Section (313)</b>. We provide systems engineering for the design and implementation of spacecraft for the laboratory&#39;s key flight projects. Our work spans spacecraft systems engineering, payload systems integration, electrical systems integration, fault protection and autonomy design, and landing systems design.</p><p></p><p>We are seeking a highly motivated and experienced <b>Systems Engineering Intern (Academic Part-Time)</b> to join the <b>Flight System Systems Engineering Group (313E)</b>, reporting administratively to the Technical Group Supervisor and programmatically to the Mass Change FSSE Lead. Your initial assignment will be to serve as an FSSE intern on Mass Change.</p><p>You will work independently and within a team environment, collaborating on tasks performed across a spectrum of disciplines and have excellent writing and oral presentation skills.</p><h2><b>Tasks may include but not limited to:</b></h2><ul><li>Develop processes and documentation for the spacecraft alignments plan. This plan is required to ensure the two spacecraft and their sensors are aligned sufficiently to meet science objectives. This work will include formalize detailed mechanical alignment measurement and reporting processes, including visualization of alignment reference frame geometries in a CAD program (preferably Solidworks).</li><li>Creating templates and scripts to support generation of systems engineering documentation from the systems requirements tool (JAMA). This will include learning to use REST API processes in Python, Java, or C 3. Creating additional automation scripts to utilize with Smartsheet to enable systems engineering analysis and communication. This will include learn to use Python or JavaScript or Visual Basic as described in the Smartsheet API.</li></ul><h2><b>Qualifications:</b></h2><ul><li>Must be currently enrolled in a college or university pursuing a Bachelor’s degree in an Engineering, Physics, or technical major related to work assignment</li><li>Must have at least 1 semester or quarter remaining to complete degree</li><li>Must have a minimum cumulative 3.0 out of a 4.0 GPA or equivalent</li><li>Ability to support ~20 hours per week, largely during core work hours (9am - 5pm Pacific Time) with a hybrid on-lab work schedule.</li><li>Familiarity with SolidWorks</li><li>Basic programming experience</li><li>Excellent organization skills and attention to detail</li></ul><h2><b>Preferred Skills:</b></h2><ul><li>Familiarity with JPL processes and the Mass Change project</li></ul><p></p><p>Note: The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Undergraduate-Mass-Change-Mission-Systems-Engineering-APX-Intern_R4751",
    "jobReqId": "R4751",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 2 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-09-07",
    "timeType": "Part time",
    "title": "Undergraduate Mass Change Mission Systems Engineering APX Intern"
  },
  "userAuthenticated": false
}
