{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technical-Group-Supervisor--Records-and-Archives-Group-_R4570",
    "id": "c9a1e72849c110020251cff2d5a30000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p></p><p>The <b>Enterprise and Information Systems Engineering Section</b> provides safe and effective cross-cutting information management and engineering processes, tools, and services specially designed to serve the needs of the Laboratory’s scientists, engineers, and technicians. In addition, the section provides information management, software and hardware configuration management, cyber defense engineering and research, human system integration, tool chain development and management, library, records, and archival services. The section also provides leadership in enterprise systems engineering, encompassing the collection of systems, processes, data, and information that enable JPL to serve the nation by exploring space to pursue discoveries that benefit humanity.</p><p></p><p>We seek a strategic and innovative leader as<b> Group Supervisor</b> to join our team of the <b>Records and Archives group in the Enterprise and Information Systems Engineering Section </b>and work with the Section Management team.</p><p></p><p>The Supervisor will provide team leadership, mentorship, and direction to ensure that JPL meets NASA and Caltech requirements for the retention and disposition of Laboratory records, including preserving significant records for future engineers and our nation’s history.</p><p></p><p> The role includes the following responsibilities:</p><ul><li><p>Managing a team of 10 to 15 that includes the JPL Records Manager, records management specialists, and archivists, ensuring that JPL meets NASA and Caltech requirements for managing records that capture the Laboratory’s projects and business.</p></li><li><p>Responsible for continuous process improvement, setting goals, and achieving them.</p></li><li><p>Ensuring employee awareness and compliance with Laboratory policies, procedures, and regulatory requirements.</p></li><li><p>Knowing and applying appropriate tools, processes, and procedures affecting areas of responsibility.</p></li><li><p>Having regular access to and management of ITAR/EAR-controlled technical data.</p></li><li><p>Evaluating work opportunities and assigning team members, balancing customer needs with employee experience while promoting the career growth of team members.</p></li><li><p>Responsible for hiring and retaining a diverse, highly qualified staff and providing career coaching, growth, and professional development for direct-report JPL employees.</p></li><li><p>Being accountable for the performance of employees and the work output of managed subcontractors.</p></li><li><p>Ensuring the quality of the team’s products and overall performance.</p></li><li><p>Applying sophisticated information science, archival, and/or records management principles to ensure success in areas of responsibility.</p></li><li><p>Maintaining a safe working environment and a strong customer focus.</p></li><li><p>Representing the group charter, interests, and personnel in section, division, and directorate meetings or discussions and collaborating with the management teams at all levels to advance the interests of the group and section. </p></li><li><p>Managing the Records and Archives budget.</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree or higher in information science, records management, knowledge management, archival science, or a related discipline. Minimum degree and typical years of relevant experience include a Bachelor’s with 9 years of related experience, a Master’s degree with 7 years of related experience, or a Ph.D. with 5 years of related experience.</p></li></ul><p></p><p>A successful candidate will also have the following required skills:</p><ul><li><p>A minimum of 2 years of lead experience, with a demonstrated ability to lead individuals with diverse backgrounds in various records specialist or archivist roles.</p></li><li><p>Wide-ranging experience and advanced knowledge in one or more related fields, including information management, records management, archiving, or information sciences and technology.</p></li><li><p>Ability to work effectively in highly dynamic environments.</p></li><li><p>Ability to solve problems that are multidimensional and cross-disciplinary.</p></li><li><p>Ability to coordinate and collaborate efficiently in a diverse team environment.</p></li><li><p>Ability to work across diverse technical organizations, including industry, academia, foreign partners, etc., understanding and capturing unique requirements and challenges.</p></li><li><p>Proficiency in decision-making, delegation, and managing change.</p></li><li><p>Demonstrated ability to collaborate to promulgate information science, archival, and/or records management principles.</p></li><li><p>Extensive experience and proven understanding of various digital document repositories, document management, and/or digital asset management systems, including administration, evaluation, and recommendation of these systems.</p></li><li><p>Expertise in leading teams and/or projects that involve the improvement of analog and electronic records management processes</p></li><li><p>Demonstrated experience developing and maintaining close working relationships with individuals, organizations, and projects.</p></li><li><p>Team building skills, excellent verbal and written communication, and effective presentation and negotiation skills.</p></li><li><p>Be a forward-thinking leader with a history of success and discipline in planning, execution, and implementation.</p></li><li><p>Experience in planning budgets, workforce, and estimating the cost to accomplish work.</p></li><li><p>Proficiency in decision-making, delegation, and managing change.</p></li><li><p>Outstanding customer service skills.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Puts the needs of our employees first and helps people develop and perform as highly as possible.</p></li><li><p>Complete knowledge of Laboratory and NASA policies, procedures, and government regulations across various applications.</p></li><li><p>Experience in managing JPL projects and tasks of a significant magnitude, including a working understanding of JPL planning, monitoring, and project control processes.</p></li><li><p>Experience in an applied research environment.</p></li><li><p>Interest in and experience with organizational change management, process definition, and process improvement.</p></li><li><p>Demonstrated experience with line management in a matrix organization.</p></li><li><p>Considered an expert in information sciences and technology or a related discipline.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$107,224 - $148,720<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Technical-Group-Supervisor--Records-and-Archives-Group-_R4570",
    "jobReqId": "R4570",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-07-31",
    "timeType": "Full time",
    "title": "Group Supervisor (Records and Archives Group)"
  },
  "userAuthenticated": false
}
