{
  "jobPostingInfo": {
    "id": "ddf5bd0d8fa21001c26272edf9600000",
    "title": "Ombuds – Office of the Director",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Position Overview </b></p><p>Reporting to the Deputy Director of JPL, the <b>JPL Ombuds</b> is designed to act as a neutral party supporting a fair and impartial process for all JPL employees seeking its services. The Ombuds does not take sides in any conflict, dispute or issue; the role’s objective is to facilitate communication between parties, consider the interests and concerns of all parties in a dispute, and aim for solutions that are fair, equitable, and consistent with the ethics of JPL and Caltech. JPL Ombuds suspends judgment while facilitating and advocating for a fair process, rather than advocating for any one individual.</p><p></p><p>The JPL Ombuds Program is established to provide JPL employees with an informal, independent, confidential, and neutral channel for conflict management, education, and issue resolution. The role complements, supports, and does not duplicate any formal resolution processes already established at JPL. The Ombuds Program is not an investigatory, decision making, or disciplinary role.</p><p></p><p>The Ombuds handles confidential and sensitive issues. In addition to helping individuals, the Ombuds provides the organization with trend information to help management act proactively to address issues and improve culture.</p><p></p><p> <b>Job responsibilities:</b></p><ul><li><p>Acts as an employee resource for confidential discussions and provides consultation and referral to JPL programs and offices as appropriate.</p></li><li><p>Acts as an independent resource, remaining neutral and impartial, while exercising good judgement - listens to concerns and discusses appropriate options for resolution. Seeks to identify processes and solutions that are fair and equitable to all parties.</p></li><li><p>Assists employees with concerns and issues by helping to generate options for resolution.</p></li><li><p>Provides guidance and support for conflict resolution skills and effective communication to assist employees with resolving problems on their own.</p></li><li><p>Refers any policy-based issues, concerns, or recommendations to the appropriate JPL offices, directorates, or resources.</p></li><li><p>Provides an annual aggregated report to the JPL Director, using anonymized data, information, and statistics regarding their interactions within the scope of the JPL Ombuds Program.</p></li><li><p>Keeps secure records in accordance with the recommendations from the International Ombudsman Association.</p></li><li><p>Engages in ongoing training provided by the International Ombudsman Association and other sources, including in areas of counseling, implicit and explicit bias, principles and practice of diversity, equity, inclusion and general employee support.</p></li><li><p>Refers third party or court-ordered requests for documents, information, or testimony to the Caltech/JPL Office of General Counsel for guidance.</p></li><li><p>The JPL Ombuds does not serve as a formal receiving notice, investigate or manage inquiries on behalf of JPL, advocate on behalf of any individual, or adjudicate, impose remedies or make any decisions regarding matters (this includes enforcing or changing JPL policies).</p></li><li><p>The Ombuds does not serve as an agent of notice for JPL/Caltech.</p></li></ul><p></p><p><b>Knowledge and Skills:</b></p><ul><li><p>Master&#39;s degree with a minimum of 7 years of experience in a related field and previous experience as an Ombuds.</p></li><li><p>Must have or be eligible for membership in the International Ombudsman Association and adhere to its Code of Ethics and Standards of Practice.</p></li><li><p>Working knowledge of privacy, public information, and employment laws, including those involving the handling of information and communications of a confidential and sensitive nature.</p></li><li><p>Advanced interpersonal skills to adapt to diverse personalities and interactions styles, while gaining trust and working with others in sensitive and difficult situations to resolve conflict.</p></li><li><p>Ability to build rapport throughout the organization</p></li><li><p>Comfortable and effective in presenting to individuals and groups</p></li><li><p>Outstanding verbal and written communication skills</p></li><li><p>Proven ability to handle confidential and sensitive issues, information and to communicate with discretion.</p></li><li><p>Ability to consider all sides of an issue and behave neutrally; recognizes when bias may exist and recommends other options to support the employee needs.</p></li><li><p>Ability to work independently and use good judgment</p></li><li><p>Acts with integrity in all situations</p></li></ul><p></p><p><b>Preferred Qualifications:</b></p><ul><li><p>Experience in Ombuds role with training via the International Ombudsman Association and/or Certified Organizational Ombudsman Practitioner (CO-OP) status preferred.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$125,736 - $167,232<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-28",
    "timeType": "Full time",
    "jobReqId": "R3676",
    "jobPostingId": "Ombuds---Office-of-the-Director_R3676",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Ombuds---Office-of-the-Director_R3676"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Program Communications Manager: Mars Sample Return",
      "externalPath": "/job/JPL-Campus/Senior-Program-Communications-Lead---Mars-Sample-Return_R3417",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-12"
    }
  ],
  "userAuthenticated": true
}
