{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/HR-Generalist--Benefits---Systems--Temporary-_R4389",
    "id": "753d3026a57c1001c169e869a9d20000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Summary:</b></p><ul><li><p>Responsible for the development, implementation, administration and evaluation of a variety of human resources programs, policies, processes and services.</p></li><li><p>Partners with Laboratory Organizations on strategic issues relating to talent management, organizational assessment, employee relations, legal compliance, change management, and organizational design.</p></li><li><p>Responsible for resolving complex HR issues related to HR/HRSC programs that include but are not limited to Talent Acquisition, Talent Management, Compensation, Benefits, Learning and Organizational Development, Technical Training, LOA and People Services.</p></li><li><p>Conducts trend analysis using case management data.</p></li><li><p>Provides input on HR policies and programs to functional HR organizations and management.</p></li><li><p>Consults with employees and management to resolve inquiries and escalates issues as necessary.</p></li><li><p>Provides administration for specific HR programs that include but are not limited to Tuition Reimbursement, Relocation, Award and New Employee Orientation.</p></li><li><p>Provides project management and administrative support for the projects and programs within the HR Service Center.</p></li></ul><p></p><p><b>Job Description: </b></p><ul><li><p>Provide subject matter expertise in AskHR regarding topics such as benefits enrollment, life events, and retiree benefits, and records and data management and other HR services.</p></li><li><p>Integral role in annual Benefits Open Enrollment and post Open Enrollment audits and corrections. </p></li><li><p>Presentation of New Employee Benefits Orientation to new employees.</p></li><li><p>Oversight of the JPL Interim Employment Program and annual audit.</p></li><li><p>Functional point of contact for Workday-Core HR configuration, and testing.</p></li><li><p>Responsible for case management system annual upgrades, in partnership with the vendor.  Responsible for case management SLA, reporting, trend analysis, and reporting.</p></li><li><p>May assist with the Affirmative Action Plan and EEO-1 reports.</p></li><li><p>May produce, review, and manage reporting metrics and analytics. Presents reports as requested.</p></li><li><p>May assist with other HR supported systems, programs such as Awards, Learning Management System.</p></li><li><p>Interface with various levels from Executive Management to employees in addressing individual and programmatic needs.</p></li><li><p>Update job aids and other documentation used by the team.</p></li><li><p>Analyze and resolve employee and manager complex questions on various HR related issues.</p></li><li><p>Respond and resolve Tier 1 escalated issues that require research and case management.</p></li><li><p>Work with internal and external resources to research and resolve employee issues and problems, and escalate complex inquiries as necessary to Centers of Expertise subject matter experts.</p></li><li><p>Utilize case management system to process, document and resolve inquiries.</p></li><li><p>Assist employees with navigation of HR sites, and inform employees and management on human resources policies, guidelines, processes, and procedures.</p></li><li><p>Advise employees on the completion of employment/human resources related forms and online human resources systems (e.g. benefits); verifies eligibility and accuracy.</p></li><li><p>Assist AskHR HR Customer Support (Tier 1) during peak periods.</p></li><li><p>Perform various other duties as required.</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Typically requires Bachelors with 3 years of related experience, Masters with 1 years of related experience, or PhD with 0 years of related experience</p></li><li><p>Excellent customer focused communication skills (patience, attentiveness, courtesy).</p></li><li><p>Strong interpersonal skills and team based orientation.</p></li><li><p>Excellent written &amp; oral communication skills.</p></li><li><p>Demonstrated ability to respond to common inquiries or complaints from customers.</p></li><li><p>Ability to maintain confidentiality and discretion in daily work.</p></li><li><p>Demonstrated ability to analyze and solve problems to achieve first call resolution.</p></li><li><p>Ability to work and problem solve independently utilizing available resources and tools.</p></li><li><p>Strong written communication skills in order to respond to customer inquiries or document issues in the case management tool as the system of record.</p></li><li><p>Experience with online HRIS and other types of HR systems.</p></li><li><p>Excellent analytical skills and the ability to spot anomalies and trends.</p></li><li><p>Detail-oriented with good organizational skills.</p></li><li><p>Flexible and able to effectively prioritize and balance competing <span>priorities working</span> in a fast-paced team environment.</p></li><li><p>Familiarity with reporting tools.</p></li><li><p>Proficiency in Microsoft Office Suite including Outlook, Word, Excel, and PowerPoint.</p></li><li><p>Ability to consult and advise customers and management as a subject matter expert.</p></li><li><p>Excellent relationship management skills.</p></li></ul><p></p><p><b><span>Preferred Qualifications</span></b></p><ul><li><p>3&#43; years of HR experience.</p></li><li><p>HR certification.</p></li><li><p>Technical computer proficiency including Workday, HR Solution Center software applications, and disability management tracking system.</p></li><li><p>Experience creating, running and <span>validating reports</span> in Workday or other HRIS systems.  </p></li><li><p>Capability to create metrics and dashboards in Workday or other HRIS systems. </p></li><li><p>Strong written communication skills in order to document issues in the case management tracking tool as the system of record.</p></li></ul><p></p><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$78,208 - $97,552<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "HR-Generalist--Benefits---Systems--Temporary-_R4389",
    "jobReqId": "R4389",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 11 Days Ago",
    "startDate": "2023-06-01",
    "timeType": "Full time",
    "title": "HR Generalist- Benefits & Systems (Temporary)"
  },
  "userAuthenticated": false
}
