{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Planning-and-Sequencing-Operations-Systems-Engineer-II---397B_R4635",
    "id": "7b80074bcd971000cb9aa3a3955c0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><h2>Responsibilities:</h2><p>The Planning and Execution Systems Section (397) provides end-to-end project lifecycle support for Planning and Execution Systems including research, concept and formulation, mission operations development and execution, software system development, and operations leadership in planning, sequencing and subsystem performance analysis.</p><p></p><p>We are seeking a highly motivated Systems Engineer Level 2 to join the <b>Integrated Planning and Sequencing for Surface Missions Group (397B) </b>who will report administratively to the Technical Group Supervisor and programmatically to the Mars 2020 Engineering Operations Team Chief. You will be the Sequence Integration Engineer (SIE) Role lead managing the Mars 2020 SIE Operations team as well as performing additional uplink roles.</p><p></p><h2>Tasks may include but are not limited to:</h2><ul><li><p>Development, integration, validation and review of the sequences and command products that will be uplinked to the spacecraft.</p></li><li><p>Perform planning and sequencing operations including activity plan and sequence review, activity conflict resolution, generating flight command products, and supervising maintenance activities.</p></li><li><p>Will also be involved with software testing, procedure and process improvement efforts.</p></li><li><p>Will be providing work direction and leadership to team personnel.</p></li><li><p>Will be responsible for training of new SIE team members and ongoing training of existing team members.</p></li><li><p>Collaborate with software developers to maintain and improve SIE tools.</p></li></ul><p></p><h2><b>Qualifications:</b></h2><ul><li><p>Bachelor’s degree in Engineering, Physics, Mathematics, or related subject with a minimum of 3 years of professional experience, or Master’s degree with a minimum of 1 year of experience, or Ph.D. with no professional experience.</p></li><li><p>Proficiency in spacecraft mission operations.</p></li><li><p>Strong mediation, organizational, interpersonal, oral, presentation, and written communication skills.</p></li><li><p>Ability to interact effectively across multiple subject areas.</p></li><li><p>Ability to balance multiple issues, tasks, and priorities concurrently.</p></li><li><p>Proven teammate with ability to build consensus working with diverse technical teams.</p></li></ul><p></p><h2><b>Preferred Skills: </b></h2><ul><li><p>General understanding and application of standard principles, processes, concepts and techniques in mission operations and system engineering as it pertains to flight projects.</p></li><li><p>Knowledge of the functions and operations of spacecraft subsystems and instruments.</p></li><li><p>Experience in developing procedures, processes, tools, and requirements</p></li><li><p>Ability to prioritize work to meet commitments with high quality products.</p></li><li><p>Excellent problem-solving skills.</p></li><li><p>Knowledge of applicable industry and/or academic practices and standards in the generation and validation of flight system activity plans and the application of system engineering practices</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$102,752 - $125,216<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Planning-and-Sequencing-Operations-Systems-Engineer-II---397B_R4635",
    "jobReqId": "R4635",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-07",
    "timeType": "Full time",
    "title": "Planning and Sequencing Operations Systems Engineer II - 397B"
  },
  "userAuthenticated": false
}
