{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Enterprise-Governance-Project-Manager-V_R2713-1",
    "id": "a31da3c015fb1001f7aaa7254b850000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>Do you have a passion for space exploration and enterprise transformation? Are you a strategic leader and enjoy the challenge of enterprise system development from formulation to implementation?</span></p><p></p><p><span>We are looking for an experienced and motivated Systems Engineer to join our team in the <b>Enterprise Operations and Transformation Office (EOTO) </b>directly reporting to the </span><span>Enterprise Governance &amp; Strategic Operations Planning Office. The office develops and oversees enterprise level projects and improvements supporting enterprise governance and strategies within the overall enterprise operation and transformation office. We are looking for people that are excited and passionate about helping improve JPL&#39;s enterprise structure, tackling projects, concepts, and change management efforts.   If this sounds like the challenging opportunity you are looking for – then we want to talk to you!</span></p><p></p><p><b><span>Key Responsibilities:</span></b></p><p><span>This Enterprise Governance Project Manager V is responsible for managing and delivering on projects within the Enterprise Governance &amp; Strategic Operations Planning Office. Key responsibilities may include:</span></p><ul><li>Accountable for day-to-day leadership of projects in support of defining and operationalizing JPL’s Enterprise Governance structures.</li><li>Partner across a broad range of functional stakeholders to identify and mature operational processes and tools in support of Enterprise Governance; assessing effectiveness of existing solutions and leading design of solutions for areas of improvement.</li><li>Research and assess industry best practices in enterprise governance for adoption at JPL.</li><li>Performs directly or leads the generation, approval and issuance of the Project Plan</li><li>Maintains regular and frequent communications meetings with the project stakeholders and affected organizations.</li><li>Acts as point of contact to senior management relative to assigned projects. </li><li>Reviews and reports regularly on the technical, schedule and financial status of the project or project component.</li><li>Assures the quality, accuracy, and integrity of the project deliverables in compliance with JPL standards and project plans and policies.</li><li>Collaborate with peers across EOTO to integrate changes to governance structures and/or supporting tools into the Laboratory’s broader ecosystem.</li><li>Ensures that project-related knowledge gained during the planning and implementation of the project is collected to be shared with future project management personnel.</li></ul><p></p><p><b><span>Skills and Qualifications:</span></b></p><ul><li>Requires a Bachelor’s degree (preferably in STEM related discipline) with a minimum of 12 years of related experience or a Master’s degree with 10 years of related experience or a PhD with 8 years of related experience. </li><li>Experience in participating in process improvement initiatives impacting multiple organizations and systems. </li><li>Thorough understanding of project management concepts and practices. </li><li>Demonstrated experience in leading, coordinating, and working in a collaborative environment with a broad range of internal and external stakeholders, technical experts, and customers.</li><li>Experience collaborating and building consensus across all levels of an organization from senior management to individual contributors.</li><li>Proven ability to research, gather information, and recommend solutions to fit the strategic vision and organizational needs</li><li>Proven ability to develop, budget, maintain, and deliver against a project plan for all aspects of assigned projects.</li><li>Excellent interpersonal skills, both oral and written required.</li><li>Excellent time management skills, the ability to work multiple projects at once and work in a fast-paced, ever-changing environment</li><li>Ability to exercise independent judgement, discretion, and confidentiality</li><li>Ability to develop solid relationships and collaboration skills at all levels of the organization</li><li>Experience with metrics definition, collection, analysis, improvement, and reporting.</li></ul><p></p><p><b><span>Preferred Qualifications:</span></b></p><ul><li>Experience with enterprise transformation initiatives that focus on improving efficiency of systems, productivity of workforce, consistency of execution, and producibility of outcomes.</li><li>Demonstrated experience with developing new innovative technologies and innovations, pilots and prototypes, and evaluating emerging technologies.</li><li>Experience with managing strategic drivers such as changing internal/external environments, changing business base, and changing workforce.</li><li>Demonstrated experience in program and project portfolio management.</li><li>Thorough understanding of JPL’s Policies, flight project, and enterprise practices.</li><li>Comprehensive knowledge of JPL organizations and functions.</li></ul><p></p><p>New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p></p><p>Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$159,328 - $196,144<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Enterprise-Governance-Project-Manager-V_R2713-1",
    "jobReqId": "R2713",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-22",
    "timeType": "Full time",
    "title": "Enterprise Governance Project Manager V"
  },
  "userAuthenticated": false
}
