{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Cognizant-Engineer-for-Long-Range-Processing-Unit_R4720",
    "id": "eedf8c71f1f11000ce3c39026c230000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Mass Change mission is a NASA Earth Science Decadal Observable mission which measures the long-term movement of water on the earth to study climate change.  This mission uses a Laser Ranging Interferometer (LRI) to make precise measurements of the distance between two satellites to measure the changing gravity map of the earth.  This mission continues its very successful microwave-based predecessors, GRACE and GRACE Follow-on, with an order of magnitude improvement in accuracy of the measurement thanks to its successfully proven laser interferometry technique. The Mass Change mission is a NASA-DLR partnership where part of the instrument is contributed by DLR.  We are seeking a Cognizant Engineer (CogE) to lead the Laser Ranging Processing (LRP) development based on the flight-proven LRP design on GRACE Follow-on mission.</p><p></p><p><b><u>Responsibilities:</u></b></p><p>As the LRP CogE for the Mass Change mission in the Gravity Sensing Instruments (GSI) Group, you will report to the GSI group supervisor administratively, and to the Mass Change (MC) Laser Ranging Interferometer (LRI) Instrument Manager for technical direction.   </p><p>You will be responsible for, but not limited to the following tasks:</p><ul><li><p>Leadership of the LRP team comprised of software, hardware and firmware engineers.</p></li><li><p>Development, build, test, and delivery of the 2 Engineering Models (EMs) and 5 Flight Models (FM) of the LRP assemblies.</p></li><li><p>Meeting Level 4 LRP requirements as well as conforming to the environmental and interface requirements as set in the Mass Change Environmental Requirements Document (ERD) and spacecraft to LRI Interface Control Document (ICD).  </p></li><li><p>Organize, plan and document LRP interfaces, working closely with the LRI’s System Engineering team and Flight System representatives</p></li><li><p>Work with the LRI testbed team to integrate and test the LRP EM</p></li><li><p>Oversee and coordinate grounding scheme, and design and plan electronics, for the needed LRP electrical ground support equipment (EGSE)</p></li><li><p>Oversee assembly of the LRP EGSE</p></li><li><p>Oversee test plans and procedures for the LRP testing</p></li><li><p>Closely coordinate structural, thermal, packaging design and analyses with Section 356 and harness design with Section 352</p></li><li><p>Lead the preparation of all LRP reviews, documentation and hardware deliveries to LRI I&amp;T and testbed</p></li><li><p>Work with the LRI team to support LRI level reviews</p></li><li><p>Participate in LRI planning of the instrument Integration and Test</p></li><li><p>Assist LRI integration and test (I&amp;T) coordination, planning and preparation.  Participate in the integration, test, delivery, and assembly, test, launch, and operations (ATLO) activities.</p></li><li><p>Prepare and report on budgets and schedules for the design, build, and test of of the LRP in coordination with the rest of the LRI team</p></li><li><p>Help with staffing of the LRP team when needed</p></li><li><p>Participate in a variety of LRP and LRI coordination meetings every week, including with our international partners in the instrument and spacecraft. </p></li><li><p>This position will require international travel</p></li></ul><p></p><p><b><u>Qualifications:</u></b></p><ul><li><p>Bachelor&#39;s degree in Electrical Engineering, or related technical discipline with a minimum of 12 years of related experience; or a Master&#39;s degree in similar disciplines with a minimum of 10 years of related experience; or PhD in similar disciplines with a minimum of 8 years related experience</p></li><li><p>Has multidisciplinary and in-depth expertise in hardware design</p></li><li><p>Has significant experience in leading technical teams and is accountable for team results on   multifunctional and/or multidisciplinary projects and assignments, including performance standards, budget and schedule.</p></li><li><p>Has multidisciplinary experience and expert knowledge in designing digital processing assemblies for space applications</p></li><li><p>Has wide-ranging experience and advanced knowledge in hardware development, for the complete lifecycle phases of design, implementation, integration, and test</p></li><li><p>Multidisciplinary and in-depth expertise regularly used in the application and development of advanced principles, theories and concepts in digital timing and real-time processing systems for space applications</p></li><li><p>Excellent oral and written communication skills relating to leading team meetings, producing quality documentation, reporting to management and presenting at reviews,</p></li><li><p>Able to exercise discretion and independent judgment in evaluating potential approaches and solutions to new and unusual problems with organization- wide impact and determining appropriate resolutions.</p></li><li><p>Is able to work on major assignments and projects without appreciable direction, typically exercising considerable latitude in determining objectives.</p></li></ul><p></p><p><b><u>Desired Qualifications:</u></b></p><ul><li><p>Experience in digital hardware design</p></li><li><p>Prior experience on a JPL space flight project</p></li><li><p>Has expert knowledge of industry and/or academic practices and standards across a range of applications.</p></li><li><p>Has expert knowledge  of laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications</p></li><li><p>Experience in flight support equipment, integration and validation</p></li><li><p>Experience in optical interferometry</p></li><li><p>Has significant expertise in one or more related fields of knowledge.</p></li><li><p>Recognized Laboratory expert in field of knowledge.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$176,904 - $219,960<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Cognizant-Engineer-for-Long-Range-Processing-Unit_R4720",
    "jobReqId": "R4720",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 17 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-29",
    "timeType": "Full time",
    "title": "Cognizant Engineer for Laser Ranging Processor Unit on Mass Change"
  },
  "userAuthenticated": false
}
