{
  "jobPostingInfo": {
    "id": "d2416af1eefe1000d6088ab2de960000",
    "title": "Program Area Manager V/VI, Earth Information and Data Technology Office (8150)",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>Will be the Program Area Manager for the Earth Information and Data Technology Office reporting to the Director For and Deputy Director For the Earth Science and Technology Directorate. Will be responsible for developing, implementing, and maintaining strategic plans for information systems that support the Directorate’s strategic plans, roadmaps, and objectives.<span>  </span>Will develop and manage a portfolio of information systems projects, tasks, research activities, and capabilities for NASA ESD and non-NASA customers and sponsors.<span>  </span>Will develop an information systems strategic plan that advances key capabilities in data processing, data management, data science including telemetry (e.g. instrument and spacecraft) and analytics, and multi-platform and/or multi-sensor data, data fusion, computing, intelligent onboard instruments, AI/ML for ground and space, Earth system modeling, and data science-based mission and science requirements.<span>  </span>Will develop and manage external partnerships in information systems with NASA ESD/ESTO, NASA Centers, academia, government agencies, commercial entities and federal research laboratories.<span>  </span>Will be responsible for establishing the technology maturation process including formulation, implementation, and infusion for research and missions.<span>  </span>Will lead the capture of opportunities in information system development from NASA ESD and reimbursable areas.<span>  </span>Will coordinate with select JPL line organizations for required expertise and skills to obtain the stated objectives of the office.</span></p><div></div><p><b>The following qualifications are required: </b></p><p>Bachelor’s degree in Computer Engineering, Computer Science or related technical discipline with typically a minimum of 12 years of related experience; Master’s degree is similar disciplines with a minimum of 10 years related experience; or a PhD in similar disciplines with a minimum of 8 years related experience.  Recognized laboratory and external expert or authority with demonstrated superior multidisciplinary knowledge and experience in project and program management, including experience in leading project teams; extensive experience in cost and schedule estimation and cost control.  Excellent leadership, interpersonal, and verbal and written communication skills, with ability to interface effectively with all levels of program/project management, JPL senior and executive management, technical and business organizations, subcontractors, international partners, other NASA centers, the NASA sponsor, and other government agencies.  Proven track record as a team leader, accountable for team results at all levels on multiple critical projects and assignments with Laboratory-wide impact.  Demonstrated ability and initiative to identify, apply sound judgement in prioritizing, and leading teams to resolve complex problems.  Demonstrated ability to manage proposal development and to develop new program with the NASA sponsor and other government agencies.  Knowledge of NASA’s Earth Science Division and Science Mission Directorate objectives, programs, projects and policies.   Experience in JPL line management, broad systems engineering expertise, and proven experience with successful delivery of IT products. <span>Knowledge of industry and university research and capability, and proven experience in forming partnerships.</span></p><p></p><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><p><b>Note: This position may be classified at one level higher than the posted level. A determination will be made once the final candidate has been identified.</b></p><div><div><div><div><div><div><div><div>The typical full time equivalent annual hiring range for this job at a level higher in Pasadena, California. $220,688 - $291,824</div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$192,296 - $245,544<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 29 Days Ago",
    "startDate": "2023-02-13",
    "timeType": "Full time",
    "jobReqId": "R2429",
    "jobPostingId": "Program-Area-Manager-V-VI--Earth-Information-and-Data-Technology-Office--8150-_R2429-1",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Program-Area-Manager-V-VI--Earth-Information-and-Data-Technology-Office--8150-_R2429-1"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
