{
  "jobPostingInfo": {
    "id": "32bbf743df711001b4492ceb67b60000",
    "title": "Entry Level Software Systems Engineer",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>This opportunity will be in the Information and Technology Solutions Directorate (ITSD) under the Application Consulting, Development and Engineering Section and will report directly to the Group Supervisor for the </span><span>Information Technology Systems Engineering, Design, and Development </span><span>Group (172A). </span></b></p><p></p><p><b><span>As a Software Systems Engineer your task is to look at a system, or subsystem, and identify the requirements for and from it, make sure it meets those requirements, make sure it is built to those requirements, make sure it is integrated to those requirements, make sure it operates to those requirements, and prove all of those things.  </span><span>You will be the voice of the system throughout the product development life cycle, providing critical thinking </span><span>about tradeoffs and compromises, about generalists view of the system versus specialists view.</span></b></p><p><b><span>You will, first and foremost, be responsible for getting the right design -- and then about maintaining and enhancing its technical integrity, as well as managing complexity with good processes to get the design right. You will define the interfaces in a system design to minimize unintended interactions and simplify development and operations-- and then document and control the design.  </span></b></p><p></p><p><b><span>We value excellent communication skills, agility in adapting to change and proven success in working with high-performing teams.</span></b></p><ul><li><p><b><span>Develop viable requirements for highly complex and critical software system architectures. Ensure system is achievable within available resources and project timeline; ensures that requirements are met; advises management</span></b></p></li><li><p><b><span>Design and define system architecture for new or existing highly complex and critical computer-based systems.</span></b></p></li><li><p><b><span>Lead design effort; establish design patterns and rules; research and apply best industry practices.</span></b></p></li><li><p><b><span>Develop highly complex and critical software and data architectural models; uses current practice and recommend improvements.</span></b></p></li><li><p><b><span>Serve as a liaison to the customer throughout the entire system life cycle; advise customer and management.</span></b></p></li><li><p><b><span>Develop prototypes and storyboards to validate user requirements.</span></b></p></li><li><p><b><span>Maintain system integrity by assessing and determining stable steps in development.</span></b></p></li><li><p><b><span>Establish and implement highly complex and critical system software life cycle processes; advises customers and management</span></b></p></li><li><p><b><span>Partner with other engineers and management to oversee highly complex and critical system integration.</span></b></p></li><li><p><b><span>Verify and approve highly complex and critical test plans.</span></b></p></li><li><p><b><span>Lead the evaluation, modification and improvements to the testing processes and results for software systems and subsystems that have substantial impact.</span></b></p></li><li><p><b><span>Work with customers to develop high level requirements and to track them in JIRA</span></b></p></li><li><p><b><span>Develop diagrams, workflows, and high-level architecture and integration diagrams</span></b></p></li></ul><h2></h2><h2><b><b>Qualifications:</b></b></h2><ul><li><p><b><span>Typically requires a Bachelor&#39;s degree in Computer Science or related discipline with a minimum of 3 years of related experience; or a Master’s degree in Computer Science or Systems Engineering with a minimum of 1 year related experience. </span></b></p></li><li><p><b><span>Demonstrated strong strategic thinking skill, and ability to see and convey the big picture; critical thinking and synthesis; ability to deal with ambiguity and adapt to a fast-paced, customer-focused operation; self-starting; excellent listening and communications</span></b></p></li><li><p><b><span>Consistent track record for delivering successful software systems applying standard methodologies.</span></b></p></li><li><p><b><span>Extensive software development skills and familiarity with modern software development practices and tools.</span></b></p></li><li><p><b><span>Solid knowledge and experience with web and software application development.</span></b></p></li><li><p><b><span>Experience with Jira or other software project tracking application</span></b></p></li><li><p><b><span>Demonstrated experience in the following: Python, Java/J2EE, TypeScript, Node.js, JavaScript, JQuery, HTML, React.js, CSS, Postgres, Docker, C&#43;&#43;</span></b></p></li></ul><ul><li><p><b><span>Experience with a broad set software architectures and technologies, and understand the benefits and trade offs of various web architectures and technologies</span></b></p></li><li><p><b><span>Experience in information architecture and information retrieval</span></b></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$112,070 - $122,304<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted Today",
    "startDate": "2023-03-16",
    "timeType": "Full time",
    "jobReqId": "R4064",
    "jobPostingId": "Entry-Level-Software-Systems-Engineer_R4064-1",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Entry-Level-Software-Systems-Engineer_R4064-1"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Software Systems Engineer II- (Mission Ground Data System) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Technologist-III---Project-Discovery_R3657",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Software Systems Engineer II",
      "externalPath": "/job/JPL-Campus/Software-and-Venue-Reliability-Engineer-II_R3713",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-18"
    },
    {
      "title": "Software Systems Engineer II",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-II_R3723",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-06"
    }
  ],
  "userAuthenticated": false
}
