{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Resource-Analyst-lll--Project-Discovery_R3985",
    "id": "0b08aaf3158e10012ec2e8dd8d9c0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Formed in 1936, the NASA Jet Propulsion Laboratory is a federally funded research and development center managed for NASA by the California Institute of Technology (Caltech.) JPL joined NASA as an FFRDC when the agency was founded in 1958.<br /> <br />JPL helped open the Space Age by developing America’s first Earth-orbiting science satellite, creating the first successful interplanetary spacecraft, and sending robotic missions to the solar system.<br /> <br />Today JPL continues its world-leading innovation, implementing programs in planetary exploration, Earth science, space-based astronomy and technology development while applying its capabilities to technical and scientific problems of national significance.<br /> <br />Above all, we are explorers. At JPL we promote collaboration, innovation, integrity, and excellence in distinct academic areas. We turn ideas for science investigation into the reality of groundbreaking space missions, partnering with our strategic business teams to guide JPL into the future.</p><p></p><p><b>Project Discovery Reentry Program Description</b></p><p>JPL understands that we all have different life and career journeys, and we invite you to make us your next step. The Project Discovery reentry program marks the next milestone of inclusivity at JPL as a commitment to equitable career development and advancement opportunities. If you have taken a career break and are ready to return to work – this program is for you!</p><p></p><p>JPL and Project Discovery are part of the STEM Reentry Task Force, the groundbreaking career reentry initiative co-led by the Society of Women Engineers and iRelaunch.</p><p></p><p>The JPL Project Discovery Re-Entry program is looking for talented professionals who are looking to restart their careers after an absence from the workforce for one or more years. This paid one-year returnship role will enable you to work on projects that match your expertise, interests and abilities and could lead to full-time employment. During the returnship program you will have the opportunity to update your skills in a contemporary work environment. You will have access to the latest tools and technologies available and work alongside multidisciplinary teams to hone your expertise and deliver on client-critical solutions. You’ll be able to experience the breadth of JPL resources while developing new skills and building new relationships.</p><p></p><p><b>Note: As a temporary position, this assignment may last up to 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice. </b></p><p></p><p><b>Job Description:</b></p><p></p><p><span><b>The Project Controls Section</b> provides project cost control, planning, and analysis support to JPL’s programs and projects. We are seeking a Project Resource Analyst (PRA) who will serve as a key business team member. The Resource Analyst responsibilities include, but are not limited to:</span><br /><span>• Developing and maintaining the Work Breakdown Structure (WBS), WBS Dictionary and Responsibility Assignment Matrix. </span><br /><span>• Monitoring project funding for proper placement on contract, linking, and estimating anticipated exhaustion of funds </span><br /><span>• Developing, analyzing, and updating complex project task plan documents (i.e. statement of work, basis of estimates, and cost estimates) using project history, actuals, and supporting documentation. </span><br /><span>• Developing the project financial position relative to Institutional deliverables for the Planning, Programming, Budgeting, and Execution (PPBE), Institutional Business Forecast, Cost Phasing, NF533 reporting, and monthly/quarterly reviews. </span><br /><span>• Developing time-phased budgets and EACs (may involve multiple work packages) in accordance with schedule plans; analyzing issues and recommending corrective actions. </span><br /><span>• Conducting in-depth analysis of program/project performance (may include earned value) </span><br /><span>• Preparing and presenting </span><span>monthly/quarterly/yearly</span><span> project financial reports.</span><br /><span>• Participating as an essential team member on teams inside and outside organization, project, activity or function.</span></p><p></p><p><b>Qualifications: </b></p><p>A successful candidate will have the following experience and skills:</p><ul><li><p>Typically requires a Bachelor degree in Business Administration or similar discipline with a minimum of 6 years of related experience; Master degree in similar discipline with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years related experience.</p></li><li><p>Advanced knowledge, understanding and application of project planning and control principles and standards, including cost estimation, budgeting, and scheduling; performance measurements, including earned value, as required for the planning and implementation of complex projects</p></li><li><p>Must be able to interface effectively with program/project management, technical organizations, industry partners, bypass centers, and Sponsor.</p></li><li><p>Must be resourceful and self-motivated with excellent verbal and written communication skills.</p></li><li><p>Must be a strong user of Microsoft Office (Excel, Word and PowerPoint)</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Advanced knowledge of Laboratory and NASA policies and procedures, and government regulations across a range of applications.</p></li><li><p>Previous experience in a project team environment with project reporting, integrated cost/schedule planning, EVM, and various performance measurement techniques.</p></li><li><p>Experience with cost-schedule baseline change control processes. Prior experience with PRISM, IBT, Data Extractor, and or OBIEE.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$101,192 - $116,584<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Resource-Analyst-lll--Project-Discovery_R3985",
    "jobReqId": "R3985",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-02-22",
    "timeType": "Full time",
    "title": "Resource Analyst lll- Project Discovery"
  },
  "userAuthenticated": false
}
