{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Human-Resources-Generalist--Temporary-_R3987",
    "id": "0b08aaf3158e100111f42121b7200000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>The <b>Human Resources (HR) team</b> at JPL is on a voyage of innovation, discovery, and modernization that will allow us to continue to support the JPL mission and quests. AskHR, the Human Resources Solutions Center, is a centralized function designed to handle a variety of HR-related services. AskHR will and applicants as a single point of entry to access all HR services.</p><p></p><p>As a <b>Human Resources Generalist</b>, you will report to the <b>AskHR Tier 2 Manager,</b> and serve as the subject matter expert in AskHR regarding topics such as awards, events, drug testing, fitness offerings, United Way, new hire on-boarding and special projects as follows:</p><ul><li><p>Responsible for the on-boarding experience including promotional materials, new hire orientation, and engagement activities throughout the first year of employment. </p></li><li><p>Responsible for administration and oversight of drug testing including but not limited to Department of Transportation and Safety Sensitive random testing.</p></li><li><p>Responsible for the administration of awards programs, including lead, schedule and facilitate the centralized awards board processes and meetings, and processing and distribution of the awards.</p></li><li><p>Responsible for administration of events and activities such as Award Ceremonies, Wellness Events including Flu Shots that requires the ability to develop and adhere to a project plan and collaborate with HR and external partners. </p></li><li><p>In partnership with the United Way liaison and JPL sponsor, lead the United Way strategy including the giving campaign, kickoff event, and volunteer activities. </p></li><li><p>Interface with various levels from Executive Management to employees in addressing individual and programmatic needs.</p></li><li><p>Use Workday, Awards, and other HR systems as it relates to the programs for which they are responsible.   </p></li></ul><p></p><p>You may provide support and handle a variety of other HR-related services including but not limited to: </p><ul><li><p>Provide subject matter expertise in AskHR regarding topics such as benefits enrollment, life events, retiree benefits, records, data management and other HR services.</p></li><li><p>Be responsible for systems and reporting needs including the creation of dashboards, running reports, data validation and integrity, in Workday and the case management systems.</p></li><li><p>Analyze and resolve employee and manager complex questions on various HR related issues.</p></li><li><p>Respond and resolve Tier 1 escalated issues that require research and assist AskHR Tier 1 HR Customer Support during peak periods.</p></li><li><p>Work with internal and external resources to research and resolve employee issues and problems, and escalate complex inquiries as necessary to Centers of Excellence subject matter experts.</p></li><li><p>Assist employees with navigation of HR sites, and inform employees and management on human resources policies, guidelines, processes, and procedures.</p></li><li><p>Perform various other duties as required.</p></li></ul><p></p><p><b>Qualifications: </b></p><ul><li><p>Typically requires a Bachelor’s degree with 3 years of equivalent experience in Human Resources or Master&#39;s degree with 1 year of related experience or PhD with 0 years of related experience.</p></li><li><p>Minimum of 5 years recent HR experience.  </p></li><li><p>Excellent customer focused communication skills (patience, attentiveness, courtesy).</p></li><li><p>Strong interpersonal skills and team based orientation.</p></li><li><p>Excellent written and oral communication skills.</p></li><li><p>Demonstrated ability to respond to common inquiries or complaints from customers.</p></li><li><p>Ability to maintain confidentiality and discretion in daily work.</p></li><li><p>Demonstrated ability to analyze and solve problems to achieve first call resolution.</p></li><li><p>Ability to work and problem solve independently utilizing available resources and tools.</p></li><li><p>Strong written communication skills in order to respond to customer inquiries or document issues in the case management tool as the system of record.</p></li><li><p>Experience with HR systems.</p></li><li><p>Excellent analytical skills and the ability to spot anomalies and trends.</p></li><li><p>Detail-oriented with good organizational skills.</p></li><li><p>Flexible and able to effectively prioritize and balance competing priorities working in a fast-paced team environment.</p></li><li><p>Familiarity with reporting tools.</p></li><li><p>Proficiency in Microsoft Office Suite including Outlook, Word, Excel, and PowerPoint.</p></li><li><p>Ability to consult and advise customers and management as a subject matter expert.</p></li><li><p>Excellent relationship management skills.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>3&#43; years of HR experience.</p></li><li><p>HR certification.</p></li><li><p>Technical computer proficiency including Workday, HR Solution Center software applications, and disability management tracking system.</p></li><li><p>Experience leading and coordinating events and activities that involve over 500 people.</p></li><li><p>Demonstrated capability to make strategic improvements to programs that results in improved utilization. </p></li><li><p>Experience creating, running and validating reports in Workday or other HRIS systems.  </p></li><li><p>Capability to create metrics and dashboards in Workday or other HRIS systems. </p></li></ul><p></p><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$78,208 - $97,552<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Human-Resources-Generalist--Temporary-_R3987",
    "jobReqId": "R3987",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 3 Days Ago",
    "startDate": "2023-04-05",
    "timeType": "Full time",
    "title": "Human Resources Generalist- HR Programs & Events (Temporary)"
  },
  "userAuthenticated": false
}
