{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technologist-Level-II---Entry-Level_R3813",
    "id": "16fcebb1c5d31000c2ca4bb2e0f30000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Planetary Mass Spectrometer Group seeks a self-motivated individual who can work well in the laboratory independently and in a team environment.  The selected candidate will have the opportunity to contribute in both ground-based and space-based research for general mass spectroscopy in combination with geochemistry, isotope geochemistry, chromatography, cosmo-chemistry, absorption/emission spectroscopy, and astrobiology as an in-situ <b>Technologist level 2 </b>in the following ways:</p><ul><li>To work on technology development tasks such as the Spacecraft Atmosphere Monitor (S.A.M) instrument, which is used on board the International Space Station.<ul><li>Be responsible for performing calibration and instrument development within the areas of mass spectroscopy, gas chromatography</li></ul></li></ul><ul><li>To contribute on new technology infusions for novel instrumentation applied to future planetary and human exploration.<ul><li>Such as instruments to the Lunar surface or atmosphere of Venus.</li><li>Writes and contributed to proposals to obtain funding for future technology developments.</li><li>To create and fulfill opportunities to design, develop, document, implement, and verify new technologies for mass spectrometer instruments from the breadboard throughout the flight implementation phase.</li><li>To identify new scientific questions and issues, apply theoretical principles, and use creative analytical, experimental techniques, and scientific methods to develop new technology and instrument opportunities.</li><li>To establish and verify models of instrument properties in support of design, calibration, and performance verification.</li></ul></li></ul><ul><li>Works independently on high visibility assignments and projects with only limited supervision, typically receiving only general instructions.<ul><li>Exercises discretion and independent judgment to compare and evaluate various methods, approaches, resources and decide which will best accomplish each aspect of such assignments with the agreement of the project management.</li></ul></li></ul><ul><li>To publish technology and science results at conferences and peer-reviewed periodicals.</li></ul><p></p><p><b><u>Qualifications</u></b></p><ul><li>Exceptional interest in;<ul><li>Developing mass spectrometer based instrumentation to support human space flight missions</li><li>Developing new technologies to develop new systems and applying them to address novel science questions.</li><li>Strong interest working from conception through flight delivery, for mass spectroscopy, chromatography, fields and charged particles projects.</li></ul></li></ul><ul><li>Bachelor’s degree in physics, analytical chemistry or related technical disciplines with 3 years of related experience; or Master’s degree in similar disciplines with 1 year of related experience; or PhD with 0 years in related fields.</li><li>An understanding of the principles, theories, concepts, and techniques into instrument design principles.<ul><li>Hands-on and understanding of instrument related subsystems, e.x., vacuum systems and their components, RF and high voltage electronics circuits, control software, and data extraction.</li><li>Knowledge on how to derive science requirements and their implementation and verification.</li><li>Strong understanding of system engineering and development process.</li></ul></li></ul><ul><li>Strong interpersonal skills with demonstrated effectiveness in a team environment. <ul><li>Working closely with multiple science and engineering teams.</li></ul></li></ul><ul><li>Excellent written and verbal communications skills. <ul><li>Ability to present her/his work in peer and design cycle reviews.</li></ul></li></ul><ul><li>Ability to multi-task independently with an established track record of meeting milestone schedules.</li><li>Extensive knowledge and demonstration of instrument building skills in one or more of the following areas: charged particle optics, mass spectroscopy, atomic and molecular physics, gas and/or liquid chromatography, absorption/emission spectroscopy, or micro-fabrication techniques.</li><li>Demonstrated ability in how to design, fabricate, build, test, calibrate, and evaluate fully operational mass spectrometer systems.</li><li>Extensive knowledge of one or more high-level general-purpose programming languages, such as C/C&#43;&#43;, Linux, Java, Python, MATLAB, SIMION, COMSOL, and CAD drawing tools.</li><li>Has advanced knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</li><li>Ability to work well with cross-functional teams, design engineers, management, and other NASA centers.</li><li>Contract Technical Management experience.</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$75,608 - $114,816<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Technologist-Level-II---Entry-Level_R3813",
    "jobReqId": "R3813",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-23",
    "timeType": "Full time",
    "title": "Technologist Level II - Entry Level"
  },
  "userAuthenticated": false
}
