{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-V----Section-Chief-Engineer-_R4461",
    "id": "49344aaf21471001705435c227d50000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p></p><p>If you are passionate about spacecraft design, we invite you to join the <b>System V&amp;V, Integration, Test, &amp; Launch Engineering Section</b>. We provide the systems engineering relating to V&amp;V, System Testbeds, Systems Test, and Launch Systems Engineering for the laboratory’s key flight projects. Our efforts span the both formulation and implementation lifecycle, and include both leadership and execution in these key disciplines.</p><p>We are seeking a highly motivated and experienced leader to join our leadership team and serve as the <b>Section Chief Engineer</b> for the System V&amp;V, Integration, Test, &amp; Launch Engineering Section at the Jet Propulsion Laboratory. You will report to the <b>Section Manager for System V&amp;V, Integration, Test, &amp; Launch Engineering Section. </b></p><p></p><p>As the <b>Section Chief Engineer</b>, your key responsibilities will include:</p><p></p><ul><li><p>Providing oversight at the section management level for both the technical quality and process integrity for the section’s major deliverables in flight system systems engineering to our major flight project customers; interfacing with the customers on a regular basis to ensure that the section is engaged and addressing customers’ technical, staffing, and programmatic concerns; representing section management at major project and peer reviews; reporting risk and issues, along with subsequent remedy recommendations, to section management so that they can be addressed in a timely fashion.</p></li><li><p>Collaborating with, on behalf of section management, section-staff-level cost account managers on a regular basis to provide another management-level resource for guidance in achieving technical, cost, staffing, and schedule objectives; when requested, providing assistance to the CAMs in the resolution of specific issues of technical importance and urgency; serving as the chair for the section’s internal flight systems engineering advisor board; assisting the CAMs and group supervisors with the application of system engineering and spacecraft design processes and practices on flight projects.</p></li><li><p>Participating as a member of section management team in reaching section’s vision and goals; developing and evolving processes and methods to be used by the group members for system engineering and spacecraft design; providing technical and professional leadership in advancing flight system engineering; contributing to the section&#39;s efforts to improve and upgrade its system engineering capabilities; advancing the practice of flight systems engineering in the section and in other collaborating organizations. </p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in engineering, physical sciences, or mathematics with a minimum of 12 years of professional experience, or Master’s degree with a minimum of 10 years of professional experience, or a PhD with a minimum of 8 years of professional experience.</p></li><li><p>Recent flight project implementation leadership experience in a system engineering leadership role, or chief engineer, or major element delivery lead, or equivalent; or recent service in line management at the group or section level.</p></li><li><p>First principles working knowledge of all major spacecraft subsystems, as well as working knowledge of major flight systems engineering disciplines in areas such as behaviors, fault protection, electrical, payload integration, system V&amp;V, system level testbeds, or SI&amp;T.</p></li></ul><p></p><p>However, excellent technical experience is not enough. In order to be selected, a candidate must also have demonstrated superior people leadership skills. Some of the required leadership qualifications include:</p><ul><li><p>Previously demonstrated aptitude and genuine commitment to success of others beyond merely helping with technical tasks; experience with mentoring and counseling; unwavering commitment to the development of and advancement of other’s careers.</p></li><li><p>Excellent organizational and team building skills; aptitude to work with difficult colleagues in a productive manner; impeccable written skills honed enough to publish in a refereed journal; verbal clarity sufficient to explain difficult technical topics to those external to the field; professional character and ethics beyond reproach.</p></li><li><p>Proven ability to work effectively with, and relate to, all levels of engineers and managers; demonstrated commitment and experience to customer satisfaction; demonstrated ability to team effectively across section and division boundaries; ability and willingness to team with JPL institutional management to creatively solve complex enterprise level institutional issues; demonstrated ability in resolving complex technical and managerial problems.</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Career experience in flight systems implementation, and delivery leadership spanning multiple projects; experience working all project life-cycle phases; demonstrated ability to contribute at both the architectural and subsystem level of integration.</p></li><li><p>Previous service in line management at both the group and section level; previous experience providing technical guidance at the program or institutional level.</p></li><li><p>Extensive experience with integration and test of flight vehicles.</p></li><li><p>Extensive experience in the development of system test and system validation products.</p></li><li><p>Significant experience in leading groups and teams toward the on-time delivery of technical design products on a flight project; substantial experience planning budgets and estimating cost to accomplish work; experience in improvement of engineering process.</p></li><li><p>Experience with and willingness to teach system engineering principles and practices; ability to motivate group members to enhance system engineering principles and practices; experience in the preparation, delivery, and/or review of flight systems engineering gate products, including key flight system design artifacts.</p></li><li><p>Extensive understanding and wide application of advanced principles in spacecraft design and systems engineering field of knowledge, or test, resulting in contributions to the development of new and improved methods of V&amp;V and testing; complete knowledge of industry and standards across a range of applications in systems engineering and spacecraft design.</p></li><li><p>Proven ability to develop solutions, which are highly innovative, and extend the boundaries of current knowledge in the area of spacecraft V&amp;V, test, and systems engineering.</p></li><li><p>Ability or willingness to obtain a TS/SCI clearance. Candidates with an active TS/SCI clearance would be an asset<b>. </b></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$177,944 - $227,656<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Systems-Engineer-V----Section-Chief-Engineer-_R4461",
    "jobReqId": "R4461",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 5 Days Ago",
    "startDate": "2023-06-21",
    "timeType": "Full time",
    "title": "Systems Engineer V-  (Section Chief Engineer)"
  },
  "userAuthenticated": false
}
