{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Flight-Systems-Engineer-IV_R4459",
    "id": "4e57a7183d181000d52fc47ebec70000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>The Jet Propulsion Laboratory (JPL) is NASA’s lead center for robotic exploration of the solar system. Our core competency is the end-to-end implementation of unprecedented robotic space missions to study Earth, the Solar System, and the Universe.</span></p><p></p><p><span>This unique opportunity is part of the <b>Autonomous Systems Division, </b>which is responsible for technology development, advanced concepts, design, development, delivery, integration and test, verification and validation, and operation of Command and Data Handling (C&amp;DH) Hardware, Flight Software, Power Systems, Robotic Systems, and Guidance and Control.</span></p><p></p><p><span>As a Systems Engineer for the <b>Avionics Subsystem Engineering Group (348A)</b>, you will be working for JPL&#39;s <b>Flight Software and Avionics Systems Section</b>, which provides leadership and unique world-class expertise in Avionics Systems Engineering, Spacecraft Flight Software development, Avionics Integration, Test, and Operations and Advanced Processor and Software Research.</span></p><p></p><p><b><u><span>Responsibilities:</span></u></b></p><p><span>As the <b>Avionics Systems Engineer </b>in the <b>Avionics Subsystem Engineering Group</b>, you will work on the <b>Europa Clipper Project or Mars Sample Return Project</b>. <b>You will be responsible for leading, planning and executing system engineering activities for a subsystem which includes hardware, software, simulation and support equipment, and integration and test. </b>These activities include development and maintenance of the subsystem architecture, requirements, and interfaces. The Avionics Systems Engineer will define, coordinate, balance and integrate technical and programmatic issues in a holistic manner to ensure that the hardware and software system satisfies requirements, expectations, and constraints within the allocated resources and with acceptable risk. This includes management of technical resources (mass, power, etc.); analysis and modeling of the design; leading the verification and validation of the subsystem; contributing to risk management and controlling the subsystem change process.</span></p><p></p><p><span>Specific responsibilities include:</span></p><ul><li><p><span>Develop subsystem requirements and operations concepts, functional architectures, design, documentation and interface definition to external elements</span></p></li><li><p><span>Coordinate technical issues between subsystem elements (hardware, software, and simulation and support equipment)</span></p></li><li><p><span>Ensure that the design meets functional and performance requirements and complies with institutional standards including JPL flight practices, reliability requirements, project requirements, and approved waivers.</span></p></li><li><p><span>Lead Working Groups or Design Teams as needed to conduct trades or resolve technical issues</span></p></li><li><p><span>Lead the development, preparation and execution of verification and validation plans of significant impact to the project</span></p></li><li><p><span>Provide technical input to the Avionics Product Delivery Manager for all project milestone reviews and management reviews.</span></p></li><li><p><span>Provide inputs to the Avionics Product Delivery Manager for planning/budgeting efforts including cost estimation and scheduling.</span></p></li><li><p><span>Oversee anomaly tracking, disposition and corrective action for the subsystem.</span></p></li><li><p><span>Perform testing, document anomalies and success and communicate with the test lead.</span></p></li><li><p><span>Present complex avionics concepts to various levels of line management, project management and other technical personnel</span></p></li><li><p><span>Lead system architecture and risk management analyses</span></p></li></ul><p><b><span> </span></b></p><p><b><span>The following qualifications are required: </span></b></p><ul><li><p><span>Bachelor’s degree in <b>Electrical Engineering, Computer Engineering, Systems Engineering</b> or related technical discipline with typically a minimum of 9 years of related experience; Master’s degree in similar disciplines with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years related experience.</span></p></li><li><p><span>Advanced knowledge in one or more of the following areas: <b>Systems Engineering, Digital Electronics, Software, Space Avionics</b>.</span></p></li><li><p><span>Advanced knowledge in one or more of the following areas: <b>Downlink and Telemetry, C&amp;DH, Timekeeping, Compute Elements, Systems Engineering, Digital Electronics, Software, Embedded Systems, and/or Integration and Test</b>.</span></p></li><li><p><span>Extensive experience with avionics V&amp;V, interface configuration documents, requirement tracing, and embedded software V&amp;V.</span></p></li><li><p><span>Extensive understanding and wide application of advanced principles, theories, concepts and techniques of Systems Engineering</span></p></li><li><p><span>Experience with integrated hardware/software developments.</span></p></li><li><p><b><span>Bus Protocols: knowledge of Highspeed serial Interfaces like PCI-Express, PCI, Ethernet, Spacewire, SPI, AMBA, RS232, I2C, I2S, 1553, TDM, UART, EBUS, SCSI, Serial FPDP, SAS, SATA protocols, etc.</span></b></p></li><li><p><span>Experience with hardware/software configuration management.</span></p></li><li><p><span>Knowledge of industry and/or academic practices and standards across a range of systems applications.</span></p></li><li><p><span>Extensive planning skills for generating task plans, issuing work authorization packages, coordinating budgets, monitoring schedule, reviewing requirements and reporting to a project sponsor.</span></p></li><li><p><span>Experience leading subsystem level hardware / software integration, verification and validation.</span></p></li><li><p><span>Demonstrated verbal and written communication skills and ability to conduct project level reviews and status reports.</span></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$143,312 - $183,248<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Flight-Systems-Engineer-IV_R4459",
    "jobReqId": "R4459",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 26 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-07-10",
    "timeType": "Full time",
    "title": "Flight Systems Engineer IV"
  },
  "userAuthenticated": false
}
