{
  "jobPostingInfo": {
    "id": "5ccfa482bd5410017566fbea1f780000",
    "title": "Facilities Maximo Database Administrator",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>As the <b>Facilities Computerized Maintenance Management Systems (CMMS) Administrator</b>, you will lead, manage and coordinate the development and maintenance of Maximo in compliance with NASA and JPL requirements. This is a great opportunity for someone who is passionate about database administration and metrics.</span></p><p><span> </span></p><p><span>In this role, you will be responsible for the following:</span></p><ul><li><p><span><b>Facilities Maximo Systems Administrator</b>, application design, coding, testing and supporting next-generation application solutions in IBM Tivoli Maximo Asset Management and Oracle Database environments.</span></p></li><li><p><span>Maximo implementation, development, design and consulting.</span></p></li><li><p><span>IT Security Database (ITSDB) practices and JPL IT Policy</span></p></li><li><p><span>Provide Maximo System support. Responsible for all Maximo systems and data requirements inputting, updating, disposing and inventorying Facilities Maintenance locations, equipment, job plans and PM information.  Monitor and maintain database integrity. Maintain Maximo 7.6 System/all Software upgrade implementation to meet NASA, JPL Facilities.</span></p></li><li><p><span>Oracle database management, optimization, tuning, data integrity, data migration and data loading to Maximo Database.</span></p></li><li><p><span>Tririga Capital Projects Co-Admin Server Support to Section 2811</span></p></li><li><p><span>Maintain facilities infrastructure software systems</span></p></li><li><p><span>Maintain annual support renewals for supported software systems</span></p></li><li><p><span>Support various analytical processes on facilities contractor performance and energy programs.</span></p></li><li><p><span>Communicate with the JPL contract administrator regarding contractor performance issues.</span></p></li><li><p><span>Validates reports documenting the Quality Assurance information and finds. </span></p></li><li><p><span>Reviews complex designs for sustainability and maintainability.</span></p></li><li><p><span>Stays abreast of technical developments and advances in appropriate fields, with specific focus on preventative and predictive maintenance tools that drive plant reliability.</span></p></li><li><p><span>Creates Maintenance Effectiveness and Maintenance efficiency practices including Preventative and Predictive Maintenance tools and practices. </span></p></li><li><p><span>Review QA assignments of work completed by Subcontractor</span></p></li><li><p><span>Conducts complex and cross-disciplinary analysis in Failure Mode Analysis &amp; Root Cause Analysis on equipment failures equipment downtime.</span></p></li><li><p><span>Work within Facilities Maintenance and Operations Section.</span></p></li><li><p><span>Perform administrative functions, including writing reports, data analysis and maintaining Facilities Maintenance information as it applies to JPL Facilities Maintenance &amp; Operations Contract Requirements.</span></p></li><li><p><span>Work with engineers, project managers and QA staff in a team environment. Work under direction of JPL Facilities Maintenance &amp; Operations Division Managers and Supervisors.</span></p></li></ul><p></p><p><b><u><span>This position requires the following qualifications:</span></u></b></p><ul><li><p><span>Typically requires Bachelor’s Degree in computer science or related discipline and a minimum of 9 years related experience; or Master’s degree in similar disciplines with a minimum of 7 years related experience.</span></p></li><li><p><span>A strong background and knowledge in IBM Maximo and Tririga certificated training. </span></p></li><li><p><span>A strong background with Oracle EAM training and data Maximo System Administration 7X;  Maximo Database Administration’ Maximo Integration Framework (MIF); IBM WebSphere Application Server; IBM HTTP Server; BIRT Reports for Maximo; Oracle Database Administration; Windows Server 2016; Tririga System Administrator; Tririga System Implementation</span></p></li></ul><p></p><p><b><u><span>Additional Desired Qualifications:</span></u></b></p><ul><li><p><span>Knowledge of various technologies, including Oracle 11c-19c; J2EE Applications, XML, Windows Server 2016 R2, MS Sql Database 2017</span></p></li><li><p>Generate annual budget and cost analysis for fiscal year requirements to accommodate software, support renewals and system provisioning.</p></li><li><p><span>Annual Facilities Assessment Validations (FCAV)</span></p></li><li><p><span>The ability to read and comprehend Building Mechanical, Plumbing, Electrical Codes as well as advanced knowledge of applicable industry practices and standards.</span></p></li><li><p><span>Knowledge of applicable Laboratory policies and procedures, NASA policies and procedures and government regulations.</span></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$128,648 - $164,008<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-18",
    "timeType": "Full time",
    "jobReqId": "R3792",
    "jobPostingId": "Facilities-Maximo-Database-Administrator_R3792",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Facilities-Maximo-Database-Administrator_R3792"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": true
}
