{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technical-Group-Supervisor_R4252",
    "id": "aae9edf4a2b21000cbb905a0ce110000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Instrument Software and Science Data Systems Section (Section 398) within JPL consists of multidisciplinary teams of engineers and data scientists who provide expertise across the domains of instrument operations, science data systems, and science support.</p><p>Section 398 has the responsibility to:</p><ul><li>Deliver the Instrument Operations System (IOS) to an instrument team or flight mission. The IOS is the integrated set of people, processes, procedures, software, hardware, and facilities with the capability to plan and command instrument observations, as well as control and monitor instrument performance.</li><li>Deliver the Science Data System (SDS) to an instrument team, flight mission, or science project. The SDS is the integrated set of software, hardware, facilities, people and procedures with the capability to process, manage, distribute, explore, and analyze scientific data.</li><li>Provide data science services that enable and support JPL scientific investigations and goals.</li><li>Provide science project management and science system engineering support to JPL and NASA programs and projects.</li><li>Provide software engineering and development support to instrument and science teams.</li></ul><p></p><p>Section 398 consists of a team of 13 groups and 13 Technical Group Supervisors who report to the Instrument Software and Science Data Systems Section Manager (3980). Each technical group supervisor has expertise and proven leadership in a technical discipline, is adept at developing the future of the discipline, excels at cultivating practitioners of the discipline, and drives positive strategic change throughout the section.</p><p></p><p>You will be the <b>Technical Group Supervisor</b> for the <b>Science Data System Operations Engineering</b> Group (398N), reporting to the manager of the Instrument Software and Science Data Systems Section (398). You will lead a group of 20 to 25 Operations Engineers and Leads, who are responsible for being the technical authority for operating science data systems and data engineering for JPL flight projects, science research and analysis projects, and archive systems across Earth and Planetary domains. You will be accountable for schedule, resources, and technical performance of all group activities. </p><p></p><p>The 398N Technical Group Supervisor has five major duties.</p><p>Seek out exciting work opportunities for the group and section in alignment with the 398 charter and be accountable for the technical performance and quality of the work. Advance the System Operations Engineering and Data Engineering disciplines across the section through process improvement, use of common tools, strategic job assignments, and development of a community of practice. Develop and nurture the current and future talent of engineers across the group and section through strategic recruitment, coaching, mentoring, training, career development and recognizing achievements. Lead and contribute to Section 398 strategic initiatives in areas such as business development, cross-project and program collaboration, and product line development. Perform activities commensurate with Group Supervisor duties including time card review, travel authorization, travel reporting review, technical document review, workforce planning, change management, and annual salary review and administration. </p><p></p><p><b>Qualifications </b></p><p><b>Required Skills:</b></p><ul><li>A Bachelor’s degree in Engineering, Computer Science, or related discipline with a minimum of 9 years of related experience; Master’s degree with a minimum of 7 years of related experience; or PhD with a minimum of 5 years related experience.</li><li>System engineering experience with demonstrated ability as the technical lead for multidisciplinary teams developing and operating science data systems.</li><li>Demonstrated experience as the technical lead successfully developing or operating Science Data Systems for flight projects or archive system.</li><li>Extensive knowledge of small and large-scale scientific data processing systems across multiple infrastructures and related technologies.</li><li>Demonstrated technical leadership across a broad set of disciplines, science system engineering, data science, software development, system integration and test, operations and data engineering.</li><li>Demonstrated knowledge of the following areas: data management, data integrity, metadata management, metadata formats and standards, data accountability, data analysis, and open data standards in relation to Earth and Planetary data and systems.</li><li>Extensive knowledge of laboratory policies and procedures; complete knowledge of typical JPL or NASA mission system gate products, NASA policies and procedures; extensive knowledge of the JPL or NASA systems engineering practices; demonstrated ability to tailor the planning and execution of those practices; understanding of the JPL Flight Project Practices and Design Principles; experience tailoring those policies to projects of different risk classifications.</li><li>Unwavering and committed desire to advance careers of the Section’s current and future engineers through recruitment, coaching, mentoring, training, job assignment, and reward and recognition.</li><li>Ability to build a highly skilled team of SDS operations and data engineers capable of supporting Section’s science data systems.</li><li>Excellent interpersonal and leadership capabilities and the ability to articulate and implement a vision.</li><li>Excellent oral and written communication skills.</li></ul><p></p><p><b>Desired Skills:</b></p><ul><li>Understanding of the science that we enable and demonstrated experience working with internal and external science teams.</li><li>Ability to represent Section 398 to upper management and key customers and stakeholders.</li><li>Ability to explain and convey complex technical issues and challenges to audiences with various levels of technical experience.</li><li>Experience with costing and proposal preparation.</li><li>Knowledge of a variety of cloud and high performance computing infrastructure systems and their related technologies and services.</li></ul><p></p><p><b><i>NOTE: This position may be classified at a level higher than the posted level. A determination will be made once the final candidate has been identified. The typical full time equivalent annual hiring range for this job at a level higher in Pasadena, California. $169,208 - $220,896</i></b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$140,920 - $178,464<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Technical-Group-Supervisor_R4252",
    "jobReqId": "R4252",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 7 Days Ago",
    "startDate": "2023-05-01",
    "timeType": "Full time",
    "title": "Technical Group Supervisor"
  },
  "userAuthenticated": false
}
