{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Electronics-Engineer-IV_R4200",
    "id": "48c75f5782071000d7534768f8d30000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Responsibilities </u></b></p><p></p><p>JPL’s<b> Electronic Design Validation &amp; Test Group</b> plays an essential role in the<b> Flight Electronics Section</b>. As a Hardware Test Engineer Lead, you will manage a multi-mission Integration and Test process.</p><p></p><p>The flight electronics section designs, builds and tests space-qualified electronic systems. The design verification and test group activities include, board and sub-system compliance testing, electronics system integration, behavioral and characterization testing. Additionally, flight articles will be subjected to space environmental testing programs –thermal-vacuum and vibrational tests.</p><p></p><p>Our customers include project managers, system testbeds, spacecraft integration and test and mission operations managers.</p><p></p><p>In this role, you will collaborate with other senior engineers supporting all of JPL’s flight projects – currently: Europa, NISAR, MSR and Psyche missions. This role is ideal for a candidate who works closely with others and can successfully meet the demands of flight-projects.</p><p></p><p>Responsibilities:</p><ul><li>Manage concurrent I&amp;T flows</li><li>Manage a team of electrical engineers, technicians, and test software engineers</li><li>Create I&amp;T work agreements including:<ul><li>statement of work</li><li>receivables list</li><li>resource loaded deliverable schedule</li><li>data driven cost estimates</li></ul></li><li>Interface with Section 349 delivery managers, manufacturing, venue process managers, and custom test equipment engineers<ul><li>manage I&amp;T REC/DELs</li><li>negotiate production scheduling</li><li>production reporting</li><li>test article reporting</li><li>anomaly reporting</li><li>VnV reporting</li><li>define test equipment requirements</li><li>Update I&amp;T process</li></ul></li><li>Review of I&amp;T venue<ul><li>capabilities</li><li>loading</li><li>maintenance</li></ul></li></ul><p></p><p><b><u>Qualifications </u></b></p><p></p><p>This position requires a Bachelor’s degree in Electrical Engineering, or related technical discipline with typically a minimum of 12 years of related experience or Master’s degree in similar disciplines with a minimum of 10 year of related experience. Management experience is a must.</p><p></p><p>Other requirements include:</p><ul><li>Ability to read / create electrical schematics, wiring diagrams, and ICDs</li><li>Proficiency in electronics fabrication and testing</li><li>High understanding of industry standard electronics test equipment; digital multi-meters, oscilloscopes, power supplies, function generators, lab-view, spectrum analyzers, etc.</li><li>Understanding of technical specifications</li><li>Excellent anomaly investigation skills</li><li>Understanding Verification &amp; Validation Process</li><li>Excellent communication skills</li><li>Demonstrated ability to work with a diverse set of customers including technicians, other unit designers and subsystem leads, project and line management, parts reliability, materials, procurement, quality assurance, and packaging groups.</li></ul><p><br /><b><u>Preferred qualifications include:</u></b></p><ul><li>Experience with firmware development, simulation and test equipment, and ground data systems.</li><li>Knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</li><li>Prior experience in the delivery of JPL Critical Items.</li><li>Python, C&#43;&#43;, Matlab and LabView programming knowledge.</li><li>Familiarity with 1553, CPCI, RS-422, UART, Spacewire Interfaces.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$143,936 - $180,960<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Electronics-Engineer-IV_R4200",
    "jobReqId": "R4200",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 29 Days Ago",
    "startDate": "2023-04-10",
    "timeType": "Full time",
    "title": "Electronics Engineer IV"
  },
  "userAuthenticated": false
}
