{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Cost-Engineer---Programmatic-Risk-Analyst_R1963",
    "id": "aef05b8e046f0101b54fd5ad9ec40000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Are you interested in joining a diverse team at the Jet Propulsion Laboratory, where you will directly contribute to mission success by leading programmatic assessment activities? In this role at JPL, you will enable mission success by leading <b>programmatic risk assessment</b> activities, including <b>cost and schedule evaluation</b> and <b>Joint Confidence Level analysis (JCL)</b>, to support the programmatic evaluation of highly complex competed and directed missions, instruments, and concept studies. This position will report administratively to the Institutional Cost and Schedule Evaluation Office Manager.</p><p></p><p>In this role you will:</p><ul><li><p>Lead and support independent cost and schedule assessments for competed and directed missions and missions approaching NASA Key Decision Point (KDP) transitions gates and JPL institutional reviews.Deliverables include Independent Cost Estimates (ICE), Independent Schedule Assessment (ISA), cost and schedule high-low ranges, and Joint Confidence Level analysis.</p></li><li><p>Utilize a variety of analytic techniques/methodologies for cost and schedule evaluations.</p></li><li><p>Communicate requirements and risk assessment processes to projects, Standing Review Board (SRB) members, NASA Headquarters, and JPL management</p></li><li><p>Prepare and present independent assessment of technical and resource risks and issues at JPL and external customer reviews.</p></li><li><p>Develop and maintain effective working relationships across the JPL business community.</p></li></ul><p></p><p><b>The following qualifications are required: </b></p><ul><li><p>Typically requires a Bachelor’s degree in Aerospace Engineering, Economics, Mathematics, Business Administration, Computer Science or related discipline with a minimum of 6 years of related experience; Master’s degree in similar disciplines with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years related experience.</p></li></ul><ul><li><p>Understands multiple analytic techniques/methodologies and parametric models used in cost and schedule evaluation including Monte Carlo simulations in support of S-curve analysis generation with analytical findings (e.g. JCL simulation).</p></li><li><p>Understands industry and/or academic practices and standards in project cost and schedule evaluation analyses with proficiency in the application of data science principles and the application of software tools.</p></li><li><p>Demonstrated ability to collaborate and work with technical organizations, including system contractors, in a multidisciplinary environment.</p></li><li><p>Effective communication skills in verbal, written, and presentation forms, including significant experience working with executive management.</p></li><li><p>Experience in participating in project life-cycle planning, risk analysis, risk management, and reporting.</p></li></ul><p></p><p><b>The following qualifications are preferred: </b></p><ul><li><p>Experience with proposal and project cost evaluations and validations, as well as proposal cost coordination and project cost engineering design/cost trades.</p></li><li><p>Experience as a member of interdisciplinary engineering teams.</p></li><li><p>Experience with PRICE TruePlanning, SEER, PCEC, NICM, SSCM, and other civil space cost estimation toolsets</p></li><li><p>Knowledge of EVMS and ability to evaluate early indicator metrics such as CPI, SPI, TCPI, TPMs, CV, and SV to identify and address adverse trends.</p></li><li><p>Proficient in Primavera Risk Analysis, Joint Analysis of Cost and Schedule (JACS), Polaris, and other risk analysis toolsets.</p></li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$96,720 - $117,416<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Cost-Engineer---Programmatic-Risk-Analyst_R1963",
    "jobReqId": "R1963",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-20",
    "timeType": "Full time",
    "title": "Cost Engineer / Programmatic Risk Analyst"
  },
  "userAuthenticated": false
}
