{
  "jobPostingInfo": {
    "id": "32bbf743df71100161b9afd3b1dd0000",
    "title": "TS/SCI Scientific Application Software Engineer III",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities</b></p><p>Join JPL&#39;s Instrument Software and Science Data Systems Section with multidisciplinary teams of engineers and technologists who provide expertise across the domains of instrument operations and science data systems.</p><p></p><p>As a Software Engineer for the Data Product Generation Software Group, you will work with the ISLAND Science Data System (SDS) Team to support a task with the National Security Program Office. Will report to the ISLAND SDS Product Delivery Manager (PDM). Will be part of a team developing, reviewing, testing, and maintaining data processing code and algorithms that process science data products. Will help PDM lead development efforts for new applications and/or major updates to existing applications. Will work with the science team and cloud engineers to architect data processing applications. Will collaborate with other software engineers to architect and mature automated testing and deployment environment. Will participate in project design and code reviews. </p><p></p><p><b>NOTE: Must be a U.S. Citizen with an active TS/SCI clearance – Top Secret (TS) clearance based upon Single Scope Background Investigation (SSBI) within 5-year scope and approved for Sensitive Compartmented Information (SCI) accesses.</b></p><p></p><p><b>Qualifications</b></p><ul><li>Bachelor&#39;s degree in Computer Science, Information Systems, Mathematics, or related technical discipline with typically a minimum of 6 years of related experience; Master&#39;s degree in similar disciplines with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years related experience.</li><li>Active TS/SCI Clearance</li><li>Experience in programming in Python, C/C&#43;&#43; in Linux environment</li><li>Experience in agile development process (Git, JIRA, Artifactory, Jenkins, CI/CD tools, and SCRUM)</li></ul><ul><li>Experience in all phases of software development: requirements, design, development, testing, and delivery</li></ul><ul><li>Experience in development of scripts in Python or bash to automate tasks in Linux environment.</li><li>Experience with Docker container and container orchestration with Kubernetes</li><li>Experience working with AWS / Azure Services Technologies</li><li>Experience with setting up and working with SQL and noSQL databases</li><li>Experience with DevOps/DataOps</li><li>Experience with test automation process and tools</li><li>Strong written and verbal communication skills and ability to work in a team environment.</li><li>Ability to learn new software techniques and mathematical algorithms</li><li>Understanding of modern software architecture and patterns</li><li>Strong critical thinking and problem-solving abilities</li><li>Desire to learn new technologies and concepts</li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li>Experience in data systems and design</li><li>Proficiency in mathematical algorithms</li><li>Experience in cloud development like AWS or Azure</li></ul><ul><li>Understanding of concepts of large-volume data processing</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$123,448 - $160,888<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 2 Days Ago",
    "startDate": "2023-03-15",
    "timeType": "Full time",
    "jobReqId": "R4095",
    "jobPostingId": "TS-SCI-Scientific-Application-Software-Engineer-III_R4095",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/TS-SCI-Scientific-Application-Software-Engineer-III_R4095"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
