{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Thermal-Energy-Research-Technologist--II_R4463",
    "id": "49344aaf21471001bb125a2db5520000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Responsibilities:</u></b></p><p>We invite you to join the Thermal Energy Conversion Technology and Engineering Group (3464) within the Power Systems and Technology Section to serve as a <b>Technologist. </b>You will be reporting administratively to the Group Supervisor of the Thermal Energy Conversion Technology and Engineering Group</p><p>The principal focus of this group is the development of advanced thermoelectric materials and Radioisotope Thermoelectric Generator (RTG) technologies to support future NASA missions as well as performing IV&amp;V testing for state-of-the-art RTG technologies, including MMRTG components. Projects in the group include: a) the development of the next generation, high-performance thermoelectric materials beyond state-of-the-art SiGe and PbTe/TAGS-based materials b) infusion of most promising materials into advanced thermoelectric devices for both space and commercial applications with tasks ranging from TRL3 to 5/6 c) advanced RTG design concepts and performance modeling d) RTG life performance prediction e) IV&amp;V for state-of-the art RTG technologies and components, including for MMRTG and the Mod1 RTG under development. The JPL’s Thermal Energy conversion group capabilities range from materials synthesis and processing (powder metallurgy, hot-pressing, spark plasma sintering) to prototype device development and testing as well as life testing and lifetime prediction based on physics-based models.</p><p></p><p><b> <u>Tasks will include:</u></b></p><ul><li>Performing life performance prediction of GPHS-RTGs, MMRTG, and eMMRTG using JPL’s Lifetime Performance Prediction Model (LPPM)</li><li>Analysis/modeling of RTG degradation mechanisms for input into the LPPM model</li><li>Develop advanced RTG design concepts; perform thermal, electrical, and stress analysis (FEA) modeling of advanced RTGs.</li></ul><p></p><p><b><u>Qualifications</u></b>:</p><ul><li>This position requires a PhD degree in physics, mechanical engineering, or a related discipline, plus at least 1 year work experience with RTG systems and technology, with a strong background in modeling the thermal and electrical transport in RTGs.</li></ul><ul><li>Demonstrated experience with modeling of heat transfer, thermoelectric performance, and thermal stress.</li><li>Excellent written and oral communications skills and ability to present at scientific conferences and to write technical reports for publication in peer-reviewed journals and for sponsors.</li><li>Demonstrated ability to establish efficient collaborations with diverse technical teams.</li></ul><p></p><p><b><u>Preferred Skills: </u></b></p><ul><li>PhD with 2&#43; year work experience in physics, mechanical engineering, or a related discipline. </li></ul><ul><li>Experience with JPL’s Lifetime Performance Prediction Model (LPPM)</li></ul><ul><li>Experience with LPPM predictions of GPHS-RTG and MMRTG</li></ul><p></p><p><b>As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$75,608 - $114,816<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Thermal-Energy-Research-Technologist--II_R4463",
    "jobReqId": "R4463",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "startDate": "2023-06-22",
    "timeType": "Full time",
    "title": "Thermal Energy Research Technologist, II"
  },
  "userAuthenticated": false
}
