{
  "jobPostingInfo": {
    "id": "ddf5bd0d8fa21001ad203bb83f560000",
    "title": "Systems Engineer III (Verification & Validation) - Project Discovery",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Formed in 1936, the NASA Jet Propulsion Laboratory is a federally funded research and development center managed for NASA by the California Institute of Technology (Caltech.) JPL joined NASA as an FFRDC when the agency was founded in 1958.<br /> <br />JPL helped open the Space Age by developing America’s first Earth-orbiting science satellite, creating the first successful interplanetary spacecraft, and sending robotic missions to the solar system.<br /> <br />Today JPL continues its world-leading innovation, implementing programs in planetary exploration, Earth science, space-based astronomy and technology development while applying its capabilities to technical and scientific problems of national significance.<br /> <br />Above all, we are explorers. At JPL we promote collaboration, innovation, integrity, and excellence in distinct academic areas. We turn ideas for science investigation into the reality of groundbreaking space missions, partnering with our strategic business teams to guide JPL into the future.</p><p></p><p><b>Project Discovery Reentry Program Description</b></p><p></p><p>JPL understands that we all have different life and career journeys, and we invite you to make us your next step. The Project Discovery reentry program marks the next milestone of inclusivity at JPL as a commitment to equitable career development and advancement opportunities. If you have taken a career break and are ready to return to work – this program is for you!</p><p></p><p>JPL and Project Discovery are part of the STEM Reentry Task Force, the groundbreaking career reentry initiative co-led by the Society of Women Engineers and iRelaunch.</p><p></p><p>The JPL Project Discovery Re-Entry program is looking for talented professionals who are looking to restart their careers after an absence from the workforce for one or more years. This paid one-year returnship role will enable you to work on projects that match your expertise, interests and abilities and could lead to full-time employment. During the returnship program you will have the opportunity to update your skills in a contemporary work environment. You will have access to the latest tools and technologies available and work alongside multidisciplinary teams to hone your expertise and deliver on client-critical solutions. You’ll be able to experience the breadth of JPL resources while developing new skills and building new relationships.</p><p></p><p><b>Note: As a temporary position, this assignment may last up to 12-months.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice. </b></p><p></p><p><b>Job Description:</b></p><p>As a Systems Engineer for the <b>Avionics Subsystem Engineering Group</b>, you will be working for JPL&#39;s <b>Flight Software and Avionics Systems Section</b>, which provides leadership and unique world-class expertise in Avionics Systems Engineering, Spacecraft Flight Software development, Avionics Integration, Test, and Operations and Advanced Processor and Software Research.</p><p></p><p>As a <b>Systems Engineer III </b>in the <b>Avionics Subsystem Engineering Group</b>, you will initially be part of a <b>Systems Engineering Verification and Validation team on Europa Clipper</b>. Individually responsible for the downlink, telemetry, and C&amp;DH functional domain. Will be responsible for orchestrating test plans and writing procedures to verify functionality and validate requirements.</p><p></p><p>You will develop and maintain requirements and interfaces (electrical signals and data definitions) and eventually become a subject matter expert for your functional area(s). You will define, coordinate, balance and integrate technical and programmatic issues in a holistic manner to ensure that the hardware and software system satisfies requirements, expectations, and constraints within the allocated resources and with acceptable risk.  You will also manage technical resources; analyze and model the design; conduct verification and validation activities for the subsystem; contribute to risk management; and control the subsystem change process.</p><p></p><p>Specific responsibilities include:</p><ul><li><p>Develop requirements, functional architecture, design, documentation, and interface definition to external elements.</p></li><li><p>Ensure that the design meets functional and performance requirements and complies with institutional standards, reliability requirements, project requirements, and approved waivers.</p></li><li><p>Develop system architectures and risk management analyses.</p></li><li><p>Work independently on key projects and assignments with only limited direction.</p></li><li><p>Participate in working groups or design teams as needed to conduct trades or resolve technical issues.</p></li><li><p>Develop, prepare and execute verification and validation plans.</p></li><li><p>Present complex avionics concepts to line management, project management and technical reviewers.</p></li><li><p>Provide technical input for all project milestone reviews and management reviews.</p></li><li><p>Track and resolve technical issues within and external to the subsystem.</p></li><li><p>Oversee anomaly tracking, disposition and corrective action for the subsystem.</p></li><li><p>Grow your career through the mastery of multiple Avionics functional areas and the practice of Systems Engineering.</p></li><li><p>Mentor and coach junior members/interns.</p></li></ul><p></p><p><b>Qualifications</b></p><p>This position requires a Bachelor’s degree in Electrical Engineering, Computer Engineering, Systems Engineering or related technical discipline with typically a minimum of 6 years of related experience; a Master’s degree in similar disciplines with a minimum of 4 years of related experience; or a PhD in similar disciplines with a minimum of 2 years related experience.</p><p></p><p>Other requirements include:</p><ul><li><p>Advanced knowledge in one or more of the following areas: <b>Downlink and Telemetry, C&amp;DH, Timekeeping, Compute Elements, Systems Engineering, Digital Electronics, Software, Embedded Systems, and/or Integration and Test.</b></p></li><li><p>Extensive experience with <b>avionics V&amp;V, interface configuration documents, requirement tracing, and embedded software V&amp;V.</b></p></li><li><p>Understanding and practical experience with the concepts and techniques of <b>Systems Engineering</b>.</p></li><li><p>Experience with hardware/software requirements development and configuration management.</p></li><li><p>Demonstrated experience with integrated hardware/software developments.</p></li><li><p>Excellent verbal and written communication skills and the ability to conduct project level reviews and status reports.</p></li><li><p>Ability to interact appropriately with colleagues and customers for different purposes and in different contexts.</p></li><li><p>Adaptable to frequent changes in workload and able to adjust priorities quickly as circumstances dictate.</p></li><li><p>Knowledge of industry and/or academic practices and standards across a range of systems applications.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$122,096 - $154,336<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-02-07",
    "timeType": "Full time",
    "jobReqId": "R3663",
    "jobPostingId": "Systems-Engineer-III---Project-Discovery_R3663",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-III---Project-Discovery_R3663"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Science Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Science-Systems-Engineer-III_R1748",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Flight Systems Engineer III, Verification and Validation",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III_R3753",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-13"
    },
    {
      "title": "Technical Program Manager of Mechanical Systems",
      "externalPath": "/job/JPL-Campus/Technical-Program-Manager-of-Mechanical-Systems_R3768-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-11"
    },
    {
      "title": "Thermal Engineer III",
      "externalPath": "/job/JPL-Campus/Thermal-Engineer-III_R2987",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer III - Fault Protection",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III---Fault-Protection_R3754",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-11"
    },
    {
      "title": "Embedded Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Embedded-Systems-Engineer-III_R3825",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-10"
    },
    {
      "title": "Cable Harness Engineer III",
      "externalPath": "/job/JPL-Campus/Cable-Harness-Engineer-III_R3514",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Flight Systems Engineer III (Sample Retrieval Lander) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Flight-Systems-Engineer-III--Sample-Retrieval-Lander----Project-Discovery_R3660",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Systems Engineer III (TS/SCI)",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III--TS-SCI-_R4066",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 8 Days Ago",
      "startDate": "2023-03-09"
    },
    {
      "title": "Systems Engineer III (Clipper Project V&V Engineer)  - Project Discovery",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III--Clipper-Project-V-V-Engineer-----Project-Discovery_R3658",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Systems Engineer III(Sample Retrieval Lander Payload Avionics Engineer)",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III-Sample-Retrieval-Lander-Payload-Avionics-Engineer-_R3368",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Aerospace Nuclear Safety Engineer III",
      "externalPath": "/job/JPL-Campus/Aerospace-Nuclear-Safety-Engineer-III_R3142",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer III (Sample Retrieval Lander Payload Avionics Engineer)- Project Discovery",
      "externalPath": "/job/JPL-Campus/Microdevices-Engineer-II---Project-Discovery_R3655",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "System Engineer III- (Fault Protection) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Flight-System-Engineer-III---Project-Discovery_R3653",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    }
  ],
  "userAuthenticated": false
}
