{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Enterprise-Systems-Analyst-IV_R4133",
    "id": "5ad2bec1760410016634f42cbad80000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This position will be working with Product Lifecycle Management (PLM) Enterprise System Analysis Group reporting to the Group Supervisor.  You will provide technical, functional and engineering support for JPL specific Oracle Application Development Framework (ADF) Self Service Applications (SSAs) and other related technologies including Product Life Cycle Management commercial off-the-shelf products. You will partner and receive direction from the line management, product leads, and sponsors responsible for the SSAs.</p><p></p><p><u>Responsibilities</u>:</p><p>- Has responsibility for major phases of the lifecycle of a highly complex enterprise system such as Oracle, SAP, Peoplesoft, or Teamcenter and related commercial off-the-shelf products.  </p><p>- Gathers highly complex requirements, analyzes, plans, designs, configures, tests, deploys, rolls out and maintains highly complex enterprise software.  Serves as the key liaison to the customer/sponsor throughout the entire life cycle of the product. </p><p>- Recommends and implements solutions to highly complex issues; advises customer and management. </p><p>- Recommends substantial solutions in the planning of upgrades, enhancements and maintenance.</p><p>- Serves as key interface with customers to facilitate, negotiate and capture requirements for highly and critical complex enterprise applications; advises customer and management.</p><p>- Leads projects or cross-functional /cross organizational teams. Analyzes and uses diagramming tools to represent highly complex and critical processes. Validates requirements.</p><p>- Evaluates highly complex and critical new or existing enterprise information software or standalone applications to align with institutional practices. -</p><p>- Designs enterprise software solutions that meet requirements and integrate with complex institutional enterprise applications with significant impact.</p><p>- Serves as a lead to assigned module or portion of the enterprise. Modifies sets up, and/or configures complex software that integrates with the enterprise suite of applications and/or standalone applications.</p><p>- Responsible for large portions of the integrated test, data conversion and system implementation plans. Ensures the overall quality of assigned applications. </p><p>- Performs highly complex and critical data validation, unit/module tests and complex system integration testing.  Evaluates, validates, and approves highly complex and critical test results. </p><p>- Applies wide ranging experience and advanced knowledge in field to create software documentation for complex applications and/or processes; creates and implements new document standards and templates.</p><p>- Oversees vendor and/or JPL developer to resolve substantial bugs within the applications. </p><p>- Applies wide ranging experience and advanced knowledge in field to assess and evaluate solutions to ensure architecture requirements are met on highly complex and critical enterprise solutions. </p><p>- Recommends improvements to enterprise architectural design.  Ensures software can be integrated into the enterprise.</p><p>- Establishes new configuration and design standards and policies.</p><p></p><p></p><p><u>Qualifications</u>:</p><p></p><p>- Typically requires a Bachelor&#39;s degree in Information Science, Computer Science, Computer Engineering or related a discipline and a minimum of 9 or more years of related practical experience; or a Master&#39;s degree with 7 years experience or a PhD in similar disciplines with a minimum of 5 years related experience. </p><p>- Advanced knowledge in one or more of the following areas: Product Lifecycle Management (PLM), Software Project Management, Oracle E-Business Suite, Custom Software Support, System Configuration Management, Implementation/Support, and Business Process Analysis Expertise. </p><p>- Extensive understanding and wide application of advanced principles, theories, concepts and techniques in: Project Management, Data Management, Requirements Gathering, User Acceptance, Software Quality Assurance, Software Implementation, and User/Customer Support.  This understanding results in contributions to the development of new theories and methods.</p><p>- Extensive working experience and expertise managing applications including hardware/software architecture, planning, configuration, deployment, implementation, technical support, and operations of Software Applications. Plus, a proven ability of providing functional and technical deliverables such as, requirements, training material, helpdesk documents, test cases and test scripts.</p><p>- Previous experience must include the ability to effectively interface with users providing training and technical support. Plus, must have experience leading dynamic teams composed of product leads, project managers, system engineers, solution architects, developers, and operations. </p><p>- Excellent communication skills, written and verbal, must be capable of effectively capturing and transferring technical and functional information at all JPL Level’s. Must have the ability to develop and conduct product demos, user workshops, joint design sessions, training, and user acceptance sessions. </p><p>- Excellent leadership skills, capable of leading, directing and training, software developers, system administrators, system engineers, software quality assurance, other enterprise system analyst, functional users and management. </p><p></p><p><u>Preferred Skills</u>:</p><p>- Experienced at project management and team leadership. </p><p>- Experienced at requirements gathering, design, development and gap analysis with a proven track record of Product Lifecycle Management (PLM) application delivery.</p><p>- Working knowledge of the institutional applications, including hands on experience leading application development and integration projects specific to JPL’s Oracle E-Business modules and/or PLM applications. </p><p>- Capable of managing team task and requirements in JIRA.  Reporting and data analysis. </p><p>- Experience in providing System Engineering Support for the development of requirements specifically for an Oracle Application Development Framework Self Service Application.</p><p>- Experience collaborating with ADF developers to provide the necessary requirements and instructions in the development and successfully delivery of an ADF SSA to operations.</p><p>- Experience coordinating and directing user acceptance testing for an ADF SSA. </p><p>- Experience developing and providing user training for an ADF SSA.  An understanding of the SOA Suite and ADF development.  </p><p></p><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$128,648 - $164,008<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Enterprise-Systems-Analyst-IV_R4133",
    "jobReqId": "R4133",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 19 Days Ago",
    "startDate": "2023-03-22",
    "timeType": "Full time",
    "title": "Enterprise Systems Analyst IV"
  },
  "userAuthenticated": false
}
