{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Enterprise-Applications-Software-Engineer--Temporary-_R3381",
    "id": "3cbc00b6e69d10012675e81c818b0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>Join DesignLab at NASA’s Jet Propulsion Laboratory, and shape the web products we create in support of our community and of our mandate to explore Earth, our solar system, and the universe.</span></p><p></p><p><span>Our web and graphics team seeks an </span><span><b>Enterprise Applications Software Engineer (Senior Web Developer)</b> to plan, organize, design, render, and oversee production of a variety of websites, platforms, and products. They will report to the Web Design and Development Manager and develop, produce, and deliver advanced and unique solutions in support of Laboratory and NASA programs and goals.</span></p><p></p><p><span>Because our mission attracts brilliant minds from all over the world, and from all backgrounds, you must be able to approach each individual and situation with an empathetic heart, an open mind, and a commitment to careful listening. Inclusion is a core value at JPL. The Lab depends on our internal communications team to reflect the range of lived experiences among our approximately 10,000 colleagues.</span></p><p></p><p><b>Job Requirements:</b></p><ul><li><p><span>Significantly contribute to web projects from start to finish, including leading conversations with clients, and architecting solutions. Lead technical estimate creation and self-manage workload to deliver on-time and within budget. </span></p></li></ul><p></p><p><b>Skills and Experience:</b></p><ul><li><p><span>Advanced knowledge and understanding of principles, theories, concepts and techniques in web design and development, hosting and digital production</span></p></li><li><p><span>Advanced skills in Python (Django, Wagtail),  PHP (WordPress, Drupal), JavaScript (Node, Vue/Nuxt), CSS (Tailwind), HTML5</span></p></li><li><p><span>Familiarity with and demonstrated advocacy for web accessibility (WCAG 2.1, 508 compliance)</span></p></li><li><p><span>Experience enhancing and customizing content management systems</span></p></li><li><p><span>Strong communication skills and ability to effectively communicate with non-technical stakeholders</span></p></li><li><p><span>Experience maintaining legacy systems and reducing technical debt</span></p></li><li><p><span>Experience implementing responsive designs and working in a design system (USDS)</span></p></li><li><p><span>Experience working in a team and collaborating to architect enterprise-level systems</span></p></li><li><p><span>Experience with cross-browser/device compatibility and testing</span></p></li><li><p><span>Understanding of SEO concepts and tools, including technical SEO</span></p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p><span>Between 5-7 years of experience working in a web development role</span></p></li><li><p><span>Bachelor&#39;s degree in web development, web design, computer science, communications, or related discipline (preferred)</span></p></li><li><p><span>Background working in the public sector or regulated industries (preferred)</span></p></li><li><p><span>Background working in an agency environment (preferred)</span></p></li></ul><p></p><p><b>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$112,070 - $141,648<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Enterprise-Applications-Software-Engineer--Temporary-_R3381",
    "jobReqId": "R3381",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 27 Days Ago",
    "startDate": "2023-03-01",
    "timeType": "Full time",
    "title": "Enterprise Applications Software Engineer"
  },
  "userAuthenticated": false
}
