{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Graduate-Robotics-Technologist-Intern_R4172",
    "id": "e69c71fb5b7e10016de4ae3770b90000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Opportunity: </b></p><p>The robotics section at JPL is the place where robots for planetary exploration are born! We engage in research, technology development, and the creation of sophisticated robotic autonomy algorithms and software for terrestrial and planetary exploration, from architectural concepts through operations.</p><p></p><p>This is an opportunity to work alongside JPL’s robotics researchers to devise novel data driven fault detection, isolation and recovery algorithms and to use AI/ML techniques to maintain robot’s performance in presence of sensor failures and model uncertainties. A successful candidate has extensive experience in estimation and control techniques for robotics systems. Familiarity with common robotic frameworks such as ROS, familiarity with data driven techniques, and field robotics experience is preferred.</p><p></p><p><b>Qualifications:</b></p><ul><li>Must have the ability to take off school for the program and be able to work (40 hours/week) for a period of at least 3&#43; months.</li><li>Must be currently enrolled in a college or university pursuing masters, or PhD in Aerospace Engineering, Electrical Engineering, Computer Science, Robotics, or related technical field.</li><li>Must have a minimum cumulative 3.0 out of a 4.0 GPA.</li><li>General understanding and application of standard principles, theories, concepts and techniques in robotics software systems.</li><li>Research experience in estimation and control techniques for robotics systems.</li><li>Proficient in C&#43;&#43; and/or Python and familiar with robotic software development.</li><li>Strong written and verbal communication skills to facilitate inter-team information flow and to support review of team products</li></ul><p></p><p><u>The following qualifications are preferred:</u></p><ul><li>Prior research experience in data driven fault detection, isolation, and recovery techniques.</li><li>Hands-on robotic hardware experience.</li></ul><p>The typical hourly rate for this job in Pasadena, California depending on education level is $36 in year 1, $38 in year 2, $41 in year 3, $43 in year 4</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Graduate-Robotics-Technologist-Intern_R4172",
    "jobReqId": "R4172",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 5 Days Ago",
    "startDate": "2023-03-29",
    "timeType": "Full time",
    "title": "Graduate Robotics Technologist Intern"
  },
  "userAuthenticated": false
}
