{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Cyberspace-Operations-Engineer_R4079",
    "id": "32bbf743df7110010597d0ff08610000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u><span>General Overview</span></u></b></p><p>The Office of Information &amp; Technology (IT) Special Programs provides overall IT service delivery to JPL’s National Security Program Office. This exciting fast-paced and specialized IT environment is an enabler for National Security work performed at JPL.</p><p></p><p>The <b>Cyberspace Operations Engineer</b> will be a key member of the Information &amp; Technology Special Programs (ITSP) office and will have responsibility for leading the management of the implementation and delivery of a portfolio of cyberspace services in support of the national security work at JPL. This individual will provide input on architectural definition, sustaining and enhancement activities, compliance, as-well-as recommending and implementing changes to methods, practices, and IT procedures. This individual will partner with other members of the team in informing and executing the ITSD vision and achieving laboratory goals.</p><p></p><p>The <b>Cyberspace Operations Engineer </b>will be a part of a team executing all tactical user delivery and infrastructure operations.</p><p><br /><b><u><span>What You&#39;ll Do</span></u></b></p><ul><li>Execute system and network administration; storage management, network configuration &amp; control, router and other network equipment management, customer service, cyberspace operations and maintenance, and equipment deployments</li><li>Lead help-desk operations and user support functions to ensure cleared users requests are successfully acted upon and completed in a timely manner</li><li>Collaborate with stakeholders to develop processes to provide the highest level of cyberspace customer service, ensure customer satisfaction and continually improve cyberspace service delivery</li><li>Ensures appropriate actions are executed for incident management, problem management, asset control, and configuration management</li><li>Ensure cyber security compliance with federal cyber-security policies and procedures</li><li>Develop and communicate operational status reports, performance analysis, and ad hoc reporting requirements for internal and external customers</li><li>Analyze and solve issues that can impact cyber-resiliency of operations</li><li>Interact with various experience levels of users, engineers, program managers and customers to discern requirements</li><li>Brief and VIP/senior leaders to junior users on various cyberspace subjects</li></ul><p></p><p><br /><b><u><span>Qualifications / Experience / Certifications</span></u></b></p><ul><li>Typical requires a Bachelors with 6 years of related experience, Masters with 4 years of related experience, or PhD with 2 years of related experience.</li><li>Current IAT Level II/III, IAM Level I/II/III 8140 Cyberspace Workforce Management Certification (examples: Security&#43;, CASP, Cloud&#43;, CASP, CISSP)</li><li>Availability to work non-standard hours; early/after hours; nights, weekends as needed</li><li>Available to work both off-site and on-site, in a team environment of internal and external coworkers</li><li>In-scope Top Secret clearance w/ability to be SCI briefed</li><li>Current Counter-Intelligence (CI) Poly highly desired.  Must be willing to submit to a CI Poly</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$111,696 - $139,152<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Cyberspace-Operations-Engineer_R4079",
    "jobReqId": "R4079",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30 Days Ago",
    "startDate": "2023-03-20",
    "timeType": "Full time",
    "title": "Cyberspace Operations Engineer"
  },
  "userAuthenticated": false
}
