{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Senior-Schedule-Analyst-lV_R4083",
    "id": "32bbf743df71100107ad4f2d67400000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>In This Role, you will do the following: </p><ul><li><p>Serve as the lead scheduler to achieve the project’s business goals, utilizing the Institution’s business framework and processes.</p></li><li><p>Build<i> </i>Integrated Master Schedule (IMS), maintain, analyze, and report all project level schedules, associated metrics, and schedule products.</p></li><li><p>Assess and validate the schedule/cost baseline integrity to ensure that it is effective, accurate, and executable.</p></li><li><p>Validate schedule credibility using DCMA 14-Point Assessment or similar tools.</p></li><li><p>Identify and communicate anomalies in the schedule data, analyze horizontal logic and critical path traceability between subsystem schedule plans, recommend and implement mitigated schedule plans.</p></li><li><p>Work closely with the Project Resource Analyst (PRA) team in implementation and verification of the complete cost and schedule integration plan.</p></li><li><p>Maintain detailed network schedules in Microsoft Project Server including the extraction and analysis of various schedule related data required for monthly/quarterly reporting.</p></li><li><p>Assist in development of project’s liens and threats list, support monthly change control board meetings, and incorporate approved liens into the project baseline or estimate at complete (EAC).</p></li><li><p>Assist in the production and presents high level summary schedule reports to the Project/Business Manager, Flight/Instrument Systems Manager, and other key partners.</p></li><li><p>Ensure the execution of schedule plans and estimates for Cost/Schedule liens</p></li><li><p>Promotes and champions best business practices in accordance with established Institutional processes and procedures</p></li><li><p>Analyze and seek opportunities to improve processes that impact various project teams and line organizations.</p></li><li><p>Works on critical, often self-initiated, ad-hoc assignments and projects with minimal direction.</p></li></ul><p></p><p><b><u>This position requires the following qualifications</u></b><b><u>:</u></b></p><ul><li><p>Typically requires a Bachelors degree with a minimum of 9 years of related professional hands-on experience in project scheduling; Masters degree with a minimum of 7 years of related experience; or PhD with a minimum of 5 years related experience.</p></li><li><p><b>Strong experience in developing/maintaining schedule plans, identifying and flagging schedule and cost issues, running what-if scenarios in schedule for mitigation planning, analysis, earned value performance measurement, assessment and reporting, contracts, subcontracts, and procurements.</b></p></li><li><p>Strong Experience on a flight project with emphasis on implementation phases.</p></li><li><p>Demonstrated ability to meet constantly evolving project needs and handle contending priorities.</p></li><li><p>Confirmed leadership skills and demonstrated ability to develop, empower, mentor, and maintain a robust team.</p></li><li><p>Effective communication skills in verbal, written, and presentation forms.</p></li><li><p>Ability to interface effectively with all levels of program/project management, technical organizations, peers, subcontractors, other NASA Centers, and the sponsor.</p></li><li><p>Strong user of Microsoft Office (Word and PowerPoint) with advanced to expert Excel and Microsoft Project Pro skills</p></li><li><p>Ability and passion to rapidly learn new technical skills</p></li><li><p>Experienced user of Milestones Pro, WBS Schedule Pro, STATs Health Check</p></li><li><p>Minimal travel based on business requirements.</p></li></ul><p></p><p><b><u>The following q</u></b><b><u>ualifications</u></b><b><u> are preferred:</u></b></p><ul><li><p>Demonstrated experience in leading the implementation of project resource planning and control activities and earned value management (EVM) on a complex technical project.</p></li><li><p>Experience in a project team environment with project reporting, coordinated cost/schedule planning, EVM, and various performance measurement techniques.</p></li><li><p>Experience with cost-schedule baseline change control processes.</p></li><li><p>Experience in conducting or participating in Integrated Baseline Reviews (IBRs)</p></li><li><p>Experience in all phases of the flight project life cycle.</p></li><li><p>Experience supporting audits and Integrated Baseline Reviews and performing independent assessments</p></li><li><p>Experience coordinating with various NASA centers and industry partners. Able to collect data from other institutions, integrate the data into cost estimates, analyze and communicate results.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$115,440 - $137,488<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Senior-Schedule-Analyst-lV_R4083",
    "jobReqId": "R4083",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 25 Days Ago",
    "startDate": "2023-03-14",
    "timeType": "Full time",
    "title": "Senior Schedule Analyst lV"
  },
  "userAuthenticated": false
}
