{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Business-Administration-Manager--Instrument-Electronics-and-Software-_R4012",
    "id": "5fba210fbccb1000d94225bf8c0c0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p></p><p>The <b>Instruments Division</b> is seeking an experienced business professional for the challenging and dynamic role of <b>Business Administration Manager</b> for the <b>Instrument Electronics and Software Section, </b>and<b> Group Supervisor for the Business Administration Group, </b>reporting to the Division Business Administration Manager<b>.</b></p><p></p><p>The Instruments Electronics and Software Section is responsible for the design, development, delivery, and oversight of instrument electronics, programmable logic, flight software, and electrical systems engineering for the Instruments Division’s instruments. The section is also responsible for guiding the development of new technologies and techniques in these areas to support more capable and efficient instruments in the future.</p><p></p><p>As the Business Administration Manager, you will:</p><ul><li><p><b>Direct all aspects of Business Operations</b>, including but not limited to: Financial Planning, Analysis and Reporting, including institutional overhead and investment accounts, program, and project direct portfolios; Partner with management and Human Resources on Staffing, Employee Relations and Compensation matters; Workforce planning and strategies; Facilities Utilization including modernization and optimization; Acquisition of goods, labor and services; Communications and Change Management; IT Security and Information Management; Property Accountability; Environmental Health and Safety Compliance</p></li><li><p><b>Be responsible for hiring, retaining and managing the performance of a highly qualified business staff</b></p></li><li><p><b>Be an integral member of the Section and Division Business leadership team, working with senior management to develop operating strategies to address current and anticipated organizational needs; play a critical role in meeting schedules and resolving challenges</b></p></li><li><p>Serve as a mentor, providing coaching and development opportunities to direct reports</p></li><li><p>Monitor the activities of the business team and make decisions on work assignments, hiring, promotions, performance appraisals and compensation</p></li><li><p><b>Foster an environment of teamwork and continuous improvement to ensure that business operations run efficiently, and maintain a high level of customer service</b></p></li><li><p>Develop, negotiate and administer the organization’s operations and investment budgets</p></li><li><p>Advise the Leadership team on the financial and non-financial impact of new initiatives, and participate in and/or lead the development and implementation of strategic business plans</p></li><li><p><b>Maintain a safe work environment and ensure employee awareness of and compliance with laboratory policies, procedures and regulatory requirements; serve as a primary information source for the Section</b></p></li><li><p>Act as a liaison for your organization through participation on laboratory committees</p></li></ul><p></p><p><b>Qualifications: </b></p><ul><li><p>Bachelor’s degree in Business Administration, Management, Finance, Business Information Systems, or related business discipline with a minimum of 9 years of related experience; Master’s degree in similar disciplines with a minimum of 7 years of related experience. <b>Minimum of 2 years of supervisory experience</b></p></li><li><p>Wide-ranging experience and advanced knowledge in the fields of: Financial Planning, Analysis, Reporting; Human Resources, Employee Relations, Compensation; Workforce Management; Performance Management; Facilities Utilization, Modernization and Optimization; Property Accountability; Acquisitions; IT Security; Safety &amp; Environmental Compliance</p></li><li><p><b>Proven leadership skills with the ability to motivate individuals and teams</b></p></li><li><p>Significant expertise in financial planning, analytics and reporting</p></li><li><p>The ability to balance multiple, competing priorities with proven accountability in completing work assignments</p></li><li><p>Extensive experience interpreting and implementing policies, processes and procedures</p></li><li><p><b>Demonstrated ability to work, communicate and interact effectively with a broad spectrum of diverse individuals in a team environment</b></p></li><li><p>Strong analytical reasoning skills and problem-solving attributes, using innovation and creativity when approaching new situations and challenges</p></li><li><p>Proven ability to adapt work efforts to meet rapidly changing organizational needs</p></li><li><p>Extensive experience participating in planning, forecasting, implementing, setting objectives and incorporating organizational goals</p></li><li><p>Excellent communication, interpersonal and presentation skills</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Proficiency with JPL institutional business tools or equivalent enterprise business systems</p></li><li><p>Significant experience in analyzing large, complex data sets, interpreting results, and developing recommendations</p></li><li><p>Breadth of experience in managing and implementing cost and schedule planning, forecasting, analysis, earned value performance measurement, assessment and reporting, project controls, and cost estimation.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$126,360 - $167,960<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Business-Administration-Manager--Instrument-Electronics-and-Software-_R4012",
    "jobReqId": "R4012",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 24 Days Ago",
    "startDate": "2023-02-28",
    "timeType": "Full time",
    "title": "Business Administration Manager (Instrument Electronics and Software)"
  },
  "userAuthenticated": false
}
