{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Cryogenic-RF-Microwave-Engineer-III_R4362",
    "id": "7887ef81446a10020f28106cb9d60000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As a <b>Cryogenic RF Microwave Engineer III, </b>you will be a member of the Applied Electromagnetics Group, which is responsible for DSN (Deep Space Network) Antenna Microwave, Transmitter and Low-Noise Amplifier Engineering.</p><p></p><p>In this role you will be responsible for the design and analysis of low-noise amplifiers and related technology for use in NASA&#39;s DSN and projects for other customers. You will design, develop, and test radio frequency (RF) and/or microwave systems architecture, components, circuits, or products that include receiver front-ends. It may include specifying, designing and testing for compatibility with applicable electromagnetic environments. Your responsibilities also include the following tasks:</p><ul><li><p>Contribute to storyboards on Proposal or Concept Study Report (CSR) Development.</p></li><li><p>Apply regular use of creativity and innovation, often leading to significant breakthroughs in discipline.</p></li><li><p>Analysis of situation or data requires identification, review and interpretation of extremely complex factors as well as precedential decisions as to policies, procedures and practices.</p></li><li><p>Exercise discretion and independent judgment in evaluating potential approaches and solutions to new and unusual problems with organization-wide impact and determining appropriate resolutions.</p></li><li><p>Design and develop highly complex and significant RF system architectures.</p></li><li><p>Supply experience and knowledge to support the development of analysis, simulations and tests to verify RF system functionality.</p></li><li><p>Apply knowledge of practices and standards to maintain RF system requirements for systems of significant impact.</p></li><li><p>Implement and deliver state-of- the-art RF system designs that represent significant breakthroughs in discipline.</p></li><li><p>Apply experience and advanced knowledge to design RF components and circuits that are highly complex with significant impact.</p></li><li><p>Develop unique methods and tools for the design of RF components and circuits.</p></li><li><p>Partner with other engineers and management to integrate components into highly complex systems.</p></li><li><p>Lead the activities of the technicians and micro-assemblers in the process of producing related microelectronic devices.</p></li><li><p>Demonstrate independent judgment in the development of systems that integrate low-noise systems with high power transmitters.</p></li><li><p>Exhibit ingenuity and creativity by applying advanced engineering principles to solve key issues with the development and integration of these systems.</p></li><li><p>Develop proposals for new business related to microelectronics and related technology. Will be responsible for the cost and schedule of tasks assigned or won through proposal process.</p></li><li><p>Identify highly complex and significant RF components requirements.</p></li><li><p>Design and develop methods and tools for performance evaluation of current and new RF components, sub-systems, and systems.</p></li><li><p>Design and develop RF components, sub-systems, and systems that represent significant breakthroughs in discipline.</p></li><li><p>Lead the preparation of significant requirements documents, interface agreements, verification and validation (V&amp;V) plans, and risk mitigation plans and executes V&amp;V plan.</p></li><li><p>Lead system and subsystem level test and verification teams and verification plans from subsystem requirements.</p></li><li><p>Create and maintain test bed and lab facilities compliant with flight hardware safety practices.</p></li><li><p>Create change requests.</p></li><li><p>Review design analyses for accuracy and completeness.</p></li><li><p>Lead development of concepts to be used in pursuing JPL business.</p></li><li><p>Coordinate the work of specialist engineers to develop integrated concepts.</p></li><li><p>Lead the development of state-of-the-art technical models.</p></li><li><p>Support the development of storyboards on Proposal or Concept Study Report (CSR) Development.</p></li><li><p>Co-lead and support the development of contract technical documentation and provides contract insight/oversight functions for small contracts.</p></li><li><p>Work independently without direction.</p></li><li><p>Will travel to domestic and foreign work sites.</p></li></ul><p></p><p><u><b>Required Skills</b></u></p><ul><li><p>Bachelors degree in Electrical Engineering, or related technical discipline with a minimum of 6 years of related experience; or Masters degree in similar disciplines with a minimum of 4 years of related experience; or PhD in similar discipline with a minimum of 2 years of related experience.</p></li><li><p>Advanced knowledge and demonstrated experience and capability in two or more of the following:</p><ul><li><p>Cryogenic and vacuum systems.</p></li><li><p>Overseeing the manufacturing and the delivery of State-of-the art RF systems to programs like NASA.</p></li><li><p>Matlab, Python or Labview for automating data collection, ADS or AWR Microwave Office for RF circuit analysis and design (i.e. low-noise amplifier design), HFSS or CST for electromagnetic analysis.</p></li><li><p>RF testing; network analyzers, spectrum analyzer, noise figure meters and power meters.</p></li></ul></li><li><p>Advanced knowledge in the following areas: State-of-the art microwave technology including experience with advanced design and analysis tools for device modeling and circuit design; microwave parameter and noise measurement techniques; microwave device manufacturing processes.</p></li><li><p>Extensive understanding and wide application of advanced principles, theories, concepts and techniques in the manufacture of RF, cryogenic and low-noise amplifier components.</p></li><li><p>Technical expertise in the design, analyze and deliver related technology from the component to the system level.</p></li><li><p>Experience with the ability to independently execute work assignments in new technology hardware design, development and product deliveries.</p></li><li><p>Team player with exceptional communication, interpersonal, verbal and presentation skills.</p></li></ul><p></p><p><b>Desired Skills: </b></p><ul><li><p>Knowledge of Laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications.</p></li><li><p>Interest in developing new customers.</p></li><li><p>Direct experience with associated technologies including digital hardware and monitor &amp; control software. Experience with automated test equipment development.</p></li><li><p>Demonstrated expertise with the development and testing of microwave radiometers and associated systems.</p></li><li><p>Experience with microwave feeds and testing feed components on nearfield/farfield antenna range.</p></li><li><p>MMIC amplifier development.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$126,568 - $153,816<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Cryogenic-RF-Microwave-Engineer-III_R4362",
    "jobReqId": "R4362",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 29 Days Ago",
    "startDate": "2023-05-26",
    "timeType": "Full time",
    "title": "Cryogenic RF Microwave Engineer III"
  },
  "userAuthenticated": false
}
