{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Robotics-Mechanical-Engineer-II_R4558",
    "id": "cae64fcd52b11001253b2390b9cc0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Jet Propulsion Laboratory (JPL) is NASA’s lead center for robotic space exploration.  Our core proficiency is the architecting, implementation, and operation of unprecedented robotic space missions including rovers, orbiters, deep space probes, and satellites, to study Earth, the Solar System, and the Universe.  Through these activities, JPL has visited every planet in our solar system including landing five rovers on Mars.  JPL Employees, known as JPLers, consist of a diverse, multidisciplinary workforce and are challenged to dream big and think big, and to “Dare Mighty Things Together.”</p><p></p><p>This outstanding opportunity is within the <b>Autonomous Systems Division.  </b>This division is responsible for technology development, advanced concepts, design, development, delivery, integration and test, verification and validation, and operation of Command and Data Handling (C&amp;DH) Hardware, Flight Software, Power Systems, Robotic Systems, and Guidance and Control.  The opportunity is being offered by the <b>Mobility and Robotics Systems Section</b><b>.  </b></p><p></p><p><b>Wanted: A Robotics Mechanical Engineer</b> with a strong analytical background who is passionate about supporting the development and analysis of robotic systems and testbeds, for both space and Earth-based systems, from new technology conceptualization and prototyping to flight system verification and validation.</p><p></p><p>Your role may include the analysis-driven design of robotic manipulators or robotic vehicles, performance analysis of as-built robotic systems, performance of trade studies for robotic systems, working with customers to specify design requirements, architecting of flight or prototype robotic systems and robotic testbeds, presentation of designs and analyses to review boards, fabrication of parts, specification of purchased parts, assembly of prototypes and flight hardware, and development/verification testing.  You will be expected to lead a project activity with some oversight, by directing a small technical team, or as an individual contributor within a larger team.  The role is directed by the <b>Group Supervisor </b>within the <b>Applied Robotic Systems Group</b>.</p><p></p><p>Potential work includes both research and flight projects such as:</p><ul><li><p>Mars Sample Return Lander</p></li><li><p>Mars Sample Recovery Helicopters</p></li><li><p>Mars Sample Return Capture/Contain, and Return System</p></li><li><p>Robotic Arm Technology demonstration mission for the Moon</p></li><li><p>Collaborative Robotics demonstration mission for the Moon</p></li><li><p>Europa and Enceladus Sampling Concepts</p></li><li><p>Mine exploration and rescue robots</p></li><li><p>Autonomous underwater vehicles</p></li><li><p>Climbing robots</p></li><li><p>Unmanned aerial vehicles</p></li></ul><p></p><p><b>The following qualifications are required:</b></p><ul><li><p>Bachelor’s degree in <b>Mechanical Engineering, Mechatronics, Robotics</b>, or related technical field with typically a minimum of 3 years related experience; Master’s degree in similar disciplines with a minimum of 1 year related experience; or Ph.D. in similar disciplines.</p></li><li><p>Experience with the conceptualization, architecting, design, analysis, and fabrication/assembly of mechatronic systems or actuated and instrumented robotic systems, including robotic arms, unmanned aerial vehicles, submersible vehicles, rovers, or autonomous cars.</p></li><li><p>Understanding and history applying advanced engineering principles, theories, experiment design, concepts and techniques necessary to conduct analysis-driven design of novel robotic systems including experience with one or more of the following: rigid body dynamics, structural mechanics/dynamics, fluid mechanics, feedback control systems, or terra-mechanics, etc.</p></li><li><p>Exposure to mechanical design; performing trade studies; developing design requirements for robotic systems and testbeds.</p></li><li><p>Some experience developing piece-parts and mechanical systems; and taking part in fabrication, assembly, and test of mechanical, aerospace or robotic systems.</p></li><li><p>Exposure to computational methods, estimation, kinematics, and mathematical modeling of mechanical and/or robotic systems through coursework or application.</p></li><li><p>Experience in design and analysis using one or more CAD programs tools such as: SolidWorks, Siemens NX, Pro/ENGINEER, Autodesk Fusion 360.</p></li><li><p>Proficiency in use of one or more numerical analysis tool kits such as MATLAB, Python, Excel, etc.</p></li><li><p>Exposure to bolted joint analysis, finite element analysis, geometric dimensioning and tolerancing, traditional manufacturing processes, material selection, structures, and mechanisms.</p></li><li><p>Experience working on small teams, project planning, and task management.</p></li><li><p>Proficiency using MS Office suite of business software.</p></li><li><p>Ability to detail, document, and communicate work performed through verbal and written means.</p></li></ul><p></p><p><b>The following qualifications are desired:</b></p><p><b>- Hands on experience working with two or more of the following:</b></p><ul><li><p>Mechatronics, Electro-Mechanical, or Automation Systems</p></li><li><p>Motor Controllers</p></li><li><p>Robotic Mobility Systems</p></li><li><p>Robotic Sampling Systems</p></li><li><p>Robotic Grasping Systems</p></li><li><p>Robotic Manipulation Systems</p></li><li><p>Machine Vision Systems</p></li><li><p>Robotic Motion Planning</p></li></ul><p>- Experience within robotics, aerospace, or automotive student or hobbyist clubs, or competition teams, such as FIRST, RoboSub, Robocup, FSAE, etc.</p><p>- Familiarity with robotic operating system, machine vision, simulation and/or autonomy software such as ROS, OpenCV, Gazebo, etc.</p><p>- Knowledge and experience with finite element and multibody dynamics simulation software such as ADAMS, NASTRAN, Chrono::Engine, ROS, Gazebo, Modelica</p><p>- Familiarity with UNIX operating systems.</p><p> - Outdoor field test experience.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$109,408 - $139,672<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Robotics-Mechanical-Engineer-II_R4558",
    "jobReqId": "R4558",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 2 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-01",
    "timeType": "Full time",
    "title": "Robotics Mechanical Engineer II"
  },
  "userAuthenticated": false
}
