{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Flight-Software-Engineer-III_R3589",
    "id": "fadcf55cb4a01000de3ef7f24d730000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Would you like to see your code sent to the planet Mars?</b> Send your code on a spacecraft orbiting Earth, Jupiter, or an asteroid? Join a fast-paced CubeSat software team? These are some of the unique software challenges that await you at NASA’s Jet Propulsion Laboratory.</p><p></p><p>As an Embedded/Flight Software Engineer for JPL&#39;s Flight Software and Avionics Systems Section, you will be part of a team with unique world-class expertise in Avionics System Engineering, Flight Command and Data Handling (C&amp;DH) Software, Avionics System Integration, Test, Operations, and Software Technology Research.</p><p></p><p>In this specific position, you will be working with <b>low-level flight software</b>, implementing and modifying <b>bootloaders </b>and <b>SUROMs</b>. With us, you will push the envelope of what’s possible and have the opportunity to implement, configure, and modify<b> real-time operating systems</b> and implement or test spacecraft capabilities such command, communication, data management, instrument managers, and fault protection. This position provides many interesting programming opportunities, including working on device drivers. Come join the team!</p><p></p><p>What you will do:</p><ul><li>Modify, implement, and maintain SUROMs and bootloaders.</li><li>Configure and modify real-time operating systems.</li><li>Design and implement real-time flight software for spacecraft in C.</li><li>Develop test plans, unit tests, and evaluate test results. Run tests against simulators and testbeds.</li><li>Identify and troubleshoot technical issues with flight software in an integrated system.</li><li>Work on a team with experienced flight software developers.</li></ul><p></p><p><b>Qualifications</b></p><ul><li>Typically requires a BS in Computer Science or Computer Engineering or related technical discipline with a minimum of 6 years of related experience; Master’s degree in similar disciplines with a minimum of 4 year of related experience; or PhD with 2 years related experience.</li><li>Experience with developing, modifying, and maintaining <b>SUROMs</b> and <b>bootloaders</b>.</li><li>Experience modifying <b>VxWorks</b> and/or <b>Greenhills</b> Integrity at the operating system level.</li><li>Experience with <b>embedded software development</b>.</li><li>Excellent <b>C programming</b> skills.</li><li>Familiarity with assembly language.</li><li>Multi-threaded programming.</li><li>Coursework in operating systems, computer architecture, algorithms, and data structures.</li></ul><p></p><p>Preferred Qualifications:</p><ul><li>Experience with programming languages, software engineering, computer science theory.</li><li>Python or C&#43;&#43;</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$122,512 - $151,424<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Flight-Software-Engineer-III_R3589",
    "jobReqId": "R3589",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2022-12-23",
    "timeType": "Full time",
    "title": "Flight Software Engineer III"
  },
  "userAuthenticated": false
}
