{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Postdoc--Spaceborne-Satellite-tag-RF-Systems-to-Measure-Spatiotemporal-Patterns-of-Wildlife_R4460-1",
    "id": "49344aaf21471001b3265cff538d0001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and on Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and in communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to both contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The Postdoctoral scholars at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</p><p></p><p>As of 2022, the global fauna is estimated to comprise over 7 million species, each with varying home ranges, ranging from tens of meters to thousands of miles for migratory birds. The populations and migrations of wildlife species are rapidly disappearing due to numerous pressures, including poaching, human-animal conflicts, infrastructure expansion, agricultural pesticides, and climate change. For instance, bird populations in North America have witnessed an alarming decline of approximately 29% (~3 billion birds) since 1970. Despite the magnitude of wildlife decline globally, our comprehension of the spatial, temporal, and causal factors behind wildlife population reduction remains limited, which hampers our ability to manage and conserve Earth&#39;s wildlife effectively. Fundamentally, we lack a comprehensive understanding of how, where and when animals interact and transition between habitats. While tracking the movements of animal species has been instrumental in uncovering home ranges and migratory patterns, current satellite animal telemetry systems impose trade-offs between the mass of the tags attached to the animals, the tag energy sufficiency, and the temporal frequency of the measurements, among other factors. These factors have been limiting the deployment of animal tracking tags in large numbers and across animal species at scales relevant to understanding the spatiotemporal patterns of wildlife movements and life events such as death.</p><p></p><p>The selected postdoc will join JPLs Radar Concepts And Formulation group and will be part of a project that aims to investigate spaceborne telemetry concepts to advance satellite-tag systems for global animal tracking, studying the prospects of a suite of innovative observing systems offering affordable communications coupled with low-cost and low-mass tags capable of transmitting data over extended periods at high temporal frequencies and spatial accuracy.</p><p>Postdoc’s tasks:</p><ul><li><p>Conducting a gap analysis comparing existing and planned space systems (such as ICARUS, ARGOS/Kineis) with what is technically, physically, and financially feasible.</p></li><li><p>Assessing the technological readiness level (TRL) for a future NASA mission and evaluating commercial technologies that can be incorporated into the next generation of spaceborne observing systems.</p></li><li><p>Collaborate with JPL Mission Design Teams to develop satellite-tag architectures meeting the requirements of a future NASA mission.</p></li><li><p>Developing and demonstrating a prototype system</p></li></ul><p></p><p>Qualifications:</p><ul><li><p>Applicants should have a Ph.D. in electrical engineering, physics, or a related field.</p></li><li><p>Direct experimental experience in RF systems as applied to microwave sensors, radars, or active or passive RF tags (transponders) is highly desired.</p></li><li><p>Strong background in electromagnetics and RF and microwave engineering is desired.</p></li><li><p>The candidate should have a proven track record of publication in peer-review journals with excellent oral and written communication skills in English.</p></li><li><p>The candidate must be detail oriented, be able to work both independently and in close collaboration with others.</p></li><li><p>We seek a creative and highly motivated person with a strong background in active and passive RF transponder systems for space satellite communications.</p></li><li><p>The candidate should have excellent abilities in RF design, transponder design, backscatter techniques, as well as programming (e.g., MATLAB, Python or C/C&#43;&#43;). Prior experimental experience in emerging fields of long-range active and passive transponders such as RFID (RF identification) are higher desired.</p></li></ul><p></p><p>The appointee will carry out research in collaboration with the JPL advisor resulting in publications in the open literature.</p><p></p><p>Applicants may be subject to additional program requirements by NASA. Postdoctoral Scholar positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years. Candidates should submit the following to this site: CV, representative publications, contact information for three references, and a cover letter stating their research accomplishments and interests.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$82,180 - $82,180<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Postdoc--Spaceborne-Satellite-tag-RF-Systems-to-Measure-Spatiotemporal-Patterns-of-Wildlife_R4460-1",
    "jobReqId": "R4460",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 23 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-07-12",
    "timeType": "Full time",
    "title": "Postdoc: Spaceborne Satellite-tag RF Systems to Measure Spatiotemporal Patterns of Wildlife"
  },
  "userAuthenticated": false
}
