{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Engineering-Development-Technician-III_R4522-1",
    "id": "4e57a7183d1810010f71f46aa9510001",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the<b> Mechanical Fabrication and Test Section</b> which maintains technical support facilities and resources that provide the services required to fabricate, assemble, and test electro-mechanical developmental and flight hardware. This Section develops and matures equipment and technologies, which enable and enhance our fabrication and environmental test capability for current and future missions.</p><p>As the Engineering Development Technician, you will be working for JPL&#39;s Mechanical Fabrication and Test Section which maintains technical support facilities and resources that provide the services required to fabricate, assemble, and test electro-mechanical developmental and flight hardware.</p><p></p><p><b><u>Responsibilities:</u></b></p><ul><li>Provide support for assembly and support testing of mechanical and electronic devices.</li><li>Support projects for fabrication and test of all mechanical and electrical ground support equipment.</li><li>Support Assembly, Test and Launch Operations (ATLO) activities at JPL and at launch site.</li><li>Interface with cognizant or research engineer and suggest test configurations and will perform work in accordance with the test engineers’ procedures.</li><li>Assigned to projects and teamwork with engineers and technicians on the assembly and test of flight spacecraft.</li></ul><p></p><p><b><u>Required Qualifications:</u></b></p><ul><li>Typically requires a High School diploma with 8 years of related experience; related and required training; Associates with 4 years of related experience; Bachelors with 1 years of related experience; related required training.</li><li>Advance understanding, technical expertise and experience in the following areas: Electro-Mechanical Assembly, with strong emphasis on mechanical; Installation, alignment and testing of prototype electromechanical systems; Safe handling and bonding of delicate components, including all surface prep; Fabrication and test of mechanical ground support equipment (MGSE)</li><li>Experience working in 100-10, 000 clean room, and Hi bay protocol.</li><li>Advance understanding of applicable policies, procedures, and practices in handling Flight Hardware.</li><li>Tests and operate equipment from detailed test procedures and make adjustments as required</li><li>Work with limited supervision requiring no instructions on routine work, and general instructions on new assignments.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$78,312 - $98,592<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Engineering-Development-Technician-III_R4522-1",
    "jobReqId": "R4522",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 8 Days Ago",
    "startDate": "2023-07-11",
    "timeType": "Full time",
    "title": "Engineering Development Technician III"
  },
  "userAuthenticated": false
}
