{
  "jobPostingInfo": {
    "id": "d2416af1eefe1001a40777825d0c0000",
    "title": "Cost Engineer Summer Intern",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>In this role at JPL, you will learn how JPL supports mission success by developing credible early-lifecycle cost estimates using relevant historical data from JPL projects and a variety of cost estimation toolsets.  The Engineering Cost Estimation group uses analogous, parametric, and grassroots methods to create competitive mission proposals, support key technical trades, and help decision-makers strategize the future of robotic space exploration. </p><ul><li>Work under the guidance of a Group Supervisor and senior personnel in the Engineering Cost Estimation Group</li><li>Capture cost, schedule, and technical performance parameters for JPL projects at key milestones (e.g., NASA Cost Analysis Data Requirement records)</li><li>Partner with technical and business experts to develop early formulation cost estimates and cost risk analysis</li><li>Support independent cost and schedule assessments of ongoing JPL projects in order to ensure compliance with NASA business requirements</li><li>Learn uses of cost estimation tools</li><li>Explore JPL!</li></ul><p></p><p>As an intern, you will work with full-time cost engineers, learn about their day-to-day responsibilities, and see how the work maps to JPL&#39;s institutional goals.  A typical cost engineer focuses on project formulation, independent assessment, or cost data archiving.  Project formulation includes the development of a cost/schedule baseline, cost validation using a variety of methods, risk assessment, and proposal writing.  Independent assessment includes interpretation of project documents, cost modeling using a variety of methods, risk assessment, and presentations to various levels of management.  Cost data archiving includes reviewing project documentation, interfacing with project technical leads, and development of a detailed record of cost, schedule, and technical performance.</p><p></p><p>Qualifications</p><ul><li>Must be currently enrolled at an accredited college or university pursuing a Bachelor&#39;s degree in business, engineering, or mathematics with a graduation date of December 2023 or later</li><li>Must be able to work full-time (40hours/week) for 10-12 weeks over the summer.</li><li>Must have a minimum cumulative GPA 3.0 out of 4.0</li><li>Must have at least 1 semester or quarter remaining to complete degree</li><li>Knowledge and experience with MS Office</li><li>Experience working with multi-disciplinary teams including finance, engineering, and management roles</li><li>Ability to interpret engineering principles and decisions in terms of cost estimation</li><li>Advanced knowledge of Microsoft Excel (e.g., VBA development, advanced functions, pivot tables, goal seek, scenario development)</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $16.11 as a freshman, $19 as a sophomore, $22 as a junior, $25 as a senior.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 26 Days Ago",
    "startDate": "2023-02-16",
    "timeType": "Full time",
    "jobReqId": "R3790",
    "jobPostingId": "Cost-Engineer-Summer-Intern_R3790",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Cost-Engineer-Summer-Intern_R3790"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Resource Analyst Summer Intern",
      "externalPath": "/job/JPL-Campus/Resource-Analyst-Summer-Intern_R4020",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 15 Days Ago",
      "startDate": "2023-02-27"
    }
  ],
  "userAuthenticated": false
}
