{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-Engineer-Undergraduate--Part-Time-Intern_R4285",
    "id": "129f4f4c50e9100116c43e1afb020000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Academic Part-Time (APX) will be in the Web and Mobile Application Development Group under the Application Consulting, Development and Engineering Section.  If you envision yourself working with a team of dedicated and passionate software developers and engineers, learning new technologies while implementing the best web applications that will help push the boundaries of science and engineering as only NASA Jet Propulsion Laboratory, we want you. You will be provided with hands-on work experience in the application of conceptual and theoretic curriculum within Software and Computing Systems.</p><p></p><p>This Academic Part-Time student will have the opportunity to gain hands-on IT experience in some of the following ways:</p><ul><li>Will partner with lead software engineers in designing, coding and developing software applications and interface solutions that will be delivered into the Enterprise computer systems environment</li><li>Write test cases and conduct unit testing</li><li>Help in maintaining various web applications, including making enhancements</li><li>Under supervision, perform research and conduct experiments on selected technology-oriented topics.</li></ul><p></p><p><b>Qualifications </b></p><ul><li>Must be currently enrolled in a undergraduate degree program studying computer science, software engineering, or related major with a minimum cumulative GPA of a 3.0.</li><li>Must be able to work on-site at JPL.</li><li>Must be able to work a minimum of 20 Hours per week during the school year and full-time during the summer break.</li><li>Knowledge of the principles of collaborative software engineering and software development lifecycle</li><li>Familiarity with web development concepts, standards and languages such as: Python, Java/C#, SQL and noSQL, C/C&#43;&#43;, Javascript, and other web development frameworks</li><li>Understands the principles of relational databases, normalization, and database design</li><li>Familiarity with Windows, Linux, and Mac operating systems</li><li>Completed coursework with exposure to standard principles, theories, concepts and techniques in computer science, information systems or computer engineering</li><li>Experience in multi-layered application software architecture</li></ul><ul><li>Experience in software application design patterns and principles</li><li>Strong analytical skills</li><li>Strong oral and written communication skills</li><li>Superior organization skills</li><li>Team player with strong collaboration skills</li><li>Prior internship experience in related software and computing systems field.</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Software-Engineer-Undergraduate--Part-Time-Intern_R4285",
    "jobReqId": "R4285",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 5 Days Ago",
    "startDate": "2023-05-16",
    "timeType": "Part time",
    "title": "Application Developer Year Round Intern"
  },
  "userAuthenticated": false
}
