{
  "jobPostingInfo": {
    "id": "d2416af1eefe1000c4201de157310000",
    "title": "Quantum Optics Research Technologist",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The <b><span>Optical and Quantum Systems Engineering Group</span></b> provides lifecycle leadership in the formulation, planning and execution of the project systems engineering function for JPL quantum space flight instruments and ground systems. Our expertise includes systems architecting, project system engineering leadership, quantum atomic systems, quantum optical communication systems, optical ground-system development, and flight quantum system operations.</p><p></p><p>We are hiring a Quantum Optics Research<span> Technologist, level II </span>to join our <span>group in </span>support of NASA’s efforts to advance quantum optical science in space.  This experienced position reports to the <span>Optical and Quantum Systems Engineering Group Supervisor. </span> </p><p></p><p><b>Tasks may include but not limited to:</b></p><ul><li><p>Work with senior staff to develop quantum optical ground systems capabilities in support of science experiments</p></li><li><p>Numerical simulation of experiments and mission scenarios utilizing space-Earth quantum communications</p></li><li><p>Contributing to rigorous, quantitative trade studies and system engineering designs of quantum optical systems</p></li><li><p>Conduct laboratory technology development activities related to quantum optics technologies, including single-photon source synthesis, entangled-photon-pair source development, and related integration &amp; test activities</p></li><li><p>Support senior staff in field demonstrations of quantum optics technologies</p></li><li><p><span>Support new quantum-optical flight mission formulation tasks</span></p></li><li><p><span>Support quantum flight instrument development </span></p></li></ul><p></p><p><b>Required Qualifications:</b></p><ul><li><p><span>Bachelor’s degree in Physics, Optical Engineering, or related technical discipline with a minimum of 3 years of professional experience, or Master’s degree with a minimum of 1 years of experience, or Ph.D with a minimum of 0 years of experience.</span></p></li><li><p>Hands-on experience with photonics technology and/or free space optical systems</p></li><li><p>Direct, hands-on experience in the design, assembly, and/or testing of quantum optical systems, such as quantum key distribution systems, entangled photon pair sources, single-photon measurement systems, quantum optical interferometers, etc.</p></li><li><p>Must be a motivated individual who can work effectively within a multidisciplinary team structure</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Experience with the operation, characterization, and/or study of one or more of the following hardware technologies: quantum key distribution; quantum teleportation; quantum memory development; non-cryptographic quantum communications protocols; quantum optical interferometry</p></li></ul><ul><li><p>Experience drafting system documentation, such as requirements documents, test plans, and algorithm description documents</p></li><li><p>Excellent problem-solving skills  </p></li><li><p>Ability to manage multiple issues, tasks, and priorities concurrently.  </p></li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$75,608 - $114,816<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 27 Days Ago",
    "startDate": "2023-02-13",
    "timeType": "Full time",
    "jobReqId": "R3936",
    "jobPostingId": "Quantum-Optics-Research-Technologist_R3936",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Quantum-Optics-Research-Technologist_R3936"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Technologist Level II - Entry Level",
      "externalPath": "/job/JPL-Campus/Technologist-Level-II---Entry-Level_R3813",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-23"
    }
  ],
  "userAuthenticated": false
}
