{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Senior-Engineering-Applications-Software-Engineer_R4341",
    "id": "129f4f4c50e910016b9b4838603d0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>The JPL Communications, Tracking and Radar Division (3300) performs scientific investigations, advanced technology research, engineering developments and system implementations encompassing space telecommunications, tracking and active remote sensing using electromagnetic waves.</span></p><p><span>If you are passionate about spacecraft engineering applications software and hardware engineering, you are invited to join the Flight Communications Systems Section (337). This section provides engineering for the design and implementation of spacecraft telecommunications for the laboratory&#39;s key flight projects. The work spans spacecraft telecommunications systems engineering, telecommunications systems integration, electrical systems integration, fault protection and autonomy design, landing systems design, spacecraft assembly and test, systems verification and validation, and systems modeling.</span></p><p><span>This section is seeking a highly motivated and experienced Level 4 Engineering Applications Software Engineer to join the Communications Support Equipment and Ground Systems Group (337C), reporting administratively to the Technical Group Supervisor and programmatically to the Radio Cognizant Engineer. Your initial assignment will be to serve as an Integration and Test Lead Engineer on flight projects. Some of your initial tasks may include oversight of authoring, executing, and reporting on procedures for the verification and validation of subsystem level requirements, collecting and presenting test data to close requirements, debugging problems in the flight subsystem hardware and software and electrical ground support equipment, and the design and development of electrical ground support equipment in collaboration with other 337C personnel. You will work independently and within a team environment, collaborating on tasks performed across a spectrum of disciplines. Must have excellent writing and oral presentation skills.</span></p><p><br /><span>Tasks may include but are not limited to:<br />• Work with 337C team members to oversee and be in charge of developing and executing integration and test plans, procedures, and I&amp;T documentation.<br />• Work with 337C team members to oversee and be in charge of receiving, verification, and potential modification of electrical ground support equipment hardware and software.<br />• Ensure that subsystem testing is successfully accomplished according to plan.<br />• Attend project meetings and work with other I&amp;T team members to accomplish and meet project goals.<br />• Regularly meet with and lead the I&amp;T team, assess status, review problems, plan short-term and long-term activities as well as present test results at project reviews and meetings.<br />• Participate in multidisciplinary and multi-organizational working groups across government and non-government agencies in order to plan and execute end-to-end testing activities.</span></p><p></p><p><b><span>Qualifications:</span></b></p><ul><li><p>Bachelor’s degree in Engineering, Physics, or related technical discipline with a minimum of 9 years of professional work experience, or Master’s degree with a minimum of 7 years of professional work experience, or Ph.D. with a minimum of 5 years of professional work experience.</p></li><li><p>Extensive engineering applications software engineering experience</p></li><li><p>Integration and test leadership experience</p></li><li><p>Advanced electronic ground support equipment hardware and software experience</p></li><li><p>​Wide-ranging experience on flight projects in integration, test, verification and validation</p></li><li><p>Advanced experience planning for and leading complex hardware and/or software integration activities</p></li><li><p>Wide-ranging experience and advanced knowledge in one or more of the following areas: engineering of space and ground networks, space mission information systems, spacecraft communication systems</p></li><li><p>Proficiency in resolving issues in test development, troubleshooting, training, and interaction with a project and line management in order to ensure that project and line deliverables are met under schedule and budget constraints</p></li><li><p>Proficiency in exercising discretion and judgment in evaluating potential approaches and solutions to critical problems and determining appropriate resolutions</p></li><li><p>Proficiency in recommending and obtaining proper approval for deviations from established policies and procedures</p></li><li><p>Ability to shepherd assignments with limited direction</p></li><li><p>Understanding of principles, concepts, and techniques used in engineering of space and ground networks and space information systems</p></li><li><p>Complete knowledge of industry and/or academic practices and standards across a range of applications related to the operation of space information systems, space/ground networks, space mission operations, and non-NASA missions</p></li><li><p>Recent integration and test experience and significant knowledge and experience in subsystem level verification and validation, integration and test, ground systems, and the function of spacecraft subsystems and instruments</p></li><li><p>Ability to deal with multiple issues, tasks, and priorities concurrently</p></li><li><p>Excellent verbal, written, and presentation skills</p></li><li><p>Availability for occasional domestic and foreign travel</p></li></ul><p></p><p><b><span>Preferred Skills:</span></b></p><ul><li><p>Ability to learn and adhere to JPL and NASA policies and procedures, JPL Flight Project Practices and Design Principles, and JPL system engineering practices; demonstrated ability to tailor the planning and execution of these on missions of various risk classes</p></li><li><p>Proven ability to work effectively in a multidisciplinary and multi-organizational team; ability to work on major project assignments without appreciable direction with accountability for technical performance</p></li><li><p>Experience leading tasks and coordinating working groups on large-scale projects in system development and test</p></li><li><p>Experience with development and delivery of system documentation, such as requirements documents, test plans, test procedures, and other flight project documents</p></li><li><p>Willingness to obtain a security clearance if asked</p></li><li><p>Willingness to travel if asked</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$151,216 - $188,968<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Senior-Engineering-Applications-Software-Engineer_R4341",
    "jobReqId": "R4341",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "startDate": "2023-05-17",
    "timeType": "Full time",
    "title": "Senior Engineering Applications Software Engineer"
  },
  "userAuthenticated": false
}
