{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Science-Data-Operations-Engineer-1_R4174",
    "id": "e69c71fb5b7e1001a7aeabc9cf030000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Do you excel in an environment that values exploration and discovery? We have a universe of opportunities waiting for you!</p><p></p><p>The Jet Propulsion Laboratory (JPL) is NASA’s lead center for robotic exploration of the solar system. Our core competency is the end-to-end implementation of unprecedented robotic space missions to study Earth, the Solar System, and the Universe.</p><p></p><p>The Instrument Software and Science Data Systems (Org. 398) Section within JPL consist of multidisciplinary teams of engineers and technologists who provide expertise across the domains of instrument operations and science data systems. </p><p></p><p>We are responsible for:</p><ul><li>Safely controlling JPL remote sensing instruments.</li><li>Transforming data collected by these instruments into scientific measurements and preserving them for future analyses.</li><li>Providing context and understanding to the measurements.</li><li>Making the measurements and related information accessible to a broad and global user community: scientists, operations, decision makers and society at large.</li></ul><p></p><p>Our engineering teams build and operate high performance data processing, management and analysis systems capable of handling petabyte scale datasets in support of science discovery, research, operations and applications.   They support JPL and NASA missions, as well as other science-based projects.  Our research and technology development teams create new onboard and ground based technologies for data processing, analysis, modeling, reasoning, visualization, management, access and analytics that are infused into our data systems.</p><p></p><p>JPL, located in Pasadena, California, has a casual, campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>We are proud to be part of NASA and Caltech, as we explore the universe and make history through new discoveries. </p><p></p><p>We aim to do things never done before and to go places few can go. We dare mighty things…do you?</p><p></p><p>The Instrument Software and Science Data Systems Section is seeking a Science Data Operations Engineer.</p><p></p><p><b><u>Job Responsibilities</u>:</b></p><p></p><p>Will be a member of the Science Data Operations Engineering Group reporting to the Technical Group Supervisor. We are seeking a highly motivate and enthusiastic Data Operations Engineer to join our team, supporting missions such as the NASA-ISRO Synthetic Aperture Radar (NISAR) mission. The successful candidate will play a key role in assisting the processing, management, and distribution of large volumes of science data generated by Earth orbiting satellites operated by the JPL team, enabling groundbreaking scientific research in Earth observation.</p><p></p><p><b><u>Required Skills</u>:</b></p><ul><li>Educational background: A bachelor&#39;s degree in Engineering, Computer Science, Earth Science, Remote Sensing, or a related field.</li><li>Basic programming skills: Familiarity with at least one programming language, such as Python, C&#43;&#43;, or Java, for data processing and scripting tasks.</li><li>Cloud computing fundamentals: Basic understanding of cloud computing concepts and exposure to cloud-based platforms such as AWS.</li><li>Data management: Knowledge of data storage, organization, and management principles, including ensuring data integrity, accessibility, and security.</li><li>Problem-solving skills: Ability to analyze and solve problems related to data processing, storage, and distribution.</li><li>Teamwork and collaboration: Ability to work effectively both independently and collaboratively within interdisciplinary teams.</li><li>Communication skills: Good written and verbal communication skills, with the ability to present complex information clearly and concisely to diverse audiences.</li><li>Adaptability: Willingness to learn new technologies and methodologies, adapting to the evolving requirements of the NISAR mission.</li><li>Time management: Ability to effectively manage time and prioritize tasks to meet deadlines and project milestones.</li></ul><p></p><p><b><u>Desired Skills</u>:</b></p><p></p><ul><li>Programming languages: Proficiency in Python which is commonly used for data processing and scripting tasks. Understanding of Jupyter Notebooks and Boto a plus.</li><li>Cloud platforms: Knowledge of cloud-based platforms such as AWS, Azure, or Google Cloud, and familiarity with their respective services and tools. Understanding of High Performance computing platforms a plus.</li><li>Containerization and orchestration: Familiarity with containerization technologies like Docker and orchestration tools such as Kubernetes or serverless computing, which are essential for efficient deployment and management of cloud-based applications.</li><li>Synthetic Aperture Radar (SAR) data processing: Interest or background in SAR data processing techniques, including SAR interferometry and polarimetry, which are relevant to the NISAR mission.</li><li>Large-scale data storage: Exposure to large-scale data storage solutions, including distributed file systems, object storage, and cloud-based services.</li><li>Geospatial data formats and standards: Familiarity with geospatial data formats, metadata standards, and coordinate reference systems used in Earth observation and remote sensing.</li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$83,096 - $99,528<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Science-Data-Operations-Engineer-1_R4174",
    "jobReqId": "R4174",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 11 Days Ago",
    "startDate": "2023-03-30",
    "timeType": "Full time",
    "title": "Science Data Operations Engineer 1"
  },
  "userAuthenticated": false
}
