{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Sea-Level-Change-Team--N-SLCT--Technologist_R4640",
    "id": "bbc5223b63e61000ce9d47dd41b70000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>We seek a Technologist to support generation of N-SLCT coastal products in the Sea Level and Ice Group at JPL. You will be expected to perform the following responsibilities: Support cloud infrastructure for deployment of coastal products.</span></p><ul><li><span>Support software infrastructure for download of sea-level remote sensing data. </span></li><li><span>Develop coastal zone products using machine learning algorithms for detection of coastal features.</span></li><li><span>Develop integrated surface altimetry/coastal outline product.</span></li><li><span>Develop capabilities to combine coastal products to generate maps of future coastal inundation.</span></li><li><span>Maintain, validate, and calibrate coastal zone products.</span></li><li><span>Participate in N-SLCT science team meetings to present new products.</span></li><li><span>Be responsible for software maintenance and debugging within ISSM and newly developed software infrastructure.</span></li><li><span>Support coastal community in their download and use of coastal products.</span></li><li><span>Participate in the maintenance of the ISSM and N-SLCT portal websites.</span></li><li><span>Support other technical activities in the group as needed.</span></li></ul><p><span> </span></p><p><b><span>The following qualifications are required:</span></b></p><ul><li><span>Master’s degree in computer science, data science, mathematics, geoscience, or related discipline with typically a minimum of one year of related experience; or PhD degree in similar disciplines. <span> </span></span></li><li><span>Experience with machine learning, in particular as it relates to feature extraction (PyTorch, TensorFlow, Keras, CNN and ANN networks)</span></li><li><span>Experience with Python and Matlab, Jupyter Notebooks.</span></li><li><span>Demonstrated problem-solving ability in research.</span></li></ul><p><span> </span></p><p><b><span>The following qualifications are preferred:</span></b></p><ul><li><span>Experience with GIS systems (such as QGIS).</span></li><li><span>Experience in web systems, WebGL, JavaScript</span></li><li><span>Experience with AWS and deploying software on the cloud</span></li></ul><p><span> </span></p><p><span>Note: As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments. However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</span></p><p><span> </span></p><p><b><span>Complete applications will include a CV, cover letter, and the names and contact information for three references.  Please combine all documents into one PDF.</span></b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$75,608 - $114,816<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Sea-Level-Change-Team--N-SLCT--Technologist_R4640",
    "jobReqId": "R4640",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-14",
    "timeType": "Full time",
    "title": "Sea-Level Change Team (N-SLCT) Technologist"
  },
  "userAuthenticated": false
}
