{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Human-Resources-Academic-Part-Time-Undergraduate-Intern_R4363",
    "id": "7887ef81446a10015e0d3d359a810000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>Job Description: </span></b></p><p>The <span>Human Resources (HR) team</span> at JPL is on a voyage of innovation, discovery, and modernization that will allow us to continue to support the JPL mission and quests. AskHR, the Human Resources Solutions Center, is a centralized function designed to handle a variety of HR-related services. AskHR acts as a single point of entry to access all HR services.</p><p></p><p>As a <span>Human Resources Academic Part- Time Intern (APX)</span>, you will report to the <span>AskHR Manager,</span> and assist the AskHR team with filing, data storage, events, and special projects as follows:</p><p></p><ul><li>Assist with digitization of hardcopy personnel and other HR files.</li><li>Assist with the online data storage, ensuring filing naming structures are accurate.</li><li>Assist with the support of awards programs and distribution of the awards.</li><li>Assist with events and activities such as Award Ceremonies, Wellness Events including Flu Shots and Blood Drives on the day of. </li><li>Assist with the creation of job aids and other reference materials for the team.</li><li>Use the case management system to initiate, escalate, follow up on and resolve employee inquiries.</li><li>Use Workday, Awards, and other HR systems as it relates to the programs for which they are responsible.   </li></ul><p></p><p><b><span>Qualifications: </span></b></p><ul><li>Must be currently enrolled at an accredited local college or university pursuing a Bachelor’s degree in Human Resources or related discipline with a graduation date of December 2023 or later.</li><li>Minimum 3.0 GPA</li><li>Detail-oriented with good organizational skills.</li><li>Strong interpersonal skills and team-based orientation.</li><li>Proficiency in Microsoft Office Suite including Outlook, Word, Excel, and PowerPoint.</li><li>Ability to maintain confidentiality and discretion in daily work.</li><li>Excelled customer focused communication skills (patience, attentiveness, courtesy).</li><li>Excellent written and oral communication skills.</li><li>Demonstrated ability to respond to common inquiries or complaints from customers.</li><li>Ability to work and problem solve independently utilizing available resources and tools.</li><li>Strong written communication skills in order to respond to customer inquiries or document issues in the case management tool as the system of record.</li><li>Flexible and able to effectively prioritize and balance competing <span>priorities working</span> in a fast-paced team environment.</li><li>Familiarity with reporting tools.</li></ul><p></p><p><b><span>Preferred Skills:</span></b></p><ul><li>Experience with HR systems.</li><li>Technical computer proficiency including Workday, HR Solution Center software applications, and disability management tracking system.</li><li>Experience leading and coordinating events and activities that involve over 500 people.</li><li>Demonstrated capability to make strategic improvements to programs that results in improved utilization. </li><li>Experience creating, running and <span>validating reports</span> in Workday or other HRIS systems.  </li><li>Capability to create metrics and dashboards in Workday or other HRIS systems. </li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $16.11 as a freshman, $19 as a sophomore, $22 as a junior, $25 as a senior</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Human-Resources-Academic-Part-Time-Undergraduate-Intern_R4363",
    "jobReqId": "R4363",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 10 Days Ago",
    "startDate": "2023-05-24",
    "timeType": "Part time",
    "title": "Human Resources Academic Part-Time Undergraduate Intern"
  },
  "userAuthenticated": false
}
