{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Mars-Strategic-Communications-Manager_R4532",
    "id": "4e57a7183d18100122367a6477400000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The goal of the Mars Exploration Program is to explore Mars and to provide a continuous flow of scientific information and discovery through a carefully selected series of robotic orbiters, landers and mobile laboratories interconnected by a high-bandwidth Mars/Earth communications network. The Mars Sample Return (MSR) is a highly ambitious program that builds upon decades of science, knowledge, and experience of Mars exploration. Attempting to answer some of humanity’s biggest questions, NASA in partnership with the European Space Agency (ESA) and wider industry, plan to return rock, soil, and atmospheric samples from the surface of Mars to Earth. These samples have the potential to profoundly change human understanding of the origin, evolution, and distribution of life on Earth, and elsewhere in the solar system. Returning samples from Mars will also help NASA prepare for sending humans to Mars.</p><p></p><p><b>Responsibilities:</b></p><ul><li><p>JPL is seeking a Communications Manager for the Mars Program to build forward-thinking communication campaigns, through collaboration, consensus building, strategic planning and creativity to serve NASA’s Mars Sample Return (MSR) program and the Mars Exploration Program (MEP). </p></li><li><p>The Mars Program Communications Manager will be responsible for leading and managing a multi-disciplinary communication team focused on integrated communications planning and execution, the use of innovative ideas, and collaborating with other teams and Mars Program Subject Matter Experts (SMEs) to spark creativity and ongoing improvements for shaping communication products and programs with significant and far-ranging impact on the performance of and in service to the Mars Program and NASA’s communications strategy.</p></li><li><p>The ideal candidate will have demonstrated integrated communications planning and campaign management experience addressing complex business and/or program requirements and will have an excellent understanding of stakeholder ecosystems (e.g., public, internal audiences, technical teams, Legislative Affairs, international partners/suppliers).  They will be skilled in the art of working with multiple Program SMEs, distilling complex technical information into impactful and innovative communications proposals and products to engage and inspire.</p></li><li><p>The Mars Program Communications Manager will provide strategic direction and expertise to develop products and messaging geared to all stakeholders groups inclusive of the public, NASA, aerospace, international partners, science communities and Program teams. The candidate will also leverage Mars Program SMEs to build a clear understanding of different stakeholder communications needs and partner closely with SMEs on tactical approaches to engage. The candidate will collaborate with content development teams on communications requirements and messaging including media relations, events, branding and digital engagement and identify gaps and opportunities for communications products, support content teams and stakeholder SMEs in product development when necessary.</p></li></ul><p></p><p>The Mars Program Communications Manager will lead and be accountable for the performance of the Mars Program communication team and in collaboration with other communication, education, media and design services teams at JPL, NASA, and our partners, will deliver an integrated communications strategy with the following key elements:  </p><ul><li><p>Responsible for leading, hiring and retaining a diverse, highly qualified staff, providing career coaching, growth, and personal development.</p></li><li><p>An integrated timeline lookahead (short and long-term) to anticipate opportunities and risks; provides counsel on proactive and reactive messaging.</p></li><li><p>Will leverage Mars Program SMEs to build a clear understanding of different stakeholder communications needs to develop products and content that are focused, relevant and timely.</p></li><li><p>Will closely coordinate with the MSR and MEP Programs, senior management at JPL and key stakeholders including project leads across NASA, NASA HQ, project engineers, scientists, Legislative Affairs, Media Relations, Public Engagement, Communications Services and JPL’s in-house design team.</p></li><li><p>Will brief and collaborate with content development teams on communications requirements and messaging including media, events, branding and digital products.</p></li><li><p>Will identify gaps and opportunities for communication products, support content teams and stakeholder SMEs in product development.</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p><i><b>Bachelor’s degree in Communications, Advertising/Marketing, Public Administration, Public Policy, Business Development/Management, or related discipline with a minimum of 9 years of related; or Masters with 7 years of related experience; or PhD with 5 years of related experience</b></i></p></li><li><p><i><b>Minimum 2 years of leadership experience.</b></i></p></li><li><p>Demonstrated experience in advising and counseling senior leadership on communications strategy across multiple stakeholder groups, internal and external, including the wider space and technology industry.</p></li><li><p>Excellent interpersonal and collaboration skills and demonstrative experience in briefing, coordinating, and connecting teams to deliver, including leading, managing, coaching and directing the Mars Communication Team. </p></li><li><p>Excellent situational awareness of macro-operating environment, geo-politics, global partnership needs and requirements; keeps current on relevant industry, economic, governmental issues that should be reflected in or referenced in communications.</p></li><li><p>Demonstrated understanding of the communications ecosystem of channels (events, media, social/digital) tactics, and how to integrate them effectively with attention to budgets, resources, and deadlines.</p></li><li><p>Excellent writing and presentation skills, including developing and editing products ranging from talking points, response to queries (RTQs), frequently asked questions (FAQs), editorial copy to PowerPoint presentations.</p></li><li><p>Ability to take both a short and long-term view to strategic planning, proactively getting ahead of issues to mitigate and opportunities to leverage.</p></li><li><p>Ability to juggle constantly changing priorities and deadlines and maintain good judgment while working under pressure.  </p></li><li><p>Ability to take initiative balanced with effective team skills.</p></li></ul><p></p><p><b>Preferred Skills: </b></p><ul><li><p>Prior experience working effectively with multiple government and NASA stakeholders across a variety of strategic and budgetary issues strongly preferred.</p></li><li><p>Previous public outreach and communications experience, especially within NASA environment highly desirable.</p></li><li><p>Experience in supporting senior leadership highly desirable.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$116,688 - $155,168<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Mars-Strategic-Communications-Manager_R4532",
    "jobReqId": "R4532",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 11 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-17",
    "timeType": "Full time",
    "title": "Mars Strategic Communications Manager"
  },
  "userAuthenticated": false
}
