{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Business-Operations-Analyst_R4225",
    "id": "b95ed74107fc10014de04f76b1370000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This outstanding opportunity is with JPL&#39;s <b>Mechanical Systems Engineering, Fabrication and Test Division</b> that engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breath of mechanical subject areas and is applied from architectural concept development through operations.</p><p></p><p>As a <b>Business Operations Analyst II,</b> you will be supporting the<b> Payload and</b> <b>Small Spacecraft Mechanical Engineering Section, </b>which is responsible for the structures, mechanisms, and mechanical systems engineering of payloads and small spacecraft across all phases of the mission lifecycle. This is a phenomenal chance to be a member of the Business Team and provide operations / analyst support and implement a broad range of business functions in concert with the <b>Business Manager</b>. The organization is team based, improvement oriented and believes that work can be enjoyable!</p><p></p><p>This position is well-suited for an individual who enjoys balancing multiple priorities, using data analytics to make logical inferences, and being part of a team.</p><h2></h2><h2></h2><h2><b>Specific responsibilities include:</b></h2><ul><li><p>Financial analysis and reporting, workforce planning, acquisition partnerships, processing personnel requisitions, rewards and recognition, and various human resources activities.</p></li><li><p>Provide administrative management to the Multi-divisional Engineering, Design, Analysis Lab-wide Support (MEDALS) Contract including: invoice review, quarterly metric reporting and analysis, Subcontract Work Order (SWO) submissions, affiliation inquiries, and closeout.</p></li><li><p>Prepare monthly and/or quarterly scheduled financial analysis, reports, and data capturing as requested by management for planning, performance reporting and forecasting.</p></li><li><p>Partner with Technical Staff to resolve and detail staffing plans, workforce forecast analysis and workforce reports.</p></li><li><p>Collaborate with customers to achieve business objectives and increase the efficiency of the organization while serving as a liaison on a variety of business-related matters.</p></li><li><p>Assist in developing, coordinating, and improving procedures and reporting within the organization to meet JPL’s administrative and business requirements.</p></li><li><p>Perform ad hoc duties as assigned.</p></li></ul><p></p><h2><b>Qualifications:</b></h2><ul><li><p>Typically requires a Bachelor’s degree in Business Administration or related field with a minimum of 3 years of related experience; Master’s degree in similar fields with a minimum of 1 year of related experience; PhD with 0 years of related experience.</p></li><li><p>Experience in one or more of the following areas: business administration, finance, workforce planning, business information systems, acquisitions, and human resources.</p></li><li><p>Strong analytical and problem-solving skills; able to resolve issues independently.</p></li><li><p>Ability to present findings in a clear, concise manner using graphics, tables and high-level summarization.</p></li><li><p>Experience and knowledge in financial analysis, forecasting and trend analysis.</p></li><li><p>Record of maintaining perseverance and composure in a multifaceted work environment, with the ability to exercise discretion and independent judgment in evaluating potential solutions.</p></li><li><p>Proficiency in the Microsoft Office Suite of applications (Word, Excel, PowerPoint, Access, Outlook).</p></li><li><p>Self-starter that thrives working independently and in a team environment.</p></li><li><p>Strong professional characteristics: diligent, responsible, hardworking, and intellectually curious. The ideal candidate takes initiative and ownership of their work and possesses an improvement mentality.</p></li><li><p>Excellent customer service, organizational, interpersonal, verbal and written communication skills.</p></li></ul><p></p><h2><b>Got These? Even Better:</b></h2><ul><li><p>Extensive understanding and wide application of standard principles, theories, concepts and techniques in Business Administration, Financial Planning, Workforce Administration, Strategic Partnerships</p></li><li><p>Experience with reporting tools such as Data Extractor, Workday, OBIEE Analytics, Institutional Budgeting Tool (IBT), Power BI, Power Query, and JPL web applications.</p></li><li><p>Knowledge of applicable Laboratory and/or NASA policies and procedures, and government regulations and exposure to JPL’s Institutional business processes and architecture.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$83,304 - $101,400<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Business-Operations-Analyst_R4225",
    "jobReqId": "R4225",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-04-19",
    "timeType": "Full time",
    "title": "Business Operations Analyst II"
  },
  "userAuthenticated": false
}
