{
  "jobPostingInfo": {
    "id": "60d69cc108801000bfc32b65bb8a0000",
    "title": "Resource Analyst Summer Intern",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Responsibilities</u></b></p><p>The Project Controls Section provides project cost and schedule control, planning, and analysis support to JPL’s programs and projects. You will be an intern gaining hands on experience directly supporting programs/projects and will be reporting to a Group Supervisor within 252. Responsibilities will include some combination of:</p><ul><li>Provides project resource planning, cost control, reporting, and analysis support, as appropriate</li><li>Assists analysts with a variety of basic financial management reporting on a periodic basis and of a statistical nature.</li><li>Reviews, evaluates, provides recommendations and requirements, and develops standardized reports</li></ul><p></p><p><b><u>Qualifications</u></b></p><p><i>Required Qualifications:</i></p><ul><li>Must be currently enrolled at least half time at an accredited college or university pursuing a Bachelor’s degree in Business Administration, Finance, Management, Computer Information Systems, Information Technology or similar disciplines.</li><li>Minimum cumulative GPA 3.0 out of 4.0 or equivalent</li><li>Must be available to work during the Summer Full time (40 hours per week).</li><li>Must have familiarity in one or more of the following areas: Business Administration, Business Management, Financial Analysis, Economics, Budgeting and Reporting, or Workforce Planning.</li><li>Completed coursework with exposure to standard principles, theories, concepts and techniques in Business Administration and Operations.</li><li>Knowledge and experience with MS Office, especially excel.</li><li>Demonstrated leadership abilities</li></ul><p></p><p><i>Desired Qualifications:</i></p><ul><li>Strong written and verbal communication skills and ability to work in a team environment.</li><li>Collaborative, works well with others, takes direction well, problem solver, detail-oriented</li><li>Excellent customer service skills.</li><li>Prior internship/volunteer experience in related business disciplines.</li><li>Participation in student/volunteer organizations.</li><li>Strong analytical skills</li><li>Advanced Excel skills</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $16.11 as a freshman, $19 as a sophomore, $22 as a junior, $25 as a senior.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 20 Days Ago",
    "startDate": "2023-02-27",
    "timeType": "Full time",
    "jobReqId": "R4020",
    "jobPostingId": "Resource-Analyst-Summer-Intern_R4020",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Resource-Analyst-Summer-Intern_R4020"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Cost Engineer Summer Intern",
      "externalPath": "/job/JPL-Campus/Cost-Engineer-Summer-Intern_R3790",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-16"
    }
  ],
  "userAuthenticated": false
}
