{
  "jobPostingInfo": {
    "id": "870347114ed710010f3d8823b57f0000",
    "title": "Human Resources Data Scientist IV",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As an HR data scientist on our people analytics team, you will be responsible for strategic analytics initiatives, people research, and experimentation. You will solve essential business and HR challenges around attracting, developing, retaining, and motivating the best talent. You will focus on key issues such as predicting great hires or employees at risk of leaving, and supporting our company’s employee engagement as well as diversity and inclusion goals and objectives.</p><p></p><p>Your responsibilities will encompass quantitative analytics, predictive modeling, research design, consulting, and soft skills applicable to people research in an organizational setting. You will work directly with the Manager, Human Resources Information Systems, as well as data analysts, systems analysts, HR Business Partners, and HR Executives. You will serve as an active partner to HR and people leaders to diagnose business needs, identify areas for improvement, and leverage data to help leaders achieve their goals.</p><p></p><p>You are a champion for predictive analytics and forward thinking - you stay plugged into what’s happening with customers, the workforce and its issues, the HR community, competitors, and the global marketplace. You enjoy constantly learning and growing your skills in people analytics and data science.</p><p></p><p><b>Responsibilities</b></p><ul><li><p>Seek to understand complex HR people-related business problems and help frame them into actual research questions that can be answered with data.</p></li><li><p>Partner with Manager, Human Resources Information Systems to set reporting and data analytics strategy and guide team to operationalize.</p></li><li><p>Develop innovative data driven approaches to help our business leaders understand and act on people issues.</p></li><li><p>Translate data and insights into meaningful visualizations and stories to drive strategy, action, and decision-making at executive levels, within HR, and with people managers.</p></li><li><p>Use platforms, programming, and systems to establish single-source data to be leveraged across the business to support insights and improve decision-making.</p></li><li><p>Apply big data techniques to small data problems.</p></li><li><p>Design academically rigorous research studies within the context of our business and industry.</p></li><li><p>Lead a team of individuals that will focus on data-driven and evidence-based research to support delivery of HR people metrics, reporting, advanced and predictive analytics.</p></li><li><p>Align research priorities with business priorities to provide stakeholders best practice solutions</p></li><li><p>Leverage academic expertise and knowledge of HR industry and people analytics trends to address practical business challenges.</p></li><li><p>Collaborate with and communicate broadly within HR, IT, and the business to expand our data universe and publish analyses.</p></li></ul><p></p><p><b>Qualifications</b></p><ul><li><p><b>Bachelor’s with 9 years of related experience; Masters with 7 years of related experience; or PhD with 5 years of related experience.</b></p></li><li><p>Experience in a quantitative field where research and methods have direct applicability to people research in organizations (may include, but not limited to, data science, statistics, economics, organization behavior).</p></li><li><p>Demonstrated experience managing and analyzing both structured and unstructured data.</p></li><li><p>Experience in advanced statistical methods around hypothesis testing, clustering, machine learning predictions, and text mining.</p></li><li><p>Experience modeling high dimensional data.</p></li><li><p>Experience with tools and languages such as SQL, R, Python, Tableau, or Visier, and in the design and implementation of data pipelines that support the continuous delivery of insight.</p></li><li><p>Understanding of the external HR people analytics landscape, benchmark sources and trends.</p></li><li><p>Demonstrates good judgment and adaptability to support organizational agility.</p></li><li><p>Strong written and oral communication skills including data visualization, presentation and explanation of results.</p></li></ul><p></p><p><b>Preferred skills</b></p><ul><li><p>Strong analytical and mathematical skills</p></li><li><p>Team building mentality</p></li><li><p>Ability to advocate for data solutions</p></li><li><p>Knowledge of the Workday HCM platform</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$146,952 - $189,384<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-02-07",
    "timeType": "Full time",
    "jobReqId": "R3901",
    "jobPostingId": "Human-Resources-Data-Scientist-IV_R3901",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Human-Resources-Data-Scientist-IV_R3901"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Data Scientist IV",
      "externalPath": "/job/JPL-Campus/Data-Scientist-IV_R2755",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    }
  ],
  "userAuthenticated": true
}
