{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Small-Business-Administrator-1_R4247",
    "id": "590602e9529a1001bdab7cf4ec660000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL’s Small Business Programs Office (SBPO) is a part of the Acquisition Division and the Small Business Administrator (SBA) position is responsible for performing various types of activities that directly impact the goals and missions of JPL. One of the key aspects of the SBPO charter is to increase the utilization of small businesses to meet the prime contract goals and thus increase the diversity of the JPL supplier database. As an SBA you will support the following activities:</p><p></p><p><b>Data Analytics: </b>You will support JPL by conducting data analysis and report preparation using socioeconomic data from the Lab’s Oracle system. Strong Microsoft Excel and PowerPoint skills are required to manipulate and analyze data, and to prepare reports for JPL leadership.</p><p></p><p><b>Sourcing</b>. You will approve source lists in accordance with Acquisition Instructions and will submit additional small business sources for source-list approval whenever practical.</p><p></p><p><b>Subcontracting Plan Approval/Waiver</b>. You will review subcontracting approval and waiver requests and process accordingly. The SBA will be responsible for obtaining necessary information from the Subcontract Manager (SCM) to make an informed decision.</p><p></p><p><b>Mentor Protégé Program</b>. Will work in assisting the SBPO and the JPL technical representative in administering an agreement.</p><p></p><p><b>Requests for Information (RFI) Postings</b>.</p><p></p><p><b>NASA Vendor Database (NVDB).</b> Will use the NVDB to assist with sourcing and special announcement postings.</p><p></p><p><b>Constant Contact</b>. Will use e-mailing software to issue the monthly newsletter as well as any special announcements.</p><p></p><p><b>Small and Large Business Councils</b>. Will participate in meetings and provide support and analytical skills relative to issues raised.</p><p></p><p><b>ISR/SSRs</b>. Will assist SCMs in the evaluation of the Individual Subcontract Reports (ISR) and Summary Subcontract Reports (SSR) submitted by large businesses and JPL. Your evaluation will address the achievement of the subcontract goal against actual performance as reported by the large business.</p><p></p><p><b>Website. </b>You will provide inputs and updates to the website to ensure the information relative to the SBPO data is current.</p><p></p><p><b>External Communications. </b>Will work with Small Business Specialists from other NASA centers.</p><p></p><p><b>Outreach Events.</b> Attend local and national events.</p><p></p><p>QUALIFICATIONS</p><ul><li>Typically requires a Bachelor’s degree in Business Administration, or related discipline with a minimum of 1 year of related experience or a Masters degree in Business Administration with 0 years of related experience.</li><li>Strong Microsoft Excel, PowerPoint and Adobe Acrobat DC skills are required</li><li>Ability to support negotiating strategies (i.e. Small Business Set Aside) to foster the objective of small business utilization.</li><li>Ability to find creative ways to keep the JPL community apprised of the services of the SBPO and the capabilities of small businesses.</li><li>Excellent written and verbal interpersonal skills and very proficient with Microsoft Office suite of software.</li><li>Positive relationship building skills and capable to work well with others in a team oriented environment.</li></ul><p></p><h2>Desired Qualifications:</h2><ul><li>Experience supporting a small business program.</li><li>Creativity, flexibility, and resourcefulness in finding solutions to multiple challenges.</li><li>Ability to develop and deliver business presentations in group settings, including subcontract management meetings and training.</li><li>Ability to direct a team for a project activity, or function within scope of assigned responsibility.</li></ul><p></p><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$65,208 - $76,024<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Small-Business-Administrator-1_R4247",
    "jobReqId": "R4247",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 14 Days Ago",
    "startDate": "2023-04-27",
    "timeType": "Full time",
    "title": "Small Business Administrator 1"
  },
  "userAuthenticated": false
}
