{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Maintenance-and-Operations--Energy-Management-Control-System-Engineer_R4177",
    "id": "e69c71fb5b7e1001bcec446034250000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>In this role, you will be a member of the Facilities Maintenance &amp; Operations Section and will report to the Facilities Maintenance &amp; Operations Supervisor.  You will be responsible for the collection and validation of information and data from multiple sources for analysis and reporting.  Will perform mechanical and root cause analysis on Energy Management Control Systems (EMCS) applications.  The selected candidate will have the responsibility to analyze EMCS and HVAC for input into various reporting tools for both JPL and NASA.    </p><p></p><p>Inspect, and evaluate the quality of work performed by subcontractors.  Identify a representative random sample of EMCS PMs and other planned maintenance work orders, inspect work for compliance to job plans, quality of work, cleanliness of equipment rooms and related work areas, etc.  Identify deficiencies in work performed and reference contract clauses where subcontractor is in non-compliance.  Maintain and generate reports to verify subcontractor performance.  Identify projects beyond the scope of the sub-contractors area of responsibility and submit the projects to Engineering and Construction for implementation.  Analyze the Facilities Condition Assessment program, Deferred Maintenance studies, and support numerous miscellaneous audits as required.  Perform design reviews and plan checks for EMCS new construction and reconstruction projects.  Participate in punch walks and report findings.  Intervene and provide assistance directly with customers unable to obtain satisfaction with the sub-contractor.  Assist in identifying and implementing energy conservation projects throughout the Laboratory.</p><ul><li><p>Reviews EMCS work of Subcontractor to ensure that the configuration aligns with our customers’ requirements.</p></li></ul><ul><li><p>Ensures installation and repair of Facilities equipment and systems are performed according to regulatory standards.</p></li><li><p>Conducts technically challenging quality inspections, identifying work deficiencies, assisting in conducting root cause failure analyses.</p></li><li><p>Implements preventive/ predictive maintenance programs as needed.</p></li><li><p>Conducts simple investigations in Failure Mode Analysis &amp; Root Cause Analysis on equipment failures equipment downtime.</p></li><li><p>Evaluates the data from the quality inspection to recommend improvements to plant reliability.</p></li><li><p>Contributes to the continual improvement of Plant Reliability, through measurement of Maintenance Effectiveness and Maintenance efficiency practices including Preventative and Predictive Maintenance tools and practices.</p></li><li><p>Contributes in the facilities energy management system and energy conservation.</p></li><li><p>Participates and contributes on teams or via ad hoc assignments with engineers at other NASA Centers to review, update, and develop facilities procedures, guidelines, standards, and practices. Centers of Expertise (CoE’s) and peer working teams are examples.</p></li><li><p>Collaborates with operations personnel in troubleshooting highly complex mechanical problems and implementing technology improvements, provides guidance and training as appropriate to promote proper operation and maintenance of equipment.</p></li><li><p>Supports the HVAC team related to identifying and troubleshooting HVAC related issues.</p></li></ul><p></p><p><b><u>The following qualifications are required:</u></b></p><ul><li><div><p>Typically requires a Bachelor’s degree in Mechanical engineering and/or computer science, or related discipline with a minimum of 6 years of related experience; or Masters degree in similar discipline with a minimum of 4 years of related experience. </p></div></li></ul><ul><li><p>Knowledge in Energy Management Systems programming and troubleshooting aspects.</p></li></ul><ul><li><p>Understanding of principles, theories, concepts and techniques in HVAC; understanding of technical developments with specific emphasis on EMCS, HVAC and facility maintenance methods.</p></li><li><p>Knowledge of applicable practices and standards in the reviewing and updating Energy Management Control System procedures and guidelines related to HVAC mechanical systems.</p></li><li><p>Experience with Tridium/Niagara/Siemens EMCS.</p></li><li><p>Demonstrated experience/knowledge of Direct Digital Controls (DDC) hardware and electrical systems, BAS, and energy management.</p></li><li><p>Troubleshooting capabilities with Niagara/Tridium-Siemens systems.</p></li><li><p>Experience with EMCS standards and specifications.</p></li><li><p>HVAC principle and troubleshooting capabilities.</p></li><li><p>Proficient in MS Office programs and PC application programs.</p></li><li><p>Experience in problem solving; demonstrated excellent verbal and written communication skills; documentation skills; self-starter; ability to work with project teams in a dynamic and fast paced, technical environment.Ability to work effectively as a member of a team and independently.</p></li></ul><p></p><p></p><p><b><u>Preferred Qualifications: </u></b></p><ul><li><p>Strong ability, desire and flexibility to take on assignments as they are generated within the Jet Propulsion Laboratory (JPL) Facilities Maintenance and Operations (M&amp;O).</p></li><li><p>CEM designation.</p></li><li><p>Tridium Certified.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$91,728 - $125,632<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Maintenance-and-Operations--Energy-Management-Control-System-Engineer_R4177",
    "jobReqId": "R4177",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 29 Days Ago",
    "startDate": "2023-03-30",
    "timeType": "Full time",
    "title": "Maintenance and Operations, Energy Management Control System Engineer"
  },
  "userAuthenticated": false
}
