{
  "jobPostingInfo": {
    "id": "870347114ed7100157bb0f17aabd0000",
    "title": "Audit Summer Intern",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers. We build upon ideas that have guided generations, and then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one-step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL</p><p></p><p>The Jet Propulsion Laboratory (JPL) is a world leader in robotic space exploration. Located in Pasadena, California, JPL has a casual, campus-like environment situated on 177 acres, in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>We are seeking a motivated and analytical individual that can work well, both independently and in a team environment, to serve as a Summer Undergraduate Student (SUM) in our Subcontractor Audit &amp; Compliance Office (SACO), operating under the Controller and Financial Planning Office (CFPO).</p><p></p><p><u><b>Responsibilities:</b></u></p><p>As a Finance Summer Intern, you will be partnered/mentored by other staff members, and will report to the Group Supervisor.</p><p></p><p><b>Tasks include:</b></p><ul><li>Working on day-to-day assignments under direct supervision; receiving detailed instructions on new assignments;</li><li>Assist in assessing risk and performing audits of subcontractor systems, internal controls, incurred costs, compliance, and other ad-hoc projects;</li><li>Perform tasks related to various phases of audits, including but not limited to, planning, fieldwork, documentation, data analytics and visualization, and reporting;</li><li>Assist in evaluating the adequacy of internal controls design; contribute to risk assessments, and the development of audit programs;</li><li>Research industry, contractual, regulatory and statutory guidelines and requirements applicable to the engagements;</li><li>Perform/assist in reconciliations and trend analysis.  Document audit steps, observations and findings and assist in preparing audit reports;</li><li>Attend meetings to discuss audit issues and develop action plans;</li><li>Assist in the drafting of formal reports and presentations of audit results to describe the non-compliance, control weakness, or basis of the questioned cost and related implications and recommendations to resolve the findings;</li><li>Prepare, update and file audit work-paper folders;</li><li>Assist in updating and organizing the internal databases; and</li><li>Special Assignments/Project Participation; Group/Section Staff Meeting Participation – Some of which include guest speakers and training activities; Meet and Greets with other CFPO Student Summer Interns, Academic Part-Time Interns and other Early Career Hires; and job responsibility overviews with key CFPO employees and SACO stakeholders.</li></ul><p></p><p><u><b>Qualifications:</b></u></p><ul><li>Must be currently enrolled at least half-time at an accredited college or university, pursuing a Bachelor’s Degree in Accounting, Economics, Finance, Business Management/Administration, or related disciplines with a graduation date of December 2023 or later</li><li>Minimum of a 3.0/4.0 GPA</li><li>Must be able to work full-time during the summer for an 10-12-week assignment</li><li>Completed coursework with exposure to standard principles, theories, concepts and techniques in Accounting, Auditing, Finance or Mathematics</li><li>Knowledge and experience with MS Office</li><li>Strong written and verbal communication skills and the ability to work in a team environment</li><li>A passion or strong desire to explore the field of accounting, auditing, finance or business operations</li><li>Strong presentation and interpersonal skills</li><li>Aptitude to interact in a collaborative manner with other departments and teams</li><li>Proficient with general purpose computer applications</li><li>Knowledge of data visualization software and presentation</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $16.11 as a freshman, $19 as a sophomore, $22 as a junior, $25 as a senior.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 27 Days Ago",
    "startDate": "2023-02-14",
    "timeType": "Full time",
    "jobReqId": "R3888",
    "jobPostingId": "Audit-Summer-Intern_R3888",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Audit-Summer-Intern_R3888"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Year-Round Business Intern",
      "externalPath": "/job/JPL-Campus/Year-Round-Business-Intern_R3081",
      "timeType": "Part time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 24 Days Ago",
      "startDate": "2023-02-17"
    }
  ],
  "userAuthenticated": false
}
