{
  "jobPostingInfo": {
    "id": "f7fa1a6534e70100df736e2bef570000",
    "title": "Data Scientist II",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Do you excel in an environment that values exploration and discovery? We have a universe of opportunities waiting for you!</p><p></p><p>The Instrument Software and Science Data Systems (Org. 398) Section within JPL consist of multidisciplinary teams of engineers and technologists who provide expertise across the domains of instrument operations and science data systems. We are responsible for:</p><ul><li><p>Safely controlling JPL remote sensing instruments.</p></li><li><p>Transforming data collected by these instruments into scientific measurements and preserving them for future analyses.</p></li><li><p>Providing context and understanding to the measurements.</p></li><li><p>Making the measurements and related information accessible to a broad and global user community: scientists, operations, decision makers and society at large.</p></li></ul><p></p><p>Our engineering teams build and operate high performance data processing, management and analysis systems capable of handling petabyte scale datasets in support of science discovery, research, operations and applications.   They support JPL and NASA missions, as well as other science-based projects.  Our research and technology development teams create new onboard and ground based technologies for data processing, analysis, modeling, reasoning, visualization, management, access and analytics that are infused into our data systems.</p><p></p><p>The Instrument Software and Science Data Systems Section is seeking a <b>senior research data scientist</b> to join the <b>Machine Learning &amp; instrument Autonomy Group (MLIA) </b>to employ rigorous, explainable machine learning  methods to support scientific data investigation on the ground, inform spacecraft operations teams in a time-critical setting, infuse new capabilities into JPL’s space missions, and extend the reach of scientists beyond Earth by creating autonomous “smart” instruments that can recognize and prioritize discoveries. <span>The researcher will also act as ambassador to physical science and engineering areas not yet familiar with novel data-driven approaches by teaching, explaining, and offering assistance on request.</span></p><p></p><p><b><u>Job Responsibilities</u>:</b></p><ul><li><p>Conduct independent R&amp;D of ML and related technologies for application to science and engineering challenges</p></li><li><p>Develop innovative ML approaches for remote sensing data with rigorous validation and interpretability</p></li><li><p>Actively pursue competitive grants within JPL R&amp;D and NASA ROSES (ACCESS, MDAP, PDAP, ARROW, etc.)</p></li><li><p>Independently research and develop data analysis algorithms for airborne and satellite remote sensing platforms, planetary surface missions, and novel instrument designs</p></li><li><p>Collaborate with domain experts from a variety of natural science and space-related engineering fields</p></li><li><p>Publicize work through peer-reviewed conference, workshop, and journal papers</p></li><li><p>Facilitate the infusion of high quality, data-driven technologies throughout JPL and NASA</p></li><li><p>Support a collaborative, mentorship-driven, science-enabling community of data scientists</p></li></ul><p></p><p><b><u>Required Skills</u>:</b></p><ul><li><p>Bachelor’s degree in Data Science, Computer Science, Electrical Engineering, Physical Science, or related technical discipline with a minimum of 3 years of related experience, Masters with 1 years of related experience, or PhD with 0 years of related experience in similar disciplines</p></li><li><p>Demonstrated excellence in applying Machine Learning to science data</p></li><li><p>Significant programming experience with Python including NumPy and either scikit-learn or TensorFlow</p></li><li><p>Track record of technical papers in peer reviewed publications / presentations and proposal success</p></li><li><p>Demonstrated independent research capabilities</p></li><li><p>Strong written and oral communication skills including data visualization, presentation, and explanation of results</p></li><li><p>Strong analytical and mathematical skills</p></li><li><p>Team-building mentality, can-do attitude, and commitment to project success</p></li></ul><p></p><p><b><u>Desired Skills</u>:</b></p><ul><li><p>Optimizing and delivering algorithms to onboard, large-scale computing, or real-time critical systems</p></li><li><p>Working knowledge of Earth Science / Atmospheric Science / Planetary Science / Physics / Astronomy / Geology</p></li><li><p>Knowledge of machine vision filters (e.g. Canny, SIFT, HOG, …)</p></li><li><p>Experience implementing maintainable and reusable software for scientific applications</p></li><li><p>Evidence of software engineering best practices including unit and regression testing</p></li><li><p>A love of space, exploration, and science</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$112,070 - $128,544<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-28",
    "timeType": "Full time",
    "jobReqId": "R2209",
    "jobPostingId": "Data-Scientist-II_R2209",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Data-Scientist-II_R2209"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Data Scientist II, TS/SCI clearance",
      "externalPath": "/job/JPL-Campus/Data-Scientist-II--TS-SCI-clearance_R3190",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    },
    {
      "title": "Data Scientist II",
      "externalPath": "/job/JPL-Campus/Data-Scientist-II_R2476",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-28"
    }
  ],
  "userAuthenticated": false
}
