{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Business-Administration-Year-Round-Intern_R4222",
    "id": "590602e9529a1000c84332789c030000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Responsibilities: </u></b></p><p>The <b>Business Administration Group</b> supporting the Instrument Systems Section is seeking a Year-Round Intern who will work together with the Business Administration team to support the administrative functions of <b>the Instrument Systems Section </b>that provides the Laboratory with centers of expertise in the formulation and implementation of scientific instruments, cryogenic systems, and airborne/suborbital scientific investigations.</p><p></p><p>The Intern will be a member of the <b>Business Administration <span>Group</span></b> and will report directly to <b>the Business Administration Group Supervisor</b> and will gain <span>hands-on</span> experience with JPL’s financial reporting tools and related business processes, general and technical training databases, information technology (IT) security plans and compliance requirements, asset management, and the implementation of a new asset tracking system utilizing Radio Frequency Identification (RFID) technology.</p><p></p><p><b>Tasks include but not limited to:</b></p><ul><li>Work collaboratively with the Business Administration <span>Group</span> to support the Instrument Systems Section staff and business administration needs of the Section</li><li>Communicate and interact with all staff members in the Section to track progress of and/or support completion of required action items</li><li>Prepare and analyze monthly reports/metrics as requested</li><li>Create templates, tutorials, and/or desktop reference guides in support of various business functions/processes</li><li>Participate in recommending and implementing business process improvements to streamline and automate tasks</li><li>Support various ad-hoc project related efforts (e.g., RFID asset tagging, digital media updates/maintenance, event planning and execution)</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>Must be able to work onsite at JPL</li><li>Must be available to work part-time in the fall, winter, and spring school sessions and possibly full-time during the summer</li><li>Must be able to work a minimum of 8 hours per week (days/hours are flexible)</li><li>Must be currently enrolled at least half time at an accredited college or university pursuing a Bachelor’s degree in Business Administration, Finance, Management, Computer Information Systems, Information Technology or similar disciplines</li><li>Must have a minimum cumulative GPA 3.0 out of 4.0 or equivalent</li><li>Must be capable of working in a dynamic work environment</li><li>Must be meticulous and possess excellent organizational skills</li><li>Must have strong written and verbal communication skills and ability to work in a team environment.</li><li>Must have well-developed critical thinking skills</li><li>Must be willing to learn and have demonstrated flexibility to receive direction from <span>group</span> members</li><li>Must be proficient with basic computer office software (MS Word, MS Excel)</li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li>Participation in student/volunteer organizations</li><li>Prior internship/volunteer experience in related business disciplines</li><li>Hands-on experience through class projects or work-study programs</li><li>Excellent customer service skills</li><li>Ability to effectively identify, plan, and execute assignments with little guidance</li><li>Advanced MS Office skills and experience with Microsoft 365 and Teams</li><li>Experience with SharePoint, Alfresco, Atlassian Confluence (Wiki)</li></ul><p>The typical hourly rate for this job in Pasadena, California depending on education level is $16.11 as a freshman, $19 as a sophomore, $22 as a junior, $25 as a senior</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Business-Administration-Year-Round-Intern_R4222",
    "jobReqId": "R4222",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 13 Days Ago",
    "startDate": "2023-04-24",
    "timeType": "Part time",
    "title": "Business Administration Year-Round Intern"
  },
  "userAuthenticated": false
}
