{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Postdoc--Remote-Sensing-Data-Analytics-for-Mapping-and-Monitoring-Global-Forest-Carbon_R2896",
    "id": "4a13637d2a3e100172623c1cf2520000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The postdocs at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</p><p></p><p>Researchers at the Carbon Cycle and Ecosystem group at JPL, and international partners have recently designed a global Carbon Monitoring System (CMS) based on the power of big data from space technology and artificial intelligence (AI) for climate smart forest restoration and carbon management.  CMS is focused on providing precise science-based geospatial data products on carbon stocks and annual emissions and removals at the national and jurisdictional levels to empower decision makers for climate mitigation policies. In its initial phase, our team will integrate a series of optical and microwave satellite (including upcoming NISAR and BIOMASS) imagery with airborne and satellite (GEDI, ICESAT-2) lidar measurements of forest structure and conventional ground-based forest inventory data to map and monitor changes of forest structure and biomass globally and attribute the changes to land use activities and environmental effects.</p><p></p><p>The selected candidates will work with a team of scientists to conduct original research by using machine learning algorithms and process-based models to develop regional and global products and improve our understanding of drivers of carbon stock changes across a variety of ecosystems.</p><p>The selected candidates may work on two distinct tasks: 1. to map forest disturbance (land use, logging, and tree mortality), fire fuel loads, and biomass carbon change across temperate forests (e.g. western US), and 2. to quantify biomass loss and gain from land use activities (deforestation, degradation), and forest regeneration (e.g. secondary forests) in humid tropical ecosystems (e.g. Amazon and Congo Basins).   These tasks will help improve the quantification of global carbon cycle as a result of human and climate-induced changes and better understand the short-term and long-term responses of ecosystems to climate change.  The candidates are required to lead one task, perform the analysis, document all algorithms and codes developed for data processing, analysis, science product generation, and lead peer-reviewed publications.</p><p></p><p>The candidates must have a PhD in one of the following areas: remote sensing, computer science, environmental science and engineering, mathematics/statistics with relevant experience in forest ecology and geography.  Required qualifications include experience in quantitative analysis of geospatial data, machine learning algorithms, and time series analysis.  Candidates with relatively advanced knowledge of lidar and radar remote sensing techniques and particularly in forest applications are preferred. Successful candidates must also have strong programming skills in a scientific languages (e.g. python, MATHLAB, R) and experience in statistical analysis.  Applicants should have demonstrated quantitative and computational skills, a successful publication record, and the ability to work in an interdisciplinary research environment.</p><p></p><p>The appointee will carry out research in collaboration with the JPL advisor, resulting in publications in the open literature.</p><p></p><p>Applicants may be subject to <a href=\"https://postdocs.jpl.nasa.gov/prospective-postdocs/eligibility/\" target=\"_blank\">additional program requirements</a> by NASA. Postdoc positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years. Candidates should submit the following to this site: CV, representative publications, contact information for three references, and a cover letter stating their research accomplishments and interests.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$82,180 - $82,180<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Postdoc--Remote-Sensing-Data-Analytics-for-Mapping-and-Monitoring-Global-Forest-Carbon_R2896",
    "jobReqId": "R2896",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-29",
    "timeType": "Full time",
    "title": "Postdoc: Remote Sensing Data Analytics for Mapping and Monitoring Global Forest Carbon"
  },
  "userAuthenticated": false
}
