{
  "jobPostingInfo": {
    "id": "d2416af1eefe1001c52977ee36f40000",
    "title": "Graphics Summer Intern",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><u>Responsibilities</u></b></p><p><b>Job Description: </b></p><p>Will be an academic student-member of the Graphic Design and Production Group (183B), providing design support to the entire group. Will be provided with hands-on work experience in the areas of graphic design, web design, display and exhibit production, and photo editing support, along with other graphics-related activities as appropriate.</p><p></p><p><b>Duties include but not limited to: </b></p><ul><li>Perform routine job functions in graphic design and production.</li><li>Work on day-to-day assignments under direct supervision; receive detailed instructions on assignments.</li><li>Interact primarily with Graphic Design and Production lead and other G&amp;P group members.</li><li>Use opportunities to learn and propose new work techniques.</li><li>Work may include projects involving: layout design, illustration, photo-illustration, informational graphics, publications, web graphics, environmental graphics, signage, and graphic identifiers.</li></ul><p><b><u>Qualifications</u></b></p><p><b>Required Qualifications:</b></p><ul><li>Must be currently enrolled at least half-time at an accredited college or university pursuing a Bachelor’s degree in Graphic Design, Web Design, Illustration, Graphic Communication, or similar discipline and have a graduation date of December 2023 or later</li><li>Minimum GPA 3.0 (transcripts required) </li><li>Must be able to work full-time (40hours/week) for 10-12 weeks over the summer.</li><li>Must have a minimum cumulative GPA 3.0 out of 4.0</li><li>Must have at least 1 semester or quarter remaining to complete degree</li></ul><p></p><p><b>Desired Qualifications:</b></p><ul><li>Knowledge and experience with Adobe CC, MS Office/PowerPoint, and Figma</li><li>Strong written and verbal communication skills and ability to work in a team environment.</li><li>Ability to communicate effectively with all levels of personnel.</li><li>Experience with motion graphics and/or 3D modeling a plus.</li></ul><p>Design Skills:</p><ul><li>General understanding of graphic design techniques and production tasks.</li><li>Basic experience in designing and producing graphic displays.</li><li>Basic understanding of image editing.</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $16.11 as a freshman, $19 as a sophomore, $22 as a junior, $25 as a senior.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 13 Days Ago",
    "startDate": "2023-02-27",
    "timeType": "Full time",
    "jobReqId": "R3857",
    "jobPostingId": "Graphics-Summer-Intern_R3857",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Graphics-Summer-Intern_R3857"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
