{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Senior-Technical-Group-Supervisor_R4130",
    "id": "5ad2bec1760410013bd68ea3c5560000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>The <b>Enterprise and Information Systems Engineering Section</b> provides safe and effective cross-cutting information management and engineering processes, tools, and services specially designed to serve the needs of the Laboratory’s scientists, engineers, and technicians. In addition, the Section provides information management, software and hardware configuration management, cyber defense mission engineering and research, human system integration, toolchain development and management, and library, records, and archival services. The Section also provides leadership in Enterprise Systems Engineering, encompassing the collection of systems, processes, data, and information that enable JPL to serve the nation by exploring space to pursue discoveries that benefit humanity.</p><p></p><p>We are looking for a strategic and innovative leader as a <b>Technical Group Supervisor</b> to join our team as the Supervisor of the Information and Configuration Management group <b> </b>in the Enterprise and Information Systems Engineering Section and work with the Section Management team.</p><p></p><p>The <b>Technical Group Supervisor</b> will provide team leadership, mentor ship, and direction for information and configuration management processes and implementation on JPL ﬂight projects and information management support for line organizations. The role includes the following responsibilities:</p><ul><li><p>Manage a team of 10 to 20 that includes Information Management Engineers supporting line organizations and Information and Configuration Management Engineers supporting JPL projects and tasks, including classified programs.</p></li><li><p>Be responsible for continuous process improvement, setting goals, and ensuring they are achieved.</p></li><li><p>Partner with the Supervisor of the Information and Configuration Management (319A) group on discipline policies, process improvement, staffing and workforce planning, personnel training, and more.</p></li><li><p>Ensure employee awareness and compliance with Laboratory policies, procedures, and regulatory requirements.</p></li><li><p>Know and apply appropriate tools, processes, and procedures affecting areas of responsibility.</p></li><li><p>Have regular access to and management of ITAR/EAR-controlled technical data.</p></li><li><p>Evaluate work opportunities and assign team members, balancing customer needs with employee experience while promoting the career growth of team members.</p></li><li><p>Interact regularly with customers to establish staffing needs and review and consult on Information and Configuration Management plans and processes.</p></li><li><p>Be responsible for hiring and retaining a diverse, highly qualified staff and for providing career coaching, growth, and professional development for direct report JPL employees.</p></li><li><p>Be accountable for the performance of employees and the work output of managed subcontractors.</p></li><li><p>Ensure the quality of the team’s products and overall performance.</p></li><li><p>Apply JPL and industry best practices to ensure success in areas of responsibility.</p></li><li><p>Maintain a safe working environment and a strong customer focus.</p></li><li><p>Represent the group charter, interests, and personnel in Section, Division, and Directorate meetings or discussions, and collaborate with the management teams at all levels to advance the interests of the Group and Section.</p></li></ul><p></p><p> <b>Qualifications:</b></p><ul><li><p>Bachelor’s degree or higher in Configuration Management, Information Management, Engineering, Information Systems, Records Management, or a related discipline. Minimum degree and typical years of relevant experience include a Bachelor’s with 9 years of related experience; Master’s degree with 7 years of related experience; or Ph.D. with 5 years of related experience.</p></li></ul><p></p><p>A successful candidate will also have the following required skills:</p><ul><li><p>A minimum of 2 years of lead experience, with a demonstrated ability to lead individuals with diverse backgrounds working in various Project-support roles.</p></li><li><p>Wide-ranging experience and advanced knowledge in one or more related fields, including Configuration Management, Information Management, and Records Management.</p></li><li><p>Ability to work effectively in highly dynamic environments.</p></li><li><p>Ability to solve problems that are multidimensional and cross-disciplinary.</p></li><li><p>Ability to coordinate and collaborate efficiently in a diverse team environment.</p></li><li><p>Ability to work across multiple diverse technical organizations, including industry, academia, foreign partners, etc., understanding and capturing unique requirements and challenges.</p></li><li><p>Proficiency in decision-making, delegation, and managing change.</p></li><li><p>Demonstrated ability to collaborate with ESD line organizations for promulgating the institutional and discipline best practices.</p></li><li><p>Familiarity with JPL line management practices and effective line-project-program interactions.</p></li><li><p>Team building skills, excellent verbal and written communication, and effective presentation and negotiation skills</p></li><li><p>Be a forward-thinking leader with a history of success and discipline in planning, execution, and implementation.</p></li><li><p>Experience in planning budgets, workforce, and estimating the cost to accomplish work.</p></li><li><p>Proficiency in decision-making, delegation, and managing change.</p></li><li><p>Demonstrated ability to collaborate with ESD line organizations for promulgating the institutional and discipline best practices.</p></li><li><p>Familiarity with JPL line management practices and effective line-project-program interactions.</p></li></ul><p></p><p><b>P</b><b>referred Skills:</b></p><ul><li><p>Puts the needs of our employees first and helps people develop and perform as highly as possible.</p></li><li><p>Complete knowledge of Laboratory policies and procedures, NASA policies and procedures, and government regulations across various applications.</p></li><li><p>Experience in managing JPL projects and tasks of a significant magnitude, including a working understanding of JPL planning, monitoring, and project control processes.</p></li><li><p>Experience in an applied research environment.</p></li><li><p>Interest in and experience with organizational change management, process definition, and process improvement.</p></li><li><p>Demonstrated experience with line management in a matrix organization.</p></li><li><p>Considered an expert in Configuration Management, Information Management, or a related discipline.</p></li><li><p><b>Able to obtain a TS/SCI clearance </b></p></li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$140,920 - $178,464<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Senior-Technical-Group-Supervisor_R4130",
    "jobReqId": "R4130",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 3 Days Ago",
    "startDate": "2023-03-22",
    "timeType": "Full time",
    "title": "Senior Technical Group Supervisor"
  },
  "userAuthenticated": false
}
