{
  "jobPostingInfo": {
    "id": "62d9b8135fde1000c5991dd2e02f0000",
    "title": "Cable Harness Engineer III",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the <b><span>Mechanical Systems Engineering, Fabrication and Test Division </span></b>which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breath of mechanical disciplines and is applied from architectural concept development through operations.</p><p></p><p><b>The Spacecraft Mechanical Engineering Section </b>creates innovative, technically excellent products in an inclusive team environment that offer creative and novel solutions for JPL’s boldest missions. They are responsible for the architecture of mechanical engineering designs and solutions that enable unprecedented missions and science acquisition.  As a <b>Cable Harness Engineer</b>, you will work with a team that leads the development of mission enabling technology and end-to-end mechanical systems for all JPL projects and missions. This job provides an opportunity to be a technical expert, take ownership of a task from detailed design to product delivery and be a representative for the harness discipline on a project. This is a unique job that involves both technical and programmatic opportunities. It offers an opportunity to showcase expertise in breadth and depth of technical knowledge as well as leadership and mentoring skills. The project is a rare and exciting opportunity to be at the leading forefront of new technology.</p><p>We value diverse skills, perspectives, and experiences. Your qualification could add tremendous value to our team. We also provide industry-leading flexibility for partial telework accommodations contingent on project requirements.</p><p></p><p><b><u><span>Responsibilities:</span></u></b></p><ul><li><p>Provide engineering expertise to the design, fabrication and integration of harnesses and represent the harness discipline on a project.</p></li><li><p>Assure the integrity of the harness from inception through delivery.</p></li><li><p>Investigate, plan, design and develop harness to meet technical requirements in compliance with programmatic constraints including cost and schedule.</p></li><li><p>Interact with others to perform cross-disciplines trade studies and analysis of alternatives through application of discipline-specific expertise.</p></li><li><p>Prepare and present harness subsystem design, architecture and implementation plans at various design team meetings and reviews. </p></li><li><p>Prepare and release cable harness assembly drawings. </p></li><li><p>Oversee harness fabrication as well as support Integration and Testing activities for various JPL flight projects. </p></li></ul><p></p><p><b><u><span>Qualifications</span></u></b></p><ul><li><p>Bachelor’s degree in Mechanical, Electrical, Systems, Material Science, Aerospace Engineering or related technical discipline with typically a minimum of 6 years of related experience; or a Master’s degree in similar disciplines with a minimum of 4 years of related experience; or Ph.D. in similar disciplines with a minimum of 2 years related experience.</p></li><li><p>Wide-ranging experience and advanced knowledge in two or more of the following areas:</p><ul><li><p>Architect harness designs to meet project and technical requirements.</p></li><li><p>Detailed design of flight and ground support cable harness assemblies.</p></li><li><p>Developing harness requirements including verification &amp; validation methods at the subsystem level.</p></li><li><p>Developing harness implementation plans and manage cost and schedule for task.</p></li></ul></li></ul><ul><li><p>Extensive understanding and wide application of the development of wire harness designs including: ability to interpret pertinent harness requirements from electrical wiring schematics to create wire lists, designing Faraday enclosures, creating harness assembly drawings, selecting parts and materials for flight harness assemblies, performing trade studies, preparing mass estimates, coordinating fabrication, assembly, testing and qualification of hardware.</p></li><li><p>Extensive knowledge of industry and/or academic practices and standards across a range of applications related to electrical connectors and wire for spaceflight applications, including Mil-Aerospace standards such as MIL-C-38999, MIL-C-24308, Mil-83513, and MIL-STD-1553. Pertinent practices include selection of wiring based on current de-rating, voltage drop analysis, shielding effectiveness, temperature environment, outgassing and mechanical strength.</p></li><li><p>Demonstrated ability to lead a team, provide direction and mentoring to others.</p></li><li><p>Excellent verbal and written communication skills.</p></li><li><p>Excellent organizational skills, ability to meet deadlines and manage multiple priorities.</p></li></ul><p></p><p></p><p><b><u><span>Desired Skills: </span></u></b></p><ul><li><p>Detailed and hands‐on based knowledge of fabrication processes and workmanship criteria for flight and ground support harness in accordance with NASA 8739.4, SAE AS50881 and IPC/WHMA-A-620A.</p></li><li><p>Working knowledge of Electrical CAD SIEMENS CAPITAL software suite and associated modules such as Logic, Integrator, and Harness XC</p></li><li><p>Familiarity with mechanical CAD software tools such as NX.</p></li><li><p>Experience with engineering oversight of integration of harnesses on flight hardware.</p></li><li><p>Experience leading teams of engineers in harness design and development from project inception to hardware delivery.</p></li><li><p>Technical expertise in capabilities, selection and qualification of components used in flight spacecraft cable harness designs.  Components include connectors, backshells, wire, contacts, splices, solder, overshields.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$122,096 - $154,336<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-22",
    "timeType": "Full time",
    "jobReqId": "R3514",
    "jobPostingId": "Cable-Harness-Engineer-III_R3514",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Cable-Harness-Engineer-III_R3514"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Systems Engineer III (TS/SCI)",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III--TS-SCI-_R4066",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 3 Days Ago",
      "startDate": "2023-03-09"
    },
    {
      "title": "Systems Engineer III TS/SCI – National Security Programs Support",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III-TS-SCI---National-Security-Programs-Support_R3882",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-06"
    },
    {
      "title": "Flight Systems Engineer III (Sample Retrieval Lander)",
      "externalPath": "/job/JPL-Campus/Flight-Systems-Engineer-III--Sample-Retrieval-Lander-_R3268",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Aerospace Nuclear Safety Engineer III",
      "externalPath": "/job/JPL-Campus/Aerospace-Nuclear-Safety-Engineer-III_R3142",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer III(Sample Retrieval Lander Payload Avionics Engineer)",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III-Sample-Retrieval-Lander-Payload-Avionics-Engineer-_R3368",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer III (Sample Retrieval Lander Payload Avionics Engineer)- Project Discovery",
      "externalPath": "/job/JPL-Campus/Microdevices-Engineer-II---Project-Discovery_R3655",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "System Engineer III- (Fault Protection) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Flight-System-Engineer-III---Project-Discovery_R3653",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Flight Systems Engineer III, Verification and Validation",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III_R3753",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 27 Days Ago",
      "startDate": "2023-02-13"
    },
    {
      "title": "Science Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Science-Systems-Engineer-III_R1748",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Technical Program Manager of Mechanical Systems",
      "externalPath": "/job/JPL-Campus/Technical-Program-Manager-of-Mechanical-Systems_R3768-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-11"
    },
    {
      "title": "Thermal Engineer III",
      "externalPath": "/job/JPL-Campus/Thermal-Engineer-III_R2987",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2022-12-22"
    },
    {
      "title": "Systems Engineer III - Fault Protection",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III---Fault-Protection_R3754",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-11"
    },
    {
      "title": "Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III_R3881",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-03"
    },
    {
      "title": "Embedded Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Embedded-Systems-Engineer-III_R3825",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30 Days Ago",
      "startDate": "2023-02-10"
    },
    {
      "title": "Systems Engineer III (Verification & Validation) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III---Project-Discovery_R3663",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Flight Systems Engineer III (Sample Retrieval Lander) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Flight-Systems-Engineer-III--Sample-Retrieval-Lander----Project-Discovery_R3660",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Systems Engineer III (Clipper Project V&V Engineer)  - Project Discovery",
      "externalPath": "/job/JPL-Campus/Systems-Engineer-III--Clipper-Project-V-V-Engineer-----Project-Discovery_R3658",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    }
  ],
  "userAuthenticated": false
}
