{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Section-Manager---Earth-Science-Section--3290-_R4237",
    "id": "590602e9529a10016739118910760000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Earth Science Section provides scientific leadership in design, planning and implementation of space-borne Earth observing missions, and leveraging their data for scientific understanding and societal benefit. Research activities include space based, suborbital, and ground-based observations, as well as laboratory studies, data analysis and numerical modeling. We are seeking a Section Manager, who will lead the Section Science Management Team, and report to the Science Division Manager. As the Section Manager, you will have the opportunity to interact and partner with NASA and with senior JPL leadership in representing the Section, and be responsible for defining and implementing the vision for the Section as an organization and as an Earth science research institution. In this role, you will develop deep knowledge on the multi-disciplinary work being done related to Earth science across the Lab and NASA, and forge new connections that will benefit both you, and the Section.</p><p></p><p>This is a full-time position that requires .70FTE commitment for Section Management responsibilities and you will be expected to also maintain your active scientific work.</p><p></p><p>In this role, your responsibilities will include: </p><ul><li><p>Developing, aligning, and interfacing the needs of various research groups within the Laboratory’s overall mission and the Science Division&#39;s Charter.</p></li><li><p>Representing the Section on scientific and technical committees and advisory boards, and Interfacing with the Laboratory’s management and NASA Program Offices.</p></li><li><p>Developing comprehensive research and strategic plans that meet requirements and expectations of the Science Division, Earth Science and Technology Program Directorate (ESTD), and the NASA Earth Science Division, to provide new and innovative opportunities for the research staff.</p></li><li><p>Actively working with ESTD in both formulating opportunities for research and in developing and implementing strategic initiatives in Earth science..</p></li><li><p>Recruiting and developing an outstanding and diverse staff, in response to joint goals of the Earth Science Section and ESTD, and consistent with the Lab’s programmatic and administrative goals.</p></li><li><p>Creating and maintaining an inclusive environment in which members of the Section can thrive.</p></li><li><p>Working with Science and Business Management to facilitate all aspects of Section operations.</p></li><li><p>Executing other ad-hoc assignments as assigned by Division Management.</p></li></ul><p></p><p>Regular duties of the Science Management Team, as led by the Section Manager, include:</p><ul><li><p>Fostering a favorable and inclusive work and research environment with a focus on mentoring, coaching, and professional development opportunities.</p></li><li><p>Partnering with the Science Division Assistant Division Manager for Formulation on developing innovative, high quality proposals.</p></li><li><p>Reviewing and tracking proposals for internal and external research programs, as well as for competed instruments and missions.</p></li><li><p>Reviewing and tracking professional products from the Section, including publications, presentations, and reports.</p></li><li><p>Selecting and preparing research highlights representing science activities in the Section.</p></li><li><p>Improving and implementing recruitment and hiring best practices for Affiliates, Postdocs, and Employees.</p></li><li><p>Maintaining extensive familiarity with the professional work and expertise of Section members as well as upholding the Section’s scientific bar of excellence.</p></li><li><p>Reviewing and acting on Ethics-related issues such as Outside Activity Requests and mitigation of conflicts of interest.</p></li><li><p>Reviewing and overseeing Safety and Travel requests at the Section level.</p></li><li><p>Representing the Section in Science Division, Earth Science and Technology Program Directorate, and other programmatic, strategic, and hiring meetings.</p></li><li><p>Representing the Section in professional training development activities and events.</p></li><li><p>Preparing first drafts of agendas, reports, and nominations for awards and promotions.</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Typically requires a PhD in Physical Science, Biological Science, Engineering or Mathematics or similar disciplines, with a minimum of 8 years related experience.</p></li><li><p>Minimum of 4 years of demonstrated supervisory or management experience with Line, Program, or Project organizations.</p></li><li><p>Multidisciplinary knowledge in Earth Science, with a proven track record in developing, defining, and implementing an independent scientific research program.</p></li><li><p>Demonstrated scientific bona fides through an extensive publication record.</p></li><li><p>Demonstrated ability to secure competed external funding.</p></li><li><p>Demonstrated commitment to mentorship.</p></li><li><p>Highly developed leadership ability and teamwork skills, with proficiency in one or more of decision-making and delegation, change management, strategy development, and financial/cost management.</p></li><li><p>Has knowledge of industry and/or academic practices in support of diversity, equity and inclusion related to Earth Science, and a demonstrated commitment to advancing improvements in this area.</p></li></ul><p></p><p><b>Preferred Qualifications:</b></p><ul><li><p>Established experience and commitment to developing or supporting diversity, equity, and inclusion in the workplace.</p></li><li><p>Experience working with JPL Program Directorates.</p></li><li><p>Expert knowledge of Laboratory and NASA policies and procedures, and government regulations across a range of applications.</p></li><li><p>Knowledge of NASA HQ and Center science Programs/Projects and management practices and procedures.</p></li></ul><p></p><p><b><span>NOTE: This position may be classified at a level higher than the posted level.  A determination will be made once the final candidate has been identified</span></b><span>.</span></p><p><span>The typical full time equivalent annual hiring range for this job at a level higher in Pasadena, California is $207,584 - $276,432.</span></p><p></p><p><b>Applications received by May 22, 2023, will receive full consideration.</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$177,632 - $233,376<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Section-Manager---Earth-Science-Section--3290-_R4237",
    "jobReqId": "R4237",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 22 Days Ago",
    "startDate": "2023-04-26",
    "timeType": "Full time",
    "title": "Section Manager - Earth Science Section (3290)"
  },
  "userAuthenticated": false
}
