{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Employee-Relations-Partner--Temporary-_R4313",
    "id": "91531aa0918f10016ee68e7873f50000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>Exciting opportunity to join our Human Resources team at the Jet Propulsion Laboratory as a trusted <b>Employee Relations Partner</b>. The role is a key team member and subject matter expert, providing consult on best practice approaches to employee relations. The ER Partner will be responsible for leading effective workplace investigations with expertise and compassion, contributing to a positive work environment that balances employee rights and responsibilities. In addition, the role will participate in the development and implementation of processes, documents and trainings that help mitigate business risk and proactively support and maintain a positive employment climate.   </p><p></p><p>Reporting to the <b>Manager of Employee Relations</b>, this position will have specific responsibilities including (but not limited to):</p><ul><li><p>Effectively and efficiently conducts workplace investigations with minimal oversight</p></li><li><p>Develops and maintains thorough and high-quality case documents for investigations and employee relations work, including, but not limited to: investigation notes, summaries, timelines, reports, letters, corrective action documents and warnings</p></li><li><p>Effectively prepares and presents investigation findings resolution options to all levels of management and counsel</p></li><li><p>Partners with and provides guidance to other HR professionals, employees and managers in the areas of employment law and organizational policy</p></li><li><p>Supports and manages Employee Relations cases in partnership with other areas of the business (HRBP, Ethics, Security)</p></li><li><p>Maintains relevant case information and provides database reports and analyses to HR Business Partners and other members of management</p></li><li><p>Participates in the development, planning and implementation of company-wide and role-specific training in the areas of Preventing Harassment, Employment Law and Policy updates, etc.</p></li><li><p>Participates in the development and implementation of new and effective Employee Relations strategies, and procedures</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in Human Resources, Communications, Business or related field with 3 years of minimum related work experience; Masters degree in a similar discipline with 1 years of minimum related work experience</p></li><li><p>In addition, 2(&#43;) years of experience in an Employee Relations-focused role, including experience independently leading employee relations workplace investigations</p></li><li><p>In-depth knowledge and application of Federal and California Labor Laws applicable to all areas of Human Resources</p></li><li><p>Highly organized with strong self and project management skills (time, priorities, resources)</p></li><li><p>Excellent problem-solving, critical thinking, reasoning and analytical skills</p></li><li><p>Agile learning skills</p></li><li><p>Ability to influence and adapt style to consult with all levels of employee and management</p></li><li><p>Ability to work effectively and well within the JPL culture (effectively gather and analyze facts, weigh risks and make that are right for the business, the people and our culture)</p></li><li><p>Excellent writing and editing skills</p></li><li><p>Effective team player</p></li><li><p>Strong interpersonal and communication skills</p></li><li><p>Ability to work effectively in situations that require sound decision-making</p></li><li><p>Establishes trust and maintains confidentiality</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Experience with predominantly exempt client groups</p></li><li><p>Experience working with clients in a technology field (engineers, researchers, etc.)</p></li><li><p>Familiarity of OFCCP and/or DCAA requirements a plus</p></li></ul><p></p><p><b><span>As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</span> </b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$78,208 - $97,552<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Employee-Relations-Partner--Temporary-_R4313",
    "jobReqId": "R4313",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-05-10",
    "timeType": "Full time",
    "title": "Employee Relations Partner (Temporary)"
  },
  "userAuthenticated": false
}
