{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Chief-Cybersecurity-Officer_R4160",
    "id": "e69c71fb5b7e10017dee3115f0250000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Why Join JPL?</b></p><ul><li><p>You’re a cybersecurity leader with a sound knowledge of business management and a working knowledge of cybersecurity technologies covering the corporate network and advanced technology products in the broader digital ecosystem.</p></li><li><p>You’re a strategic cybersecurity leader and enjoy the challenge of ensuring secure enterprise system development from formulation to implementation.</p></li><li><p>You like to scrutinize the status quo, analyze data, and collaborate with a dynamic team to achieve ideal state systems and solutions.</p></li><li><p>You have a passion for space exploration, digital transformation, and enterprise operations.</p></li><li><p>You’re passionately curious, always learning, and eager to work with some of the greatest minds in the world to pursue new ideas, create the impossible, and build the future.</p></li></ul><p></p><p><b>Key Elements of Position</b></p><p>As a key leader in JPL’s Cyber Security &amp; Protection Office, the<b> Chief Cybersecurity Officer</b> partners with cybersecurity domain authorities across JPL to execute the cybersecurity strategy and vision and ensure operational plans are in place. We are on a journey at JPL to innovate, modernize, and continue to discover new ways to grow our capability and support the Lab’s scientific, research, and space exploration missions.  The Chief Cybersecurity Officer is a critical leader to ensure our success. </p><p></p><p>As a newly defined role at the Lab, the Chief Cybersecurity Officer will act as the primary point of contact for lab wide cybersecurity and will provide leadership to a matrixed team of domain Cybersecurity Officers across JPL, ensuring a coordinated institutional response to cyberthreats and attacks as well as an integrated approach to rolling out cybersecurity policies and standards.  The Laboratory follows a federated model for IT, software, data, and advanced computing, with both centralized and specialized capabilities that support the diverse needs of the Lab.  Under the guidance of the Chief Cyber Protection and Security Officer (CPSO), you will partner with the Cybersecurity Engineer and Cybersecurity Risk Manager to quickly establish and build the critical relationships and partnerships with Lab Directorate leaders, team members, and partners to ensure the security of a wide-array of IT solutions.</p><p></p><p>If you’re focused on collaborative cybersecurity solutions, leadership, engagement, you are analytical and persuasive, with the ability to translate strategy to operational requirements, and have a passion for creating positive change, JPL may be the perfect place to grow your career.</p><p></p><p><b>Your Responsibilities</b></p><ul><li><p>Lead and coach a matrixed team of domain specific Cybersecurity Officers (CSOs) across JPL focused on reducing institutional cybersecurity risk across JPL’s federated business domains.</p></li><li><p>Work closely with the JPL Laboratory Risk Management Board (LRMB), the Cybersecurity Risk Manager, and cybersecurity experts across the lab to define and deploy a broad range of measures to monitor, analyze, and inform cybersecurity risks including establishing metrics, tracking trends, and assessing areas of concentration</p></li><li><p>Lead and coordinate institutional response to cyberthreats and attacks, acting as single point of contact for internal and external stakeholders through remediation.</p></li><li><p>Use data insights and recommendations to develop long term strategy on operational tools, processes, and structures as well as organizational requirements to support a coordinate institutional response to cyberthreats and attacks.</p></li><li><p>Communicate design standards and requirements (technical, process, review, and approval) for all stages of the software lifecycle (acquisition, development, operation, architecture, assurance, deployment, decommissioning, and processes) developed by the Cyber Protection &amp; Security Office to domain CSOs.</p></li><li><p>Advise in allocation and management of the institution’s cybersecurity investment and operational portfolios, including investments across all management councils and direct project charges. Provide a programmatic-based perspective into decision making.</p></li><li><p>Work with stakeholders to continually optimize cybersecurity governance and decision-making processes as the business context and technology landscape changes</p></li><li><p>Partner with IT leadership to coordinate policies, requirements and their implementation.</p></li><li><p>Act as a liaison with Caltech and NASA for strategic thinking and risk-based assessments of JPL assets, partner with the DOD, OMB, DHS and other federal agencies to ensure compliance to relevant federal laws</p></li><li><p>Understand the policies and requirements of the Laboratory’s unique role as NASA’s FFRDC, and how you support our agile and innovative culture.</p></li><li><p>Work with accountable organizations to ensure the Laboratory’s cybersecurity policies are compliant with all standards and requirements set forth in the Prime Contract with NASA and other applicable regulatory agencies.</p></li><li><p>Establish partnerships with organizations across JPL and outside JPL to create, adopt, adapt and infuse cybersecurity best practices. </p></li><li><p>Create and implement a Lab wide approach to cybersecurity training.</p></li><li><p>Drive culture change - embracing collaboration, awareness of JPL’s culture, and innovation in applying and using cybersecurity protocols across JPL.</p></li><li><p>Develop strategy in partnership with HR on JPL’s approach to recruit, develop and retain a robust pipeline cybersecurity capability and talent.</p></li></ul><p></p><p><b>Qualifications &#43; Success Factors</b></p><ul><li><p>Typically Bachelors’ degree with 12 years of related experience in a combination of risk management, cybersecurity, or IT (at least 8 years must be in a senior leadership role)</p></li><li><p>The selected candidate must be willing and able to obtain a top-secret security clearance and for Sensitive Compartmented Information (SCI) access</p></li><li><p> Extensive knowledge and experience with the federal government (military or civilian) in a senior leadership cybersecurity capacity including familiarity with FAR, FISMA, and classified cybersecurity issues. </p></li><li><p>Demonstrated understanding of relevant legal and regulatory requirements, such as: FISMA and FAR</p></li><li><p>Knowledge of common information security management frameworks, such as ISO/IEC 27001, ITIL, COBIT as well as those from NIST, including 800-53 and Cybersecurity Framework</p></li><li><p>Certified Information Systems Security Professional (CISSP) - Must have five years cumulative paid work experience in two or more of the following domains: (1) Security and risk management, (2) Asset Security, (3) Security Architecture, (4) Communications and Network Security, (5) Identity and Access Management, (6) Security Assessment and Testing, (7) Security Operations, and (8) Software Development Security</p></li><li><p>Operational expertise – ability to translate a vision and strategy into an effective operating model.</p></li><li><p>Demonstrated ability to lead and mentor staff in a team environment where collaboration, engagement, and knowledge transfer are critical</p></li><li><p>Project execution – leading complex projects with multiple stakeholders and cross-domain team members.</p></li><li><p>Inclusive management with influencing skills and experience that demonstrates an ability to effect change</p></li><li><p>Experience building strong partnerships, both inside and outside the organization</p></li><li><p>Demonstrated ability to interact with senior executives and to influence decisions</p></li><li><p>Flexibility, adaptability, and tenacity with the ability to meet deadlines, prioritize demands, and effect creative problem solving</p></li><li><p>Robust analytical capabilities with the ability to support decisions and strategy with facts and data</p></li><li><p>Proven experience with leading cross-organizational bodies, teams, and partnerships</p></li><li><p>Excellent communication skills - written, verbal, and presentation</p></li><li><p>Proof of vaccine status or JPL exemption application required</p></li></ul><p></p><p><b>Preferred Qualifications</b></p><ul><li><p><b>Masters’ degree with 10 years of related experience in a combination of risk management, cybersecurity, or IT (at least five must be in a senior leadership role)</b></p></li><li><p>3-5 years of experience working on or with space mission partners</p></li><li><p>Experience with space mission concepts, ground data system designs, and mission operations systems</p></li><li><p>Familiarity with JPL/NASA/aerospace system engineering standards as well as risk identification, mitigation, and reporting systems and standards. </p></li><li><p>Experience working within an engineering and/or science community and culture</p></li><li><p>Background working with the federal government in a research environment</p></li><li><p>Demonstrated ability to create a culture of innovation across an organization</p></li><li><p>Proven experience driving new ideas, technologies and capabilities</p></li><li><p>Demonstrated collaborations with different external organizations – industry, academia, government, international</p></li><li><p>Certified Information Security Manager (CISM) and/or Certified in Risk and Information Systems Control (CRISC)</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$182,000 - $224,328<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Chief-Cybersecurity-Officer_R4160",
    "jobReqId": "R4160",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 15 Days Ago",
    "startDate": "2023-04-03",
    "timeType": "Full time",
    "title": "Chief Cybersecurity Officer"
  },
  "userAuthenticated": false
}
