{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-III-TS-SCI--National-Partnerships-Office-End-to-End-Information-Systems-Engineer-_R4482",
    "id": "731ce68d6c0b10011fbcb14271510000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>The <b>Project Systems Engineering &amp; Formulation Section </b>provides lifecycle leadership in the formulation, planning and execution of the project systems engineering function for JPL space flight missions from concept development through completion of post-Launch checkout and commissioning. Providing formulation services from concept ideation, to the full expression of that concept in formulation phase products, the creative and innovative personnel within this section are responsible for the leadership for project-wide systems engineering efforts, and the delivery of project-level systems engineering products. The section’s expertise spans a wide array of project products and disciplines, including: Project system and mission architectures, Risk Management, Project Software Systems Engineering, End-to-End Information Systems Engineering, Flight Project Cybersecurity, Project Protection Systems Engineering, among others.</p><p></p><p><b>Innovation drives so much of what we do at JPL, and our inclusiveness helps drive that innovation.</b></p><p></p><p><u>EEIS Engineering Tasks include the development of:</u></p><ul><li><p>An EEIS layered <b><i>architecture</i></b> which lays out hardware assets, command and control teams, command and control processes, project data system(s) (flight and ground), and multi-mission services the project will use.</p></li><li><p>A set of <b><i>EEIS requirements</i></b> (usually in Level 2 or 2.5 of the project’s requirements hierarchy) on the EEIS design, that is consistent with and responsive to program, project and science requirements and constraints, and consistent with requirements on the mission design.</p></li><li><p>An <b><i>EEIS design</i></b> that is responsive to the EEIS requirements, allocates EEIS functions to project systems, and identifies EEIS interfaces between project systems. This design includes which data system standards are selected, and how and where they are implemented in the EEIS. The design is described in such a way that it provides a common understanding of the EEIS to the various implementation system managers and engineers.</p></li><li><p>A <b><i>Technology to Command &amp; Control Interface Control Document </i></b>that specifies the interface between the developed system and the project&#39;s command and control software (“Ground”) and how they will interact. The ICD is supplemented by detailed interface descriptions in the Command and Telemetry Dictionaries.  The ICD includes:</p></li></ul><p><span><span>o<span>   </span></span></span>Specification of the formats and protocols that technology and Ground will use to communicate with each other</p><p><span><span>o<span>   </span></span></span>Sub-allocations of functionality, performance, and operability between technology and Ground (When not specified in Project System (L2) requirements)</p><p><span><span>o<span>   </span></span></span>Requirements on one system that enable the other to perform its functions in accordance with the EEIS Concept or another Project-level design document.</p><ul><li><p>A <b><i>set of end-to-end information views</i></b> including organizational (objectives, roles, policies, activities, lifecycle, contracts), connectivity (physical, configuration, constraints, behaviors), communicational (protocol), functional (interactions, interfaces), and informational (structure, semantics, relationships, permanence, rules). These views describe the flow of data and control, across the end-to-end information system.</p></li><li><p>A plan for phased delivery and integration of ground and technology portions of the project EEIS is called the <b><i>EEIS Phased Development and Test Plan. </i></b> In the Project definition phase, the EEIS engineer defines the EEIS project phases and identifies the tests associated with the successful completion of each phase. These tests occur before, during, and after Integration &amp; Test.  It is the key to injecting operability features into the flight and ground design and testing them as they are developed and integrated into the Ground. A regression test is conducted at the start of each new EEIS phase to ensure that previous tested capabilities can be revalidated.</p></li><li><p>The <i>EEIS component of the Project V&amp;V plan</i> that describes demonstration, test, or analysis activities to be conducted by the project during I&amp;T to convince themselves that the project systems work together to meet the requirements on the EEIS.</p></li></ul><p><u>EIS Engineering is, to a large extent, Operability Engineering:</u></p><ul><li><p>Reduce life cycle costs and mission risk by influencing the instrument, spacecraft, and ground designs to make it easier to demonstrate the utility of the developed technology</p></li><li><p>Focus on enhancing the visibility and controllability of the flight/ground system</p></li><li><p>Provide improved EEIS performance and accountability by integrating leading CCSDS information system recommendations into the ground infrastructure services and program/project spacecraft capabilities</p></li><li><p>Provide the means to account for the production and delivery of observational products.</p></li></ul><p></p><p><b><span>Key Tasks:</span></b></p><ul><li><p>Be the EEIS engineer for formulation, and eventual captured work, for a technology demonstration Program Office and its associated task portfolio.</p></li><li><p><b>Partner with other EEIS engineers to develop the End-to-End Information System requirements, develop the End-to-End system architecture, including any interface documentation, and identify areas of technical or programmatic risk.</b></p></li><li><p>Develop test programs and other mitigations to address any EEIS risk and develop critical EEIS verification &amp; validation plans.</p></li><li><p>For these types of tasks, this Systems Engineer III position reports programmatically to the <b>NPO formulation Lead Systems Engineer and administratively to the Defense and Commercial Programs Systems Engineering Group Supervisor in Section. </b></p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Bachelor’s degree in Aerospace Engineering, Electrical Engineering, Computer Science, or related technical discipline with 6 years of related work experience; or Master’s degree in a similar discipline with 4 years of related work experience, or PhD. in a related technical discipline with 2 years of related work experience.</p></li><li><p>Prior experience with Testbed and/or ATLO test venues doing requirement verification/closure of Level 3 (Spacecraft or Payload).</p></li><li><p><b>Strong practical background in either flight or ground system engineering (preferably at levels 2, 3, or 4) or software system engineering, or system and software verification and validation, or data modeling techniques and software testing tools.</b></p></li><li><p>Successful track record of creative problem solving and innovation.</p></li><li><p><b>Ability to work independently but with direction from both the line and project organization.</b></p></li><li><p><b>Must be a go-getter and self-starter with ability to work across multiple cross-discipline teams with typically limited direction.</b></p></li><li><p>Frequently capable of working outside of one’s organization with external partners on technical issues.</p></li><li><p>Must have excellent verbal, written, and presentation skills; will present work during management (e.g., PMRs) and project reviews (or provide technical materials for such reviews)</p></li></ul><p></p><p><b>Preferred Skills</b>:</p><ul><li><p><b>Experience in the design, development, and operations of flight or ground systems</b></p></li><li><p><b>Knowledgeable of on-board and ground information and software systems and their interfaces.</b></p></li><li><p><b>Knowledgeable of JPL multi-mission systems, services and CCSDS Information System Standards.</b></p></li></ul><p></p><p><b>Note: Must have an active Top Secret (TS) clearance based upon Single Scope Background Investigation (SSBI) within a 5-year scope and must be approved for Sensitive Compartmented Information (SCI) accesses</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$122,096 - $154,336<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Systems-Engineer-III-TS-SCI--National-Partnerships-Office-End-to-End-Information-Systems-Engineer-_R4482",
    "jobReqId": "R4482",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-06-27",
    "timeType": "Full time",
    "title": "Systems Engineer III TS/SCI (National Partnerships Office End-to-End Information Systems Engineer)"
  },
  "userAuthenticated": false
}
