{
  "jobPostingInfo": {
    "id": "d2416af1eefe10010b63e9a6fa380000",
    "title": "Applications Software Developer",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Do you enjoy problem solving and developing software solutions? We are seeking a business applications software developer to join our dedicated team of IT professionals in EBIS&#39;s Supply Chain Management Information Services Section! This new team member will have opportunities to innovate and apply technologies across a spectrum of industry standard methodologies in procure-to pay, manufacturing, facilities and logistics business domains. We value a candidate who works independently, in collaboration with other team members and is results-oriented! We are looking for an individual who is analytical, applies excellent judgment, and has the ability to multi-task in order to optimally support the business systems needs in a timely fashion.</p><h2>Job Description:</h2><ul><li>Work with multi-functional teams and business community to gain understanding of JPL’s business processes and how they are configured in Oracle eBusiness Suites (on premise).</li><li>Elicit and capture relevant requirements and help users discover their real business needs.</li><li>Will join a technical team and contribute to the design, setup, development and testing of business software applications.</li><li>Coordinate and implement system upgrades and new features.</li><li>Keep our products up-to-date and relevant by proposing improvements as business needs evolve, or as new features become available.</li><li>Remain in regular contact with user community throughout the project; lead problem solving workshops, suggest prototypes, conduct product demos, alleviate concerns, validate requirements.</li><li>Analyze and resolve technical/functional production issues.</li></ul><h2>Qualifications:</h2><ul><li>Typically requires a Bachelor degree in Computer Information systems, Computer Science, Business Information Systems or related field with a minimum of 3 years of related experience; or a Master degree in similar disciplines with a minimum of 1 year of related experience.</li><li>Knowledge of system design and/or configuration/module setup.</li><li>Experience in one or more of the following: SQL, Oracle PL/SQL, Shell Scripts or XML.</li><li>Experience with building APIs and web services.</li><li>Working knowledge of versioning control systems (e.g. Git/GitHub, CCCHarvest).</li><li>Able to communicate ideas, instructions, and requirements clearly and concisely</li><li>Analytical and problem-solving skills - Ability to translate requirements into system solutions.</li><li>Knowledge of both waterfall and agile/scrum software development methodologies.</li><li>A self-starter who can think creatively and work well both as part of a diverse team and as an individual contributor.</li></ul><h2>Desired Qualifications:</h2><ul><li>Experience with issue-tracking systems (e.g. JIRA).</li><li>Familiarity with data security methods and safe guarding different classification of information, both in place and in transit.</li><li>Knowledge of system design, extension, personalization, configuration/module setup with Oracle eBS R12.2 using various Oracle development toolsets</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$112,070 - $122,096<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 26 Days Ago",
    "startDate": "2023-02-14",
    "timeType": "Full time",
    "jobReqId": "R3942",
    "jobPostingId": "Applications-Software-Developer_R3942",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Applications-Software-Developer_R3942"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Full Stack Application Developer",
      "externalPath": "/job/JPL-Campus/Full-Stack-Application-Developer_R3799",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-09"
    },
    {
      "title": "Full Stack Application Developer",
      "externalPath": "/job/JPL-Campus/Full-Stack-Application-Developer_R3907",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-08"
    },
    {
      "title": "Full Stack Application Developer",
      "externalPath": "/job/JPL-Campus/Full-Stack-Application-Developer_R3908",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-08"
    }
  ],
  "userAuthenticated": true
}
