{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Systems-Engineer-II_R4476",
    "id": "49344aaf214710021382383932150000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p></p><p>If you are passionate about spacecraft design, we invite you to join the <b>Flight Systems Engineering, Integration and Test Section (314)</b>. We provide systems engineering for the design and implementation of spacecraft for the laboratory’s key flight projects. Our work spans spacecraft systems engineering, payload systems integration, electrical systems integration, fault protection and autonomy design, landing systems design, spacecraft assembly and test, systems verification and validation, and systems modeling.</p><p></p><p>We are seeking a highly motivated and experienced <b>Systems Engineer Level 2</b> to join the <b>Systems Integration, Test &amp; Launch Engineering Group (314B),</b> reporting administratively to the Technical Group Supervisor and programmatically to the Lead Systems Engineer. Your initial assignment will be to serve as an ATLO Systems Engineer on the Europa Clipper project. Some of your initial tasks may include the development and execution of functional and behavioral tests at the flight systems level.</p><p></p><p>You will work independently and within a team environment, collaborating on tasks performed across a spectrum of disciplines and have excellent writing and oral presentation skills.</p><p></p><p><b>Tasks may include but not limited to:</b></p><ul><li>Anomaly investigation</li><li>Supporting flight software and hardware reviews</li><li>Supporting Flight Hardware testing</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>Bachelor’s degree in Engineering, Physics, or related technical discipline with a minimum of 3 years of professional experience, or Master’s degree with a minimum of 1 years of experience, or Ph.D.</li><li>Demonstrated skills in test planning, test procedure development, problem reporting/investigation, coordination of test data analysis and test report generation.</li><li>Demonstrated skills in independently leading test activities and coordinating with other team players.</li><li>Ability to negotiate independently with other Europa Clipper team members on the behalf of System Engineering interests. </li><li>Experience within a multidisciplinary system engineering or test team</li><li>Demonstrated knowledge of processes that are used to verify/validate the design requirements of systems.</li><li>Experience in testing of systems, including test planning, test procedure development, and data analysis.</li><li>Exceptional written and oral communication skills.</li><li>Ability to collaborate successfully with other groups, sections, divisions, and organizations, both inside and outside JPL.</li><li>Experience with development of formal procedures and documentation relating to space flight hardware</li><li>Ability to react to frequent changes in plans and excel in a rapid pace concurrent engineering environment.</li><li>Detailed knowledge of Laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications.</li><li>Understanding of the proper application of JPL design principles, flight project practices, hardware-handling constraints, and the JPL risk management practices.</li><li>Availability for occasional domestic travel.</li></ul><p></p><p><b>Preferred Skills:</b> </p><ul><li>Previous JPL experience in Systems Integration and Test</li><li>Previous JPL experience in performing V&amp;V utilizing system level test beds</li><li>Willingness to obtain a security clearance if applying from outside Section 314</li><li>Willingness to obtain a security clearance if asked.</li></ul><p></p><p><b>Note: </b><span><span>As a temporary position, this assignment may last up to 36 months in duration with approvals based on 12-month assignments.  However, please note that you are not under any employment contract and your temporary employment status can be terminated at any time, with or without notice.</span></span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$102,752 - $125,216<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Systems-Engineer-II_R4476",
    "jobReqId": "R4476",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 4 Days Ago",
    "startDate": "2023-06-23",
    "timeType": "Full time",
    "title": "Systems Engineer II"
  },
  "userAuthenticated": false
}
