{
  "jobPostingInfo": {
    "id": "ddf5bd0d8fa21001c48762c2f9b40000",
    "title": "Office of Inclusion - Operations Manager",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Overview</b></p><p>JPL is driven to achieve and to find answers to the biggest questions in the universe.  Our focus on <b>diversity, equity, inclusion and accessibility (DEIA)</b> is no different.  We have a unique opportunity for a skilled and passionate advocate to provide deep subject matter expertise and counsel on DEIA strategy and action for JPL.  As a key member of the <b>Office of Inclusion (OOI), </b>the <b>OOI Operations Manager</b> will be integral part of the OOI team to actively participate in the ongoing development and implementation of the JPL DEIA Strategy.</p><p></p><p>This role will help to ensure JPL’s value of inclusion is realized across the Lab by fostering an inclusive culture where every employee can be their authentic selves.  The position will report to the <b>Chief Inclusion Officer</b> and the <b>Deputy</b> <b>Manager of the Office of Inclusion </b>to operationalize and execute diversity, equity, inclusion, and accessibility (DEIA) content, tools, events, programs, and website. This role will also lead various JPL lab-wide teams and DEIA committees on behalf of the Office of Inclusion.</p><p></p><p><b>Job responsibilities:</b></p><p><b>DEIA Program Support </b></p><ul><li><p>Partners Lab-wide to develop strong partnerships and through collaboration identify opportunities to actualize JPL’s value of inclusion by fostering an inclusive culture. Counsels, consults and advises key partners regarding these opportunities. </p></li><li><p>Builds and facilitates relationships with internal stakeholders to understand DEIA needs and connect resources and tools to those stakeholders.</p></li><li><p>Executes proposals and ensures alignment to funding sources for implementation of the OOI strategy and initiatives with significant lab-wide impact.</p></li><li><p>Coordinates JPL’s inclusion group programming across the Lab, which includes employee resource groups, DEIA committees, and other groups on Lab that are all working to advance DEIA efforts. Provides support for programs and initiatives and help ensure best practices are shared amongst communities of inclusion.</p></li><li><p>Manages funding for JPL’s communities of inclusion and ensure practices are aligned with JPL’s Core Values and Caltech’s Code of Ethics.</p></li><li><p>Researches industry best practices for new and ongoing improvements to OOI programs</p></li><li><p>Collaborates with creative teams to produce content that supports strategic OOI initiatives.</p></li><li><p>Works with OOI management to ensure that DEIA projects are resourced for ongoing support.</p></li><li><p>Develops and presents information on OOI initiatives and strategic direction for various audiences and levels of management.</p></li><li><p>Implements and maintains the OOI digital infrastructure/presence.  </p></li><li><p>Recommends infrastructural approaches to implement of and development of policies in facilitating diversity, equity, inclusion, and accessibility.</p></li></ul><p></p><p><b><span>Business Operations Support </span></b></p><ul><li><p>In partnership with the Chief Inclusion Officer, develop business practices, identify opportunities and recommend changes to improve the effectiveness and efficiency of OOI processes and program implementations.</p></li><li><p>Continually develops, evaluates, revises and monitors processes, including infusing industry best practices as appropriate.</p></li><li><p>Represents the OOI in all business forums, as needed. Participates in the planning, design and implementation of laboratory initiatives and policies by representing the office on various laboratory committees and teams.</p></li><li><p>Partners with key departments, directorates and offices – such as Ethics, OGC, Human Resources, etc. - to ensure employee awareness and compliance with Laboratory policies, procedures and practices, and regulatory requirements.</p></li><li><p>Collaborates with HR on human capital activities and initiatives, including support of the Talent Acquisition diversity recruitment strategy, pipeline strategy, succession planning, and other talent programs.</p></li></ul><p></p><p><b><span>Qualifications:</span></b></p><ul><li><p>Bachelor’s degree with a minimum of 3 years of related experience; Masters degree with a minimum of 1 year of related experience; Advanced degree preferred</p></li><li><p>Proven ability to research, gather information, and recommend solutions to fit the strategic vision and organizational needs</p></li><li><p>Proven ability to manage budgets and financial accountabilities across multiple projects</p></li><li><p>Experience with Project Management technology and tracking systems; ability to develop and maintain a project plan for all aspects of assigned projects</p></li><li><p>Proficient in the use of MS Outlook, Word, Excel, and PowerPoint; project management application experience is a plus</p></li><li><p>Passion and experience for creating positive change around diversity, equity, and inclusion</p></li><li><p>Demonstrated ability to influence and bring resources together to implement solutions and enact change; within the framework of ongoing activities within JPL</p></li><li><p>Excellent interpersonal skills, both oral and written required. Communication is confident, professional, polished and also warm.</p></li><li><p>Excellent time management skills, the ability to lead multiple projects at once and work in a fast-paced, ever-changing environment</p></li><li><p>Proven ability to exercise independent judgement, discretion and confidentiality</p></li><li><p>Ability to develop solid relationships and collaboration skills at all levels of the organization</p></li></ul><p></p><p><b>Preferred Qualifications:</b></p><ul><li><p>Awareness of key market industry trends, best practices, and taking ideas to reality within a business environment, is a plus</p></li><li><p>Experience in human resources, with a strong knowledge of policies, procedures, and the legal landscape related to DEIA efforts, is a plus</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$118,560 - $155,688<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-22",
    "timeType": "Full time",
    "jobReqId": "R3678",
    "jobPostingId": "Office-of-Inclusion---Operations-Manager_R3678",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Office-of-Inclusion---Operations-Manager_R3678"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
