{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-and-Computing-Systems-Academic-Part-Time-Intern_R4235",
    "id": "590602e9529a1001fa5ac81e73110000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This is an Academic Part Time Internship opportunity in the Product Lifecycle Management (PLM) and Computer-Aided Engineering (CAE) Group and will report to the Group Supervisor. You will be provided with hands-on work experience in the application of conceptual and theoretic curriculum within Software and Computing Systems.</p><p>You will assist in the design, implementation, enhancing and maintaining enterprise level solutions for systems such as Oracle, SAP or Teamcenter in order to meet JPL’s strategic and tactical goals.</p><p>Utilizing software product development methodology you will perform tasks such as;</p><ul><li>gathering requirements</li><li>evaluating software</li><li>designing solutions that meet the needs of the JPL community and seamlessly integrate with the enterprise system</li><li>debugging and configuring applications</li><li>designing integrated test plans</li><li>conducting and coordinating integrated tests</li><li>acting as a liaison to the JPL community throughout the entire life cycle of the product</li></ul><p></p><p>Enterprise Product Data Management (EPDM) provides JPL with the management and storage of design and engineering artifacts for mission projects.</p><p></p><h2>Qualifications:</h2><ul><li>Must be currently enrolled at least half-time at an accredited college or university pursuing a Bachelors degree in Computer Engineering, Data Science or related technical degree.</li><li>Must be able to work full time, 40 hours per week, for a minimum of 8-12 weeks during the summer and part-time (approx. 20 hours/week) while attending classes.</li><li>Minimum GPA 3.0.</li><li>Has some familiarity in one or more of the following areas: Code development, writing of procedures, customer support and software application setup &amp; testing</li><li>Completed coursework with exposure to standard principles, theories, concepts and techniques in Information Technology, Computer Science or Computer Engineering.</li><li>Knowledge and experience with MS Office.</li><li>Strong written and verbal communication skills and ability to work in a team environment.</li><li>Must be able to perform manual data migration per written and verbal directions.</li><li>Interface with users and stakeholders to provide status and/or training.</li></ul><p>The typical hourly rate for this job in Pasadena, California depending on education level is $19 as a freshman, $22 as a sophomore, $26 as a junior, $29 as a senior</p><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$0 - $0 see information above<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Software-and-Computing-Systems-Academic-Part-Time-Intern_R4235",
    "jobReqId": "R4235",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 7 Days Ago",
    "startDate": "2023-04-28",
    "timeType": "Part time",
    "title": "Software and Computing Systems Academic Part Time Intern"
  },
  "userAuthenticated": false
}
