{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Section-Manager-II-III--Project-Systems-Engineering---Formulation--312-_R4345",
    "id": "753d3026a57c100179df5d0e4e3a0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>The <b>Systems Engineering Division</b> is responsible for providing leadership in systems engineering at the project level of integration, the flight system level of integration, the payload level of integration, and related disciplines across the entire project life cycle and for the Engineering and Science Directorate’s institutional systems.  </p><p></p><p>We are currently seeking a <b>Section Manager for the </b><b>Project Systems Engineering &amp; Formulation Section</b> and will report to the <b>Division Manager. </b>Section provides full lifecycle leadership in systems engineering at the project level starting with the formulation, planning and execution of the project systems engineering function for JPL space flight missions from concept development through completion of post-Launch checkout and commissioning. The section is responsible for the systems engineering leadership that includes both the leadership of the project-wide systems engineering effort, and the delivery of the project-level systems engineering products. The section also provides formulation services from concept ideation, to the full expression of that concept in formulation phase products such as formal proposals and Mission Concept Reviews.</p><p></p><p><b>Tasks include but not limited to:</b></p><ul><li><p>Lead and manage a section of technical group supervisors and engineers whose efforts fall within the Section’s charter of systems engineering at the project system level, spanning project system design, build, integration and test.</p></li><li><p>Leadership in the Project Systems Engineering for all mission sizes from Flagship Missions to CubeSat and SmallSat Missions Ensure the effective implementation and coordination across multiple stakeholders for section products</p></li><li><p>Build and maintain close working relationships with the customer directorates</p></li><li><p>Ensure the technical quality and performance for all Section-owned products and services.</p></li><li><p>Ensure that work is appropriately staffed in a timely fashion.</p></li><li><p>Lead the Section’s efforts to integrate and make use of the best systems engineering practices, tools, and techniques and ensure that section products, processes, and cost histories are continually improved and documented.</p></li><li><p>May be assigned as a JPL Process Owner for a key system engineering process area.</p></li><li><p>Leadership of formulation for both competed and assigned mission opportunities including systems engineering and production of formal proposals.</p></li><li><p>Identification and evaluation of possible on-ramps for advanced technologies.</p></li></ul><ul><li><p>Have primary management responsibility directly or through lower management levels for an organization. </p></li><li><p>Responsible for hiring and retaining a diverse, highly qualified staff, and for providing career coaching, growth and personal development for direct report JPL employees. </p></li><li><p>Accountable for the performance of employees or the work output of managed subcontractors. </p></li><li><p>Maintains a safe working environment and a strong customer focus. </p></li><li><p>Responsible for continuous System Engineering improvement, setting goals and ensuring that they are achieved. </p></li><li><p>Uses best industry practices to ensure success in areas of responsibility. </p></li><li><p>Ensures employee awareness and compliance with Laboratory policies, procedures, and practices, and regulatory requirements. </p></li><li><p>Knows and applies appropriate tools, processes, and procedures affecting organization of responsibility.</p></li></ul><p></p><p><b>Qualifications: </b></p><ul><li><p>Bachelor’s degree in Engineering, Physics, or related discipline with a minimum of 12 years of related experience; Master’s degree in similar disciplines with a minimum of 10 years of related experience; or PhD in similar disciplines with a minimum of 8years related experience.  A minimum of 8 years of supervisory and/or management experience is required</p></li><li><p>Demonstrated capabilities in formulation, systems engineering, process improvement, and leadership, across the project lifecycle.</p></li><li><p>Multidisciplinary knowledge in systems engineering, with significant expertise in one or more specialties. </p></li><li><p>Demonstrated supervisory experience with line or program/project organizations.  </p></li><li><p>Knowledge of best industry practices in systems engineering.</p></li><li><p>Multidisciplinary and in-depth expertise regularly used in the application, promotion, and development of cutting edge principles, theories, concepts and emerging technologies in systems engineering.   </p></li><li><p>Complete knowledge of the JPL Systems Engineering Practices, and demonstrated ability to tailor the planning and execution of those practices on one or more flight projects. </p></li><li><p>Proven ability as a strong and visionary leader with a history of success and discipline in planning, execution and implementation.   </p></li><li><p>Proficiency in decision-making, delegation, and change management. </p></li><li><p>Familiarity with JPL line management practices and effective line-project-program interactions. </p></li><li><p>Ability to team with JPL institutional management to creatively solve complex enterprise level institutional issues. </p></li><li><p>Substantial experience planning budgets, workforce, and estimating cost to accomplish work. </p></li><li><p>Demonstrated ability in resolving complex technical and managerial problems. </p></li><li><p>Proactive team building skills, excellent verbal/written communication and presentation skills. </p></li><li><p>Demonstrated commitment to customer satisfaction and employee career development. </p></li><li><p>Proven ability to work effectively with all levels of engineers and managers.</p></li><li><p>Either have or willingness and ability to acquire a Top Secret (TS) clearance based upon Single Scope Background Investigation (SSBI) within 5 year scope and approved for Sensitive Compartmented Information (SCI) accesses..</p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Expert knowledge of strategic Laboratory policies and procedures and NASA policies and procedures, and government regulations. </p></li><li><p>Recognized expert in systems engineering.  </p></li><li><p>Extensive experience in multiple phases of the project life cycle, including formulation, design, implementation, system-level testing, and operations.  </p></li><li><p>Recent experience in the design, development and operations of major flight project systems.   </p></li><li><p>Experience in the preparation, delivery, and/or review of Project Systems Engineering gate products,  </p></li><li><p>Familiarity with operational project systems and project system implementation methodologies at organizations external to JPL.</p></li><li><p>Demonstrated commitment to advancing the state of the practice of project systems engineering. </p></li><li><p>Awareness, knowledge, and/or experience with model-based systems engineering, or other related state-of-the-practice systems engineering techniques.    </p></li><li><p>Strong familiarity with the Solar System Exploration, Mars Exploration, Earth Science and Technology, and Astronomy, Physics and Space Technology Directorates. </p></li><li><p>Experience collaborating with industry partners, other NASA centers, and other space agencies, in the execution of projects and programs. </p></li><li><p>Demonstrated ability to team effectively with the science community. </p></li></ul><p></p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$177,632 - $233,376<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Section-Manager-II-III--Project-Systems-Engineering---Formulation--312-_R4345",
    "jobReqId": "R4345",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 14 Days Ago",
    "startDate": "2023-05-31",
    "timeType": "Full time",
    "title": "Section Manager II/III (Project Systems Engineering & Formulation (312)"
  },
  "userAuthenticated": false
}
