{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Postdoc--Greenhouse-Gases-in-the-Earth-System_R4862",
    "id": "2e07b6cf3c6a10010cee4bf0ed040000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>JPL is unique among NASA Centers in that its staff are Caltech employees, yet can access NASA technical resources. Cross-discipline teamwork is standard here: colleagues across JPL&#39;s science and engineering organizations and on Caltech&#39;s academic campus often work together. Learning to speak and understand other disciplines&#39; languages is a doorway to the creativity needed to do what has not been done before. JPL staff are encouraged to create mission concepts that address humanity&#39;s core questions through a combination of science and technology. They are supported in developing ideas into proposals and hardware, and in communicating funded missions&#39; results to the scientific community and the broader public. JPL seeks to employ scientists and engineers who are passionate about lifelong learning and excited to both contribute to and lead team efforts. We emphasize the importance of partnering across discipline boundaries and creating a friendly, constructive work environment to overcome space exploration&#39;s challenges. The Postdoctoral scholars at JPL benefit from an informal mentoring network, an annual conference showcasing their results, a dedicated seminar series, exposure to diverse career paths, and social connections across the JPL and Caltech community for advice on housing, childcare, and other aspects of living in southern California.</span></p><p></p><p><span>The Earth Science Section at JPL seeks a postdoc researcher. The successful candidate will be a member of JPL’s Carbon Cycle and Ecosystems group which studies the role of ecosystems and the carbon cycle within the Earth System. Research in the group focuses on carbon cycle-climate interactions, impacts of climate on ecosystem structure, function, and composition, as well as on disturbance processes, such as wildfire. Members of the group study tropical drought effects, warming and changes in permafrost regions, land use change, effects of ocean climate variability on marine biology and biogeochemistry, terrestrial-marine interactions in the coastal zone, greenhouse gas emissions from cities and energy systems and the consequences of functional diversity for ecosystems on land and in the sea.</span></p><p></p><p><b><span>Project Description:</span></b></p><p><span>The reduction of greenhouse gases emissions is the principle mechanism to mitigate against climate change. The Paris agreement provides a framework for countries to assess and enhance their emission commitments through the Global Stocktake. However, these endeavors are occurring against a backdrop of climate change that is exerting pressure throughout the Earth System that is in turn challenging the ability of natural world to act as a buffer. In particular, extreme events amplified by natural variability and trends such as El Niños could push certain regions, e.g., the Amazon, into irreversible changes known as “tipping points”.</span></p><p></p><p><span>Understanding, quantifying, and predicting these impacts requires an interdisciplinary approach that can intellectually weave together carbon, water, and energy cycles informed by observations in conjunction with advanced modeling, data assimilation, and machine learning techniques.</span></p><p></p><p><span>To that end, we solicit here postdoc candidates to advance our understanding of greenhouse gases in the Earth System. The candidate will focus on the natural and anthropogenic components of the carbon cycle with a focus on its interaction within a perturbed Earth System.</span></p><p></p><p><span>The candidate will be advised at JPL as part of a larger NASA activity that promotes interdisciplinary Earth System Science using satellite observations with new data analytics platforms. Consequently, they will be expected to engage with other NASA disciplinary scientists working in the areas of fires, hydrology, atmospheric composition and ocean biogeochemistry. At JPL, they will have the opportunity to work in a dynamic environment that promotes collaboration with other researchers.</span></p><p></p><p><span>The appointee will be expected to publish scientific findings in top-tiered peer-reviewed scientific journals as well as presenting results in the related science team meetings, workshops, and conferences.</span></p><p></p><p></p><p><b><span>Qualifications:</span></b></p><ul><li>PhD in Atmospheric Sciences, Physics, Geophysics, or a related technical discipline</li><li>Demonstrated experience and knowledge of the carbon cycle and related fields</li><li>Experience with python and similar languages.</li><li>Excellent oral (including public speaking) and written communication skills</li><li>Experience working in a team environment</li><li>Strong interpersonal skills</li><li>Peer-reviewed publications related to atmospheric retrievals and/or their utilization for Earth system science research</li></ul><p></p><p><b><span>Preferred Qualifications</span></b></p><ul><li>Experience with carbon cycle modeling and data analysis</li><li>Experience with inverse modeling.</li><li>Demonstrated skills in the understanding and use of satellite data</li><li>Knowledge of Juypter notebooks and cloud computing.</li></ul><p></p><p><span>Applicants may be subject to additional program requirements by NASA. Postdoctoral Scholar positions are awarded for a minimum of one-year period and may be renewed up to a maximum of three years. Candidates should submit the following to this site: CV, representative publications, contact information for three references, and a cover letter stating their research accomplishments and interests.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$82,180 - $82,180<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Postdoc--Greenhouse-Gases-in-the-Earth-System_R4862",
    "jobReqId": "R4862",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 8 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-12-12",
    "timeType": "Full time",
    "title": "Postdoc: Greenhouse Gases in the Earth System"
  },
  "userAuthenticated": false
}
