{
  "jobPostingInfo": {
    "id": "6e3972dee4581002091c63e08cec0000",
    "title": "Software Systems Engineer II",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities</b></p><p>The Enterprise and Information Systems Engineering Section (319) provides information-oriented cross-cutting engineering processes, tools, and services across the Engineering and Science Directorate (ESD) and the Office of Safety and Mission Success (OSMS). The Section primarily engages in the production, exchange, management, and protection of data, information, and knowledge throughout the entire engineering development lifecycle.</p><p>Do you have a passion for space exploration and computer aided engineering? Are you a strategic thinker and enjoy the challenge of developing and improving engineering practices and processes?</p><p></p><p>We seek a <b>Software Systems Engineer II</b> to join the software development team that designs and implements the Ingenium electronic procedure system, used by JPL to test and operate spacecraft. Members of this team work closely with users to provide effective and dependable automation of their test procedures that verify functionality of our spacecraft under development. In this role you will be a member of the <b>System Modeling Methodology Group</b> (319K) and report to the supervisor of that group. You will become an integral member of a small development team with a primary responsibility of implementing new features and updating a highly interactive web application used to automate spacecraft testing.</p><p></p><p><b>Qualifications</b></p><p>Required qualifications include:</p><p></p><p>- Bachelor’s degree in Software Engineering, Computer Science or related discipline with a minimum of 3 years related experience; Master’s degree in similar disciplines with a minimum 1 years of related experience; or a PhD in similar disciplines.</p><p>- Extensive experience with the following programming languages/technologies: Python, Javascript, SQL, HTML/CSS</p><p>- Experience implementing user interfaces using the Vue.js framework</p><p>- Knowledge in utilizing Restful web services frameworks</p><p>- Experience with Git/GitHub use and integration</p><p>- Working knowledge of Software and Systems Engineering practices and artifacts</p><p>- Experience with JIRA, ZenHub, or similar issue-tracking systems</p><p>- Experience with containerization (e.g. Docker)</p><p></p><p> Preferred Skills:</p><p></p><p>- Experience integrating and maintaining the Froala editor in a web application</p><p>- Experience integrating and maintaining the Handsontable data grid editor in a web application</p><p>- Experience with the Jasmine javascript test framework</p><p>- Experience with implementing web applications in Django</p><p>- Experience with Jenkins or other continuous integration system</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$112,070 - $122,304<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-06",
    "timeType": "Full time",
    "jobReqId": "R3723",
    "jobPostingId": "Software-Systems-Engineer-II_R3723",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-Systems-Engineer-II_R3723"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Software Systems Engineer II- (Mission Ground Data System) - Project Discovery",
      "externalPath": "/job/JPL-Campus/Technologist-III---Project-Discovery_R3657",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-02-07"
    },
    {
      "title": "Software Systems Engineer II",
      "externalPath": "/job/JPL-Campus/Software-and-Venue-Reliability-Engineer-II_R3713",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-18"
    }
  ],
  "userAuthenticated": false
}
