{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Business-Administration-Manager-Level-1_R4304",
    "id": "91531aa0918f10017519d31f14790000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p></p><p>The <b>Mechanical Systems Engineering, Fabrication &amp; Test Division (35)</b> is seeking an experienced business professional for the challenging and dynamic role of <b>Business Administration Manager (BAM) </b>for the <b>Propulsion, Thermal and Materials Engineering Section (353), </b>reporting to the Division Business Administration Manager<b>.</b></p><p></p><p>The <b>Business Administration Manager I </b> will be responsible for the management and guidance of section business operations including financial, human resources, workforce, acquisitions, facilities, safety &amp; property management.  Will collaborate with technical section management on long range strategic planning and participate in the development and implementation of the organization’s goals and objectives.</p><p>The ideal candidate will have previously demonstrated a strong, collaborative, team player philosophy and spirit, excellent teaming and communication skills, professionalism, a strong work ethic, a process improvement mindset, and the ability to provide excellent customer service.</p><p></p><p><b>Some Challenges You Will Tackle:</b></p><ul><li><p>Be an integral member of the Section and Division Business leadership team, working with both levels of management to develop operating strategies that address current and anticipated future organizational needs.  Will play a critical role in meeting delivery schedules for business products and resolving issues that may arise.</p></li><li><p>Plan, manage and provide performance reporting of the section’s operations budget; analyze and report on section’s total business base for quarterly reviews.</p></li><li><p>Ensure Cost Account Managers (CAMs) are supported with budget planning and reporting activities.</p></li><li><p>Serve as a focal point for financial communications to line management and staff, project business staff (Project Resource Analyst &amp; Project Schedule Analyst), and other business organizations as needed and will be called upon to make authoritative budgetary recommendations.</p></li><li><p>Help ensure the governance of the Section’s service centers ensuring the development of the annual plan and billing rates and appropriate monitoring of performance against the plan. Will serve as a key point of service center financial intelligence and control for the section and cost accounting.</p></li><li><p>Be responsible for hiring and retaining a diverse, highly qualified administrative staff, and for providing career coaching, growth and personal development opportunities.</p></li><li><p>Monitor the activities of the business team and make decisions on work assignments, hiring, promotions, performance appraisals and compensation.</p></li><li><p>Foster an environment of teamwork and continuous improvement to ensure that business operations run efficiently, and maintain a high level of customer service to the section.</p></li><li><p>Maintain a safe work environment and ensure employee awareness of and compliance with Laboratory policies, procedures and regulatory requirements; serve as a primary information source for the Section.</p></li><li><p>Serve as a primary information source for interpreting Laboratory policies and procedures for the section and will help ensure employee awareness and compliance with Laboratory practices and regulatory requirements. </p></li><li><p>Serve as an advisor on sensitive HR issues such as employee relations, workforce planning, and compensation.</p></li><li><p>Provide administrative updates for discussion at section staff bi-weekly meetings and answer questions that arise during those meetings.</p></li><li><p>Serve as a liaison to other Laboratory organizations, including representation and participation on committees and will foster, maintain and utilize cross-organizational relationships to enact strategic initiatives.</p></li></ul><p></p><p><b>Qualifications:</b></p><p></p><p><b>You Must Have:</b></p><ul><li><p>Bachelor’s Degree (BS/BA) in Business Administration, Management, Finance, Business Information Systems, or a related field with typically a minimum of 9 years of experience or a Master’s degree in similar fields with a minimum of 7 years of related experience. At least two years of leadership experience.</p></li><li><p>Strong analytical reasoning skills and problem-solving attributes, using innovation and creativity when approaching new situations and challenges.</p></li><li><p>Ability to describe complex issues clearly and effectively with all levels of employees and management including the ability to analyze, interpret, synthesize and effectively present complex information at key leadership meetings.</p></li><li><p>Excellent communication, interpersonal and presentation skills, with ability to motivate individuals and team.</p></li></ul><p></p><p><b>Got These? Even Better:</b></p><ul><li><p>The successful candidate will have demonstrated experience in implementing business operations innovations resulting in process improvements and increased efficiency.</p></li><li><p>Agility and ability to meet rapidly changing requirement needs and manage competing priorities.</p></li><li><p>Be a proactive leader that is able to identify, lead and support change and continuous improvement within own section and the wider JPL organization. </p></li><li><p>Proficient in the use of business applications software and possess the ability to use JPL’s specialized project management and financial applications.</p></li><li><p>Knowledge of Laboratory policies and procedures, NASA policies and procedures, and government regulations across a range of applications.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$126,360 - $167,960<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Business-Administration-Manager-Level-1_R4304",
    "jobReqId": "R4304",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 12 Days Ago",
    "startDate": "2023-05-10",
    "timeType": "Full time",
    "title": "Business Administration Manager I (Section 353 – Propulsion, Thermal and Materials Engineering)"
  },
  "userAuthenticated": false
}
