{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Mechanical-Engineer-IV_R4325",
    "id": "7887ef81446a100210fd0fe822790000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the <b>Mechanical Systems Engineering, Fabrication and Test Division </b>which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breath of mechanical disciplines and is applied from architectural concept development through mission operations.</p><p></p><p>As a <b>Mechanical Engineer IV</b> you will be working for JPL’s<b> Spacecraft Mechanical Engineering Section (352) </b>in the <b>Mechanical Integration Engineering Group (352H)</b>, which is responsible for the architecture of mechanical engineering designs and solutions that enable unprecedented missions and science acquisition. We are seeking an individual with a proven track record delivering mechanical hardware to join our staff as a <b>Mechanical Engineer IV.</b>  The responsibilities of the position include the following:</p><ul><li><p>Serve as a Technical Lead for <b>Mechanical Integration Engineer</b> for a JPL Flight Project.</p></li><li><p>Work in a collaborative environment to manage, design, analyze, build and test <b>Mechanical Ground Support Equipment (MGSE) </b>and tooling for a Flight Project.</p></li><li><p>Lead a team to develop <b>Storyboards</b> depicting the Mechanical Integration and Test (I&amp;T) flow to determine MGSE, technical personnel, facilities, and tools that are required for a Flight Project.</p></li><li><p>Lead engineers with stress and loads analysts, designers, manufacturing specialists, machine shop, flight techs, and project staff. </p></li><li><p>Accountable for team results on multi functional and/or multidisciplinary projects and assignments, including performance standards, budget, and schedule.</p></li><li><p>Develop and lead technical requirements and specify interfaces for flight hardware for MGSE under development.</p></li><li><p>Develop and lead procedures for the testing, usage, and set-up of MGSE designed for Flight Project I&amp;T</p></li><li><p>Conceptualize design or highly complex and critical mechanical assemblies of significant impact from engineering requirements.</p></li><li><p>Lead the design and development of highly complex and critical mechanical subsystem level architectures.</p></li><li><p>Conduct major design reviews and responsible for closure of resulting actions.</p></li><li><p>Provide analysis of situation or data that requires identification, review and interpretation of extremely complex factors as well as precedential decisions as to policies, procedures and practices. Interactions normally involve advising management on extremely complex and significant issues.</p></li><li><p>Work independently, and under the direction of the group supervisor, project management, and technical leads.</p></li><li><p>Represent JPL through regular interface with representatives of organizations outside JPL.</p></li><li><p>Serves as an essential team leader on teams inside and outside organization, project, activity, or function, including outside JPL.</p></li></ul><p></p><p><b>Required Qualifications:</b></p><ul><li><p>Bachelor’s degree in Mechanical Engineering, Aerospace Engineering, Civil Engineering or related technical discipline with a minimum of 9 years of related experience; or Master’s degree in similar disciplines with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years related experience.</p></li><li><p>Extensive experience and wide application of advanced principles, theories, concepts, and techniques in solving mechanical engineering problems, with the ability to perform trade studies, develop conceptual configurations, engineer piece-parts and mechanical systems, and facilitate the fabrication, assembly, and qualification of MGSE hardware.</p></li><li><p>Wide-ranging experience and advanced knowledge in one or more mechanical engineering disciplines (<span>design, analysis and test of structures and mechanisms, including strength of materials, machine and structure design, structural/mechanical testing, manufacturing engineering, mechanical systems, and machine shop practices</span>) to provide leadership, oversight, and monitoring to an organization’s technical products, services, and/or capabilities; provides assessment of technical deliverables; resolves technical and resource issues.</p></li><li><p><span>Extensive experience using CAD modeling software (preferably Unigraphics/Siemens NX, SolidWorks, and Teamcenter) used in a Product Delivery Management (PDM) or similar Concurrent Engineering environment.</span></p></li><li><p><span>Extensive experience developing and delivering mechanical parts, assemblies or mechanical systems.</span></p></li><li><p>Significant experience leading a multi functional and/or multidisciplinary team for a project, activity, or function within scope of assigned responsibility.</p></li><li><p>Extensive experience mentoring and coaching and coaching others internal and external to organization and inside and outside scope of responsibility.</p></li><li><p>Proficient communication (oral, written, presentation), interpersonal, negotiation and organizational skills.</p></li></ul><p></p><p><i>We value diverse skills, perspectives, and experiences. Your qualification could add tremendous value to our team. We also provide industry-leading flexibility for partial tele-work accommodations contingent on project requirements.</i></p><p></p><p><b>Desired Qualifications</b></p><ul><li><p>Lift Director experience with flight and non-flight hardware</p></li><li><p>Practical experience in Assembly, Test and Launch Operations (ATLO), or other direct experience in mechanical integration of spacecraft systems, especially in a clean room and/or high bay.</p></li><li><p>Direct role in the development and delivery of mechanical hardware, especially MGSE or flight system hardware</p></li><li><p>Experience leading three or more engineers and/or technicians for an integration project</p></li><li><p>Experience writing assembly and test procedures.</p></li><li><p>Knowledge of ASME B30 Series, NASA, AWS (American Welding Society), OSHA, and other industry and government standards.</p></li><li><p>Ability to produce CAD models and engineering drawings, especially using Siemens NX</p></li><li><p>Ability to create Finite Element Models (FEM) for internal loads calculations, modal frequency analysis, and buckling analysis.</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$141,856 - $169,416<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Mechanical-Engineer-IV_R4325",
    "jobReqId": "R4325",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 9 Days Ago",
    "startDate": "2023-05-26",
    "timeType": "Full time",
    "title": "Mechanical Engineer IV"
  },
  "userAuthenticated": false
}
