{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Project-Business-Manager-IV_R4676",
    "id": "bbc5223b63e610010cf89138fea90000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As a Project Business Manager, you will be a member of the Program Business Management Division (PBMD), and will have the opportunity to lead the projects business functions for CRISTAL, Sentinel-6C and CIMR.  These are altimetry missions that are responsible for delivery identical radiometers to assist in measuring sea-ice thickness and sea surface height.</p><p></p><p><u>Responsibilities </u></p><p>In this role you will: </p><ul><li><p>Partner with the Project Manager to achieve both project’s business goals, utilizing the Institution’s business framework and processes. </p></li><li><p>Act as the principal point of contact for the project’s business management activities, and provide management direction, accountability, and oversight over these activities.</p><ul><li><p>Represent and speak for both projects on business matters in internal and external reviews.</p></li><li><p>Communicate key project business and financial matters to appropriate programmatic and line directorates, including institutional leadership.</p></li><li><p>Provide primary interface with business contacts at the NASA Mission Directorate, NASA Program Office, and subcontractors.</p></li><li><p>Develop and maintain effective working relationships across the JPL business community.</p></li></ul></li></ul><p></p><ul><li><p>Manage successful performance of the project’s business functions in cost and schedule planning, forecasting, analysis, performance measurement, assessment and reporting, cost estimation &amp; pricing, contracts, subcontracts, and procurements in all phases of the project lifecycle.</p><ul><li><p>Execute the Business Management Implementation Plan, and identify needs for requisite training and alignment during implementation.</p></li><li><p>Perform on-going analyses to understand, forecast and communicate project business trends, performance analysis and status, and assess recommendations for the corrective actions provided by the project team for all cost and schedule variances against plan, including tradeoff analyses.</p></li><li><p>Provide high-quality assessments of project business issues and substantive recommendations to the project manager and institutional leadership.</p></li></ul></li></ul><p></p><ul><li><p>Promote and foster best business practices in accordance with established Institutional processes and procedures and in accordance with the Prime Contract.</p><ul><li><p>Develop and implement business processes and products as required by PBMD, the Directorate, and the Institution.</p></li><li><p>Promote employee awareness of best business practices and standards.</p></li><li><p>Contribute to, and actively support, long-range institutional initiatives, including Enterprise 2.0.</p></li></ul></li></ul><p></p><ul><li><p>Attract, develop, coach, and retain a diverse, highly qualified business team.</p><ul><li><p>Communicate near term and long term business staffing requirements to appropriate line organizations and ensure staff with appropriate skills are assigned.</p></li><li><p>Form effective relationships with business teams at performing centers.</p></li></ul></li></ul><p></p><ul><li><p>Foster and model JPL’s Leadership Capabilities.</p></li></ul><p></p><p><u>Qualifications</u></p><ul><li><p>Typically requires a Bachelor degree in Business Administration or similar discipline with a minimum of 9 years of related experience; Master degree in similar discipline with a minimum of 7 years of related experience; or PhD in similar disciplines with a minimum of 5 years related experience.</p></li><li><p>Wide-ranging experience in all phases of the flight project life cycle, with emphasis on formulation and implementation phases.</p></li><li><p>Sustained successful demonstration of expertise, ability, and authority in performing in a business leadership role on a complex technical development.</p></li><li><p>Breadth of experience in managing and implementing cost and schedule planning, forecasting, analysis, earned value performance measurement, assessment and reporting, project controls, cost estimation &amp; pricing, contracts, subcontracts, and procurements.</p></li><li><p>Demonstrated ability to meet rapidly changing project needs and manage competing priorities.</p></li><li><p>Ability to maintain an objective perspective in assessment and communication of performance.  </p></li><li><p>Proven leadership skills and demonstrated ability to develop, motivate, coach, and maintain a high performing team.</p></li><li><p>Significant experience providing management, direction, and expertise to activities of a multifunctional organization through managers and/or staff positions that have responsibility for results.</p></li><li><p>Effective communication skills in verbal, written, and presentation forms.</p></li><li><p>Demonstrated ability to influence sponsors, partners, subcontractors, and peers in a large project environment.</p></li><li><p>Ability to travel based on business requirements.</p></li></ul><p></p><p><u>Preferred Qualifications</u></p><ul><li><p>Experience with integrating foreign partner schedules to form a consolidated project schedule position</p></li><li><p>Thorough knowledge of Laboratory policies and procedures, applicable prime contract requirements, NASA procedural requirements, and government regulations across a range of applications.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$121,680 - $154,440<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Project-Business-Manager-IV_R4676",
    "jobReqId": "R4676",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 21 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-15",
    "timeType": "Full time",
    "title": "Project Business Manager IV"
  },
  "userAuthenticated": false
}
