{
  "jobPostingInfo": {
    "id": "62d9b8135fde10010b652f81a8090000",
    "title": "Research Scientist for Wildland Fire Science and Applications",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>What are the conditions leading to megafires? How can we quantify the impact from wildland fires to ecosystems and air quality? What is the likelihood for major impacts from wildland fires and prescribed burns on multiple spatiotemporal scales? What measurements and models can improve the predictability of wildland fire risks? How can decision makers for wildland and fire management be provided with the right data at the right time in the right format? How can we use satellites to better understand how wildfires are affecting climate and vice-versa? What satellite and/or suborbital remote sensing data are most useful for pre- and post-fire needs by end-users? These are the questions our society needs answers for. This can be your mission— your opportunity—to enable the community to answering these questions! If you’re driven to discover new insights in how the Earth works as system, apply and invent new tools and methods to advance science and its usage to benefit society, and inspire future generations of scientists and leaders, you’re ready for JPL!</span></p><p><span> </span></p><p><span>We offer a work environment unlike any other: we resolve challenges on national and international levels, address global problems such as climate change, inspire passion, foster innovation, build collaboration, and reward excellence.</span></p><p><span> </span></p><p><span>You can learn more about Earth Science programs at JPL at the following sites: <b>https://science.jpl.nasa.gov/EarthScience</b>, and <b>https//earth.jpl.nasa.gov</b>.</span></p><p><span> </span></p><p><span>In this role, you will work as a full-time scientist in a dynamic team environment responsible for developing and leading a unique portfolio of scientific research and applied sciences activities, while collaborating with the existing expertise at JPL including its Earth Science Section. You will contribute to maximizing the science return of current and future NASA missions, such as NISAR, SBG, and AOS as well as shaping the next generation of airborne and satellite measurements transforming the way we monitor and learn about wildland fires. Furthermore, you will become an active contributor to NASAs Wildland Fire Sense program. You will be expected to seek funding through competed solicitations, publish journal articles, broadly communicate the results of your research, and mentor junior researchers, postdoctoral scholars and/or students.</span></p><p><span> </span></p><p><b><span>The following qualifications are required: </span></b></p><p><span>• PhD in earth science or a related technical subject area with at least 5 years of postdegree experience.</span></p><p><span>• Demonstrated record of peer-reviewed publications related to wildfire science and/or applications connected to remote sensing data.</span></p><p><span>• Excellent oral (including public speaking) and written communication skills.</span></p><p><span>• Experience building and/or working in collaborative, diverse and inclusive team environments</span></p><p><span>• Strong interpersonal skills, demonstrated through mentorship, listening and effective communication</span></p><p><span>• Advanced knowledge of methodologies used for enhancing science and its applications in fire-related remote sensing, including but not limited to modeling approaches, laboratory techniques, observational techniques (in situ and remote), and their combination in the form of scientific analyses, data assimilation, machine learning, etc.</span></p><p><span>• Experience with use of remote sensing for fire-prediction and/or fire damage assessment</span></p><p><b><span> </span></b></p><p><b><span>The following qualifications are preferred: </span></b></p><p><span>• Experience (or strong interest) in writing proposals for research solicitations in Earth Science</span></p><p><span>• Strong interest in the justification, formulation, and implementation of new airborne and/or satellite missions • Leadership experience (or potential) related to the execution of a research program, the coordination of a research team, or the organization of community efforts</span></p><p><span>• Ability to articulate a vision for wildfire science and applications through remote sensing and its applications and communicate it to an audience of non-experts</span></p><p><span> </span></p><p><span>Complete applications will include a cover letter describing the applicant’s vision for their role at JPL in the field of Earth Science with a focus on wild land fire science and impacts, a curriculum vita including a bibliography of refereed and other work, a statement on research experience and research objectives, and contact information for at least three professional references. Please combine all documents into one PDF.  </span></p><p><b><span> </span></b></p><p><b><span>Review of applications will begin December 2022 and will continue until the position is filled.</span></b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$148,720 - $185,952<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2022-12-23",
    "timeType": "Full time",
    "jobReqId": "R3461",
    "jobPostingId": "Research-Scientist-for-Wildland-Fire-Science-and-Applications_R3461",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Research-Scientist-for-Wildland-Fire-Science-and-Applications_R3461"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": true
}
