{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Microdevices-Engineer-IV_R4294",
    "id": "91531aa0918f1001101f405c481a0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>The <b>Microdevices &amp; Sensor Systems Section</b> operates under the Instrument Division and charters the development and delivery of sensors, instruments, instrument electronics, and flight software technologies needed by JPL/NASA to enable new terrestrial, astrophysics, and planetary in situ and remote science experiments and observations. The Section provides research and technology for science instrument as well as flight instrument engineering.</p><p>We are seeking a <b>Microdevices Engineer Level IV</b> with expertise in varied skill-sets in optical meteorology, laser characterization, and optical design. Will guide the transition to compact and integrated photonic systems for future generations of quantum sensors. Will be a key member of the Photonics and Quantum Sensors Group.</p><h2></h2><h2><b>Tasks include, but are not limited to:</b></h2><ul><li><p>Extensive understanding characterizing laser performance (linewidth, beam quality, lifetime, etc.)</p></li><li><p><b>Extensive experience characterizing optics, optical materials, and components</b></p></li><li><p><b>Leads research proposals for further development and applications</b></p></li><li><p>Designs and also reviews characterization routines to verify optical performance and perform optical calibration.</p></li><li><p>Extensive experience performing optical characterization and design using Zemax, Code V, etc.</p></li><li><p>Design complex optical assemblies with lens systems, optical relays, refractive and diffractive optics, and micro/nano optical structures.</p></li><li><p>Design, build, and validate opto-mechanical assemblies and calibration systems for a variety of different optical functionalities.</p></li><li><p>Characterize the performance of optical components and optical assemblies.</p></li><li><p><b>Develop precision optical alignment, fabrication, assembly, and bonding processes, and document these.</b></p></li><li><p><b><span>Extensive experience using a variety of electronics and optical measuring devices</span></b></p></li></ul><h2></h2><h2><b>Qualifications:</b></h2><ul><li><p><span>Bachelor’s degree in Applied Physics, Mechanical Engineering, Optical Engineering with a minimum of 9 years of related work experience or Masters in a similar discipline with a minimum of 7 years of related experience or PhD Degree in a similar discipline with a minimum of 5 years of work experience,</span></p></li><li><p><b><span>Optical physicists with varied skillsets in optical metrology, laser characterization, optical design and optical systems for quantum sensors. </span></b></p></li></ul><p></p><h2><b>Preferred Skills:</b></h2><ul><li><p><b><span>Extensive experience in the field of assembly of micro-Optical, Electronic and Mechanical devices</span></b></p></li><li><p><b><span>Proven related work experience in the Electro-Optical field/ </span>with a solid theoretical background in optical design</b></p></li><li><p><b>Willingness to spend a significant fraction of his/her time in the lab building prototype optical assemblies and benchtop characterization setups. </b></p></li><li><p><b>Extensive familiarity with micro optics experience in fabrication of optical elements and micro optics</b></p></li><li><p>Advanced knowledge of optical design tools such as Zemax</p></li><li><p>Benchtop optical setup for the characterization of optical components and assemblies</p></li><li><p>Automated optical alignment and calibration</p></li><li><p>Optical measurement equipment and techniques, including extensive knowledge of various types of lenses, opto-mechanical systems such as translation stages, optical beam profiling</p></li><li><p>Extensive knowledge Photonic components such as lasers electro optic modulators acousto-optic modulators and electro-optic switches and Semiconductor optical amplifiers</p></li><li><p>Proven ability to write and win proposals</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$146,536 - $195,416<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Microdevices-Engineer-IV_R4294",
    "jobReqId": "R4294",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 5 Days Ago",
    "startDate": "2023-06-22",
    "timeType": "Full time",
    "title": "Microdevices Engineer IV"
  },
  "userAuthenticated": false
}
