{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/STEM-Higher-Education---Group-Supervisor_R4418",
    "id": "bbec4f87682d1001216b868dbd3d0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The JPL STEM Higher Education Group is responsible for a premier internship program with over 1,000 students served each year and relationships with institutions of higher learning. The supervisor of this group will manage the student internships programs team, determine and administer program and JPL policies, collaborate with institutional offices for program implementation success, maintain relationships with external partners, and continuously improve diversity and inclusion in both the student and mentor populations. Knowledge of scientific and technical research is important as is specific experience with interns and mentoring through personal experience and/or program management. The supervisor must show empathy for interns and mentors through the lens of research and development.</p><p></p><p><b><u>Will: </u></b></p><ul><li><p>Will be the Group Supervisor of the STEM Higher Education group (1852) reporting to the Section Manager of the Education Office.</p></li><li><p>Will provide day-to-day management oversight to Education Office higher education activities funded by JPL and NASA’s Office of STEM Engagement including projects that JPL manages as the lead center. Will advise the section manager on issues regarding the office’s JPL charter and NASA task order.</p></li><li><p>Will supervise a diverse team of education specialists responsible for implementing detail-oriented programs that process intern applications and mentor announcements of opportunity, onboard and support placed interns, provide enrichment opportunities, communicate, collect and report data, and support JPL’s strategic hiring goals.</p></li><li><p>Will serve as the primary point-of-contact for interactions with JPL’s technical and administrative divisions for student and faculty programs, maintaining and promoting collaborative relationships with key JPL offices and stakeholders including the Engineering and Science Directorate, Office of the Chief Scientist and Chief General Counsel, Protective Services, and Safety.</p></li><li><p>Will continually look for areas to innovate, optimize and enhance program operations and the experience of both mentors and mentees.</p></li><li><p>Will represent JPL Education Office to JPL leadership as the subject matter expert for internships and fellowships.</p></li><li><p>Will remain agile and flexible in planning and execution based upon wider needs of the Lab.</p></li><li><p>On their own initiative and in collaboration with the Office of Inclusion, will promote and ensure diversity in mentorship and student and faculty programs to increase and broaden the participation of post-secondary students and faculty in science, technology, engineering, mathematics (STEM).</p></li><li><p>Will initiate and support meaningful and productive relationships with external educational partners to promote JPL’s higher education programs.</p></li><li><p>Will work closely with JPL Human Resources to assist in meeting strategic hiring goals. Will function as the point-of-contact for Caltech’s Student/Faculty Programs Office. Will serve as a member of the Caltech Student-Faculty Programs’ SURF Administrative Committee.</p></li><li><p>Will explore innovative options for expanding the higher education portfolio and share in setting the long-range strategic goals and objectives for higher education programs with section management.</p></li><li><p>Will establish policies and standards with respect to the operation of internship and fellowship programs at JPL.</p></li><li><p>Will administer external contracts and internal agreements for program operations and services including, but not limited to, bussing, parking, and payroll contracting.</p></li></ul><p></p><p><b><u>Required Skills: </u></b></p><ul><li><p>Minimum 2 years of management experience, including monitoring tasks, supervision, evaluation, and budget oversight of employees.</p></li><li><p>Strong communications skills and the ability to effectively coordinate with various stakeholders and groups</p></li><li><p>Experience in administering an internship, fellowship and/or scholarship program and/or experience as an intern in a STEM field and/or formal experience as a mentor in an established internship program.</p></li><li><p>Proven ability to work with the science and engineering community, understanding their research and work requirements to facilitate immersive learning environments and meaningful internship and fellowship opportunities for undergraduate and graduate students and faculty in STEM fields.</p></li><li><p>Proven ability to promote diversity, equity, inclusion, and access for underserved and underrepresented students in STEM fields. Solid understanding of DEIA issues in STEM education and familiarity with historical and social contexts that affect marginalized communities.</p></li><li><p>Practical experience in the legal aspects of supervision and program management with respect to students (including Title IX and safety).</p></li><li><p>Track-record of introducing innovations, continuous process improvement, goal setting, and establishing and implementing program policies.</p></li><li><p>Ability to interact and collaborate with other managers to integrate strategies and maximize effectiveness to achieve programmatic goals and demonstrated experience in providing oral and written reports to executive management.</p></li></ul><p></p><p><b><u>Desired Skills: </u></b></p><ul><li><p>Typically requires a master’s degree in science, technology, engineering, mathematics, science education, education administration, or related disciplines with a minimum of 7 years of relevant experiences, or a PhD in the same disciplines with a minimum of 5 years of program management or program coordination experience.</p></li><li><p>Personal research experience in one or more STEM-related disciplines.</p></li><li><p>Highly developed leadership skills with the ability to motivate and direct multi-generational individuals with diverse responsibilities and work styles.</p></li><li><p>Knowledge of national and local internship and fellowship programs, environments, and trends.</p></li><li><p>Experience teaching and/or working with undergraduate and graduate students and faculty at colleges and universities; understanding of academic environments and requirements.</p></li><li><p>Commitment, passion, and experience in creating positive change around DEIA as it relates to STEM education. Connections and relationships with faculty at Minority Serving Institutions.</p></li><li><p>Knowledge of NASA, JPL, and governmental policies and initiatives pertaining to underserved and underrepresented minorities with respect to broadening participation in education.</p></li><li><p>Familiarity with higher education curriculum design and improvement concepts and processes.</p></li><li><p>Substantial awareness of JPL research and development activities and business systems such as contracting.</p></li><li><p>Understanding of systems architecture and process flow mechanisms for student and faculty web-based tools and tracking systems.</p></li><li><p>Familiarity with the NASA Office of STEM Engagement and NASA Mission Directorates education initiatives.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$116,688 - $155,168<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "STEM-Higher-Education---Group-Supervisor_R4418",
    "jobReqId": "R4418",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 30+ Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-06-13",
    "timeType": "Full time",
    "title": "STEM Higher Education - Group Supervisor"
  },
  "userAuthenticated": false
}
