{
  "jobPostingInfo": {
    "id": "5ad2bec176041000d08ba60809c80000",
    "title": "Personnel Security Assistant II",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>JPL has been a critical part of space exploration since the beginning, with an unmatched history of creating groundbreaking advances in science and technology. Designing, building, and testing new technologies requires the support and expertise of security professionals to protect the people, facilities, and information that make such breakthroughs possible.</p><p></p><p>In this position, you will be a member of the Protective Services Division’s Personnel Security Group (PSG) and will report to the PSG Supervisor. While you will be responsible for a variety of duties in support of security procedures and requirements, your primary duty will be Lab access management.  You will process and issue employee and affiliate badges, including badges to secure locations.  You will facilitate day-to-day security authorizations, as well as assist in long-range security requirements for specific missions and projects.  You must possess strong customer service skills, and be able to work in a fast paced and high-volume atmosphere.  Though not part of your primary duties, you may be asked to assist in Visitor Reception to process and check in Lab visitors. </p><p></p><p>As a member in PSG, you will experience challenges every day with both traditional and non-traditional security issues. The work is diverse, requires respectful and thoughtful communication skills, as well as a proven ability to cultivate collaborative relationships.  You must treat everyone with dignity and respect.  If this environment interests you, please apply.</p><p></p><p><b>Qualifications:</b></p><ul><li>Typically requires a High School diploma with a minimum of six years related experience; Associates Degree with a minimum of one-year related experience.</li><li>Solid understanding of government badge procedures (i.e., HSPD-12).</li><li>Thorough understanding of Microsoft Office, specifically PowerPoint, Word and Excel. </li><li>Ability to prioritize work assignments.</li><li>Detail-oriented and a self-starter. </li><li>Willingness to perform a variety of tasks depending upon operational needs.</li><li>Demonstrate a positive and professional attitude with excellent customer service skills. </li><li>Treat everyone with dignity and respect.</li><li>Ability to maintain a professional demeanor with all levels of the Lab workforce, including executive management, scientists and engineers, government civil servants, contractors, and foreign nationals.</li><li>The position requires 100% on-Lab presence, eight hours per day and five days a week (5/40).    </li><li><b>Must be a U.S. Citizen and have an Active Secret Clearance.</b></li></ul><p></p><p><b>Preferred Qualifications: </b></p><ul><li>Working knowledge of Electronic Questionnaires for Investigations Processing (e-QIP) and the Defense Security Service.</li><li>Experience processing SF85, SF85P, and SF86 government forms to launch personnel background investigations.</li><li>Knowledge of USA, JPL ID, Badge Scheduler, IdMAX, CMS, URC and Lenel applications.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$55,744 - $69,160<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted Today",
    "startDate": "2023-03-20",
    "timeType": "Full time",
    "jobReqId": "R4126",
    "jobPostingId": "Personnel-Security-Assistant-II_R4126",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Personnel-Security-Assistant-II_R4126"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
