{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Power-Electronics-Design-Engineer-II_R4629",
    "id": "7b80074bcd971001651c185aa4030000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The JPL Communications, Tracking, and Radar Division performs scientific investigations, advanced technology research, engineering developments, and system implementations encompassing space telecommunications, tracking and active remote sensing using electromagnetic waves.</p><p></p><p>The Flight Communications Systems Section (337) develops, delivers, and supports Software Defined Radios (SDRs), spacecraft and airborne antennas, RF power amplifiers, and related products for RF system applications including radars, radio science instruments, and GPS tracking sensors.</p><p></p><p>JPL’s Flight Communications Systems Section is looking for a <b>Power Electronics Design</b> <b>Engineer II</b> to join their Spacecraft Transmitter Systems Group. As a member of this group, you will report to the Group Supervisor within the Flight Communications Systems Section.</p><p></p><p><b><u>Responsibilities</u></b></p><ul><li><p>Designing switching DC-DC power converters of various topologies (e.g. buck, boost)</p></li><li><p>Designing PCBs and cabling carrying high voltages (1 kV to 30 kV)</p></li><li><p>Aiding packaging and assembly of high voltage electronics, including potting of high voltage magnetics</p></li><li><p>Interfacing with industry manufacturers to support design, build, and test of high voltage magnetics</p></li><li><p>Electronic device evaluation and characterization</p></li><li><p>Detailed circuit analysis using Spice tools</p></li><li><p>Designing test and support equipment</p></li><li><p>Preparing and presenting material at design reviews</p></li><li><p>Preparing test methods and specifications; analyzing equipment to establish operating data and conducting experimental tests; providing final equipment approval, and preparing documentation and user information</p></li><li><p>Researching, developing, designing, and testing electronic components, equipment, technology, systems, and networks</p></li><li><p>Partnering with other engineers, project personnel, and management to design and develop electronics system architectures</p></li><li><p>Aiding the development of highly complex and critical digital and/or analog circuit boards and assemblies</p></li></ul><p><b> <br /><u>Qualifications</u></b></p><ul><li><p>Bachelor’s degree in Electrical Engineering, or related technical discipline with a minimum of <span>3</span> years of related experience, or a Master’s degree in similar disciplines with a minimum of <span>1</span> years of related experience, or a Ph.D. in similar disciplines with a minimum of <span>0</span> years related experience.</p></li><li><p>Broad experience in power and analog circuit design for space flight missions.</p></li><li><p>Extensive experience in designing and solving technical problems in the area of power and analog circuit design.</p></li><li><p>Broad experience in power supply systems development and design engineering.</p></li></ul><p></p><p> <b><u><span>Desired Skills</span></u></b></p><ul><li><p>Experience with design of high voltage DC-DC power converters</p></li><li><p>Computer and analytical skills necessary for power and analog circuit design (Spice tools)</p></li><li><p>Have experience with printed circuit board programs (OrCAD, Altium Designer), and experience with taking circuit designs through analysis, design, build, and test</p></li><li><p>Good communication skills</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$97,968 - $122,824<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Power-Electronics-Design-Engineer-II_R4629",
    "jobReqId": "R4629",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 19 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-09",
    "timeType": "Full time",
    "title": "Power Electronics Design Engineer II"
  },
  "userAuthenticated": false
}
