{
  "jobPostingInfo": {
    "id": "5ccfa482bd54100153f99af84af70000",
    "title": "GDS System Engineering Support - Near Earth (L3)",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>Will be a member of the Near Earth Ground Data System (GDS) Engineering Group (394J) within the Mission System Engineering Section (394) and will report administratively to the 394J Technical Group Supervisor.</p><p>Will function as a GDS System Engineer supporting JPL Flight Projects with an emphasis on Near-Earth Systems. Will ensure that system requirements are implemented and operable. Will produce system architecture designs, organize reviews, coordinate product implementation, testing, and deployment, and provide support for maintenance of the delivered system. Will be responsible for tracking of project task and incident items, compliance with institutional and project requirements (Security, patching, etc), management of schedule and task-related risks, as well as providing status for reviews and management on a scheduled basis.</p><p></p><p><b>Qualifications:</b></p><p>Requires a Bachelor&#39;s degree in Computer Science, Software Engineering, Systems Engineering or Information Technology with a minimum of 6 years of related experience; Master&#39;s degree with a minimum of 4 years of related experience; or PhD with a minimum of 2 years of related experience.</p><ul><li>Very strong ability to bridge gaps between desired software requirements and the underlying data structures, process flows, and intermediate capabilities needed to implement them.</li><li>Demonstrated motivation to apply experience across domains and implement creative solutions that are cost-effective and performative.</li><li>Strong interpersonal and verbal written skills. It is not sufficient to understand a concept; candidates must also be able to explain that concept at multiple levels of understanding.</li><li>Experience collaborating with space system services and organizations such as the DSN, the NEN, KSAT, AWS Ground Station or JPL Service organizations that provide support to Flight Projects – ITSD, MGSS, and other facilities or software development organizations.</li></ul><p></p><p><b>Desired Skills:</b></p><ul><li>Experience with flight projects in both pre- and post-launch phases.</li><li>Broad knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</li><li>Demonstrated understanding of JPL GDS software systems (or industry equivalent), both service-provided and project-implemented.</li><li>Exposure to leadership roles with small to medium-sized implementation teams.</li><li>Experience with cloud-provided software, virtual hardware, and services.</li><li>Curiosity and motivation to improve existing systems!</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$124,384 - $155,688<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-18",
    "timeType": "Full time",
    "jobReqId": "R3762",
    "jobPostingId": "GDS-System-Engineering-Support---Near-Earth--L3-_R3762",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/GDS-System-Engineering-Support---Near-Earth--L3-_R3762"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Software Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-III_R4050-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 11 Days Ago",
      "startDate": "2023-03-03"
    },
    {
      "title": "Software Systems Engineer III - TS/SCI",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-III---TS-SCI_R3194",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-30"
    },
    {
      "title": "Software Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-III_R3798",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-20"
    }
  ],
  "userAuthenticated": false
}
