{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Thermal-Engineer-III_R4490",
    "id": "731ce68d6c0b1001cf06c4a822c70000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p></p><p>This unique opportunity is part of the <b>Mechanical Systems Engineering, Fabrication and Test Division</b> which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breath of mechanical disciplines and is applied from architectural concept development through operations.</p><p></p><p>As a <b>Thermal Engineer III</b><i>, </i>you will be working for JPL&#39;s <b>Propulsion, Thermal and Materials Engineering Section</b> (353) which provides leadership and unique world-class expertise in a wide range of technologies and technical discipline areas of chemical and electrical propulsion, thermal, materials, contamination control, analytical chemistry, geochemical instruments, physics-based modeling, and multiphase flow.</p><p></p><p>The successful candidate is expected to:</p><ul><li>Provide sustained thermal engineering support as the lead and/or support engineer for a flight project or instrument, for all phases of development.Activities include: identify thermal architecture and create a viable thermal design, establish interface and requirement definitions, perform system level thermal trade studies and analyses, build and test the hardware, conduct flight operations, and support proposal and advanced studies.</li></ul><p></p><p>The candidate would be responsible to:</p><ul><li>Perform the system level thermal design and analysis of spacecraft and space-based instruments applying the best practices, latest research, and incorporating qualified technologies. Designs include hardware and control systems to manage system temperatures within safe operating ranges through the use of radiation, conduction, convection, single- and two-phase heat transfer methods.</li><li>Identify robust thermal designs, conduct system level trade studies, and establish thermal requirements, hardware specifications, and installation instructions.</li><li>Quantify required thermal system resources and partner with other subsystem engineers to establish interface agreements.</li><li>Conduct complex design and thermal analyses to show acceptable margins for bounding nominal and fault mission conditions. Analyses include closed-form analytical methods as well as computational methods. </li><li>Support implementation of thermal control designs through the selection and procurement of thermal hardware, oversight of hardware fabrication, and integration of hardware into larger assemblies.</li><li>Plan, conduct, and support thermal testing of spacecraft, instruments, subsystems and components including pre- and post-test thermal analyses, test plans/procedures, and test reports to validate the flight system design and flight readiness.</li><li>Prepare for technical design and test review presentations and close review action items.</li><li>Support mission operations for flight instruments, payloads, landers, rovers, or spacecraft. Perform daily health checks and review planned uplink sequences. Run and modify thermal models to compare with flight telemetry.</li><li>Maintain cognizance of and be responsible for all technical and programmatic aspects of the thermal system being developed, and to report on the status and performance to the appropriate organizations.</li><li>Contribute to the mentorship and training of junior technical team members</li><li>Work independently and under the direction of the group supervisor, project management, and project technical leads.</li></ul><p></p><p><b>Required Qualifications:</b></p><ul><li>Typically requires bachelor’s degree in Mechanical Engineering (or similar disciplines with a Thermal focus) with a minimum of 6 years of related experience; Master’s degree with 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years related experience.</li><li>Demonstrated experience and advanced knowledge in thermal systems, design, analysis, and hardware verification.</li><li>Working experience with thermal and mechanical computer aided design tools, particularly Thermal Desktop.</li><li>Must have general understanding and application of standard principles, theories, concepts and techniques in heat transfer (especially fundamental radiation heat-transfer principles) and thermal engineering.</li></ul><p><b>Desired Skills:</b></p><ul><li>Thermal-fluids and/or space engineering experience, particularly with flight instruments or spacecraft.</li><li>Experience in preparation and presenting at major gateway reviews (such as PDR, CDR, or SIR), as well as experience with Manufacturing Readiness Reviews (MRRs), TRRs, and table top/peer reviews.</li><li>Working knowledge of typical instrumentation and ground support equipment used in thermal tests and/or thermal environments across the solar system for flight system development.</li><li>Software experience: Thermal (Thermal Desktop or equivalent), mechanical CAD (NX, AutoCAD, SolidWorks) and Matlab or LabView expertise.</li><li>Working experience with natural and forced convection, linear conduction, radiation and numerical algorithms.</li><li>Experience with manufacturing methods involved with thermal fluids systems such as welding and bending techniques, leak tests and inspection techniques for pressure vessels, filling processes and refrigerant handling.</li><li>Experience writing procedures, releasing drawings, procurements, and negotiating / implementing cross-domain interfaces, including working with outside vendors / collaborators.</li><li>Knowledge of Jet Propulsion Laboratory Flight Project Practices, Design Principles, hardware quality, and engineering documentation standards. </li></ul><p>Excellent verbal, written, and interpersonal skills.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$122,096 - $154,336<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Thermal-Engineer-III_R4490",
    "jobReqId": "R4490",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 18 Days Ago",
    "startDate": "2023-06-29",
    "timeType": "Full time",
    "title": "Thermal Engineer III"
  },
  "userAuthenticated": false
}
