{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Travel-Counselor_R4778",
    "id": "ddf0e796efd91000cb6113c6c57b0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>The Travel and Invoice Management Section</b> is seeking an experienced and motivated<b> Travel Counselor </b>.  This position will provide general day-to-day support in administrating various travel reservations functions.  As a <b>Travel Counselor</b>, you will play a pivotal role in providing exceptional travel planning and advisory services to JPL employees. Leveraging extensive industry knowledge and experience, will guide colleagues through the intricacies of travel arrangements in compliance to the Prime Contract and JPL Travel Policy. Expertise will be essential in offering insightful recommendations and resolving any potential travel-related challenges.  Attention to detail, excellent communication skills, critical thinking, problem solving, and a customer-centric approach will contribute to the continued success of Travel Reservations.</p><p>This<b> Travel Counselor</b> will<b> </b>report to the Group Supervisor, Travel Reservations and be part of a team that is a key control point of the Lab’s compliance to travel policy. </p><p></p><p><b><u>Specific responsibilities include:</u></b></p><ul><li><p>Coordinate and arrange business travel plans for JPL employees.</p></li><li><p>Ensure accurate, compliant, cost effective and timely bookings that encompass flights, accommodations, ground transportation and other travel related services.  </p></li><li><p>Understand traveler needs &amp; requirements to properly document support for over per diem lodging justifications.</p></li><li><p>Effectively negotiate with hotel/event properties to minimize financial risk to JPL.</p></li><li><p>Answer questions relating to travel policies and procedures and provide guidance on where to find additional resources specific to inquiries. </p></li><li><p>Build and strengthen customer relationships by maintaining clear and responsive communication with staff assistants/travelers throughout the booking process. Promptly address inquiries, provide updates, and offer alternative solutions as needed.</p></li><li><p>Safeguard discreet traveler data and information.</p></li><li><p>Proficient in resolving unexpected travel issues and providing prompt solutions. </p></li><li><p>Works on difficult and complex assignments; resolves issues in a timely manner and to completion and makes informed business decisions.</p></li><li><p>Collaborate with fellow travel agents to deliver a cohesive and exceptional customer experience.</p></li><li><p>Applies applicable policies, procedures, and practices to resolve a variety of complex issues to resolution.</p></li><li><p>Partner with Protective Services to ensure Duty of Care responsibilities are met.</p></li><li><p>Perform ad hoc duties as assigned.</p></li></ul><p></p><p><b><u>Qualifications:</u></b></p><ul><li><p>Bachelor’s degree in Business Administration with a minimum of 1 year of related experience or an Associate degree in a similar discipline with a minimum of 4 years of related experience or a High School Diploma with a minimum of 8 years of related experience.</p></li><li><p>Fundamental working knowledge of the travel process and policy.</p></li><li><p>Excellent oral and written communication skills.  Ability to clearly articulate travel policy and the rationale behind the policies.  Ability to diplomatically inform travelers if their travel plans are non-compliant and suggest alternatives.</p></li><li><p>Working knowledge of the Global Distribution Systems (GDS), preferably either Apollo or Galileo. </p></li><li><p>Understanding of the interfaces with the GDS, Concur and Enterprise systems.</p></li><li><p>Self-starter that thrives working independently and in a team environment. </p></li><li><p>Intellectually curious. The ideal candidate takes initiative and ownership of their work and possesses an improvement mentality.</p></li><li><p>Proficiency in the Microsoft Office Suite of applications (Word, Excel, PowerPoint, Outlook).</p></li><li><p>An understanding of travel tools such as Concur Request, Concur Booking and Concur Expense.</p></li><li><p>Comfortable maximizing IT solutions to improve efficiencies.</p></li><li><p>Dedication to exceeding expectations and delivering unparalleled service.</p></li></ul><p></p><p><b><u>Desired skills:</u></b></p><ul><li><p>Working knowledge of government travel rules and regulations.</p></li><li><p>A critical thinker, curious, and pro-active.</p></li><li><p>Ability to plan, prioritize and complete multiple assignments independently.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$69,680 - $87,256<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Travel-Counselor_R4778",
    "jobReqId": "R4778",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 16 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-09-18",
    "timeType": "Full time",
    "title": "Travel Counselor"
  },
  "userAuthenticated": false
}
