{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Spacecraft-Systems-Structural-Analysis-Lead_R4581",
    "id": "bbc5223b63e61000d9e6fb1333980000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Mechanical Systems Engineering, Fabrication &amp; Test Division - the place where spacecraft are born! We engage in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems from architectural concept through operations.  </p><p></p><p>We lead the mechanical development and implementation of flight hardware and technology for NASA&#39;s robotic space missions as part of the Engineering and Science Directorate.  Our expertise spans the full breadth of mechanical subject areas.  </p><p></p><p>Members of this team investigate, plan, design and develop mechanical products and systems such as spacecraft, instruments, robots, packaged electronics, controls, engines, and machines, and mechanical, thermal, hydraulic, propulsion, or heat transfer systems for the production, transmission, measurement, and use of energy. They maintain cognizance of and are responsible for all technical and programmatic aspects of the product being developed, reporting the status and performance to the appropriate organizations.  Teams apply research to the planning, design, development, and testing of mechanical and/or electromechanical systems, instruments, controls, engines, and/or machines.</p><p></p><p>As the <span><span>Spacecraft Systems Structural Analysis Lead, you</span></span> will be working for JPL&#39;s Payload and Small Spacecraft Mechanical Engineering Section that is responsible for the structures, mechanisms, and mechanical systems engineering of payloads and small spacecraft across all phases of the mission lifecycle. To support this team, you will be working for the Dynamics and Structures Group, which is a diverse group responsible for structural integrity, analysis, and qualification of small spacecraft, payload, instrument structures and mechanisms. In this role you will do the following:</p><p><br />* Lead a multi-disciplinary structural analysis team to ensure the structural integrity of space flight and airborne instrument hardware, as well as associated support hardware in an end-to-end manner to ensure that the total system satisfies the customer&#39;s requirements, expectations, and constraints within the allocated resources and with acceptable risk.<br />* Lead structural analysis finite element modeling, detailed stress analysis, dynamic analysis, and test support for flight projects and/or technology tasks and/or architecture and proposal development.<br />* Lead analysis, monitor &amp; conduct testing, and develop test reports for static &amp; dynamic testing of hardware.<br />* Oversee the building of finite element models from scratch, using hand-calcs when appropriate, to determine critical areas in structure and determine efficient and adequate approaches for analysis independently.<br />* Provide suggestions and feedback to cognizant engineers and designers on areas of concern based on analysis, mechanical intuition, and experience.<br />* Present analysis results to cognizant engineers, project teams, project managers.<br />* Lead the design process of highly sophisticated and critical mechanical assemblies of significant impact from engineering requirements.<br />* Review drawings for critical features relevant to structural analysis.<br />* Oversee highly complex and critical design, analysis, validation, and verification testing of mechanical assemblies.<br />* Derive and document highly complex and critical design requirements.<br />* Review analyses for accuracy and completeness.<br />* Communicate clearly within a diverse multi-disciplinary team.</p><p></p><p><b>Required Skills</b><br />* Bachelor’s degree in Civil Engineering, Mechanical Engineering, Aerospace Engineering, Acoustics or related technical subject area with a minimum of 9 years of related experience; or a Master’s degree in similar subject areas with a minimum of 7 years of related experience; or PhD in similar subject areas with a minimum of 5 years related experience.<br />* Extensive experience completing structural analyses of complex and unique flight mechanical systems and detailed analyses of components.<br />* Extensive experience presenting structural margins &amp; analyses.<br />* Ability to provide design suggestions and feedback.<br />* Ability to develop and conduct structural verification test programs for flight hardware.<br />* Ability to troubleshoot mechanical, mechanism, and/or structural anomalies and failures.</p><p></p><p><b>Desired Skills</b><br />* Experience in managing a diverse multi-disciplinary team with varying technical skills.</p><p>* Advanced knowledge in structural engineering, analysis, and verification of space flight structures (spacecraft or instruments), mechanisms, and/or opto-mechanical assemblies.<br />* Experience in MSC/NX NASTRAN, FEMAP, MSC Adams, Abaqus, LS-Dyna, MSC Marc, and/or Hyperworks.<br />* Understanding and wide experience applying advanced principles, theories, concepts and techniques in structural and/or dynamic analysis resulting in contributions to the development of theories and/or methods.<br />* Ability to develop innovative design solutions for existing problems to enable requirements or mechanical performance to be met.<br />* Recognized expert in the field of structural analysis or dynamics.<br />* Knowledge of Laboratory policies and procedures, proposal and funding processes, NASA policies and procedures, and government regulations across a range of applications.<br />* Solid understanding of flight project practices and JPL flight hardware design principles.</p><p>* Experience in applying new concepts to flight applications.</p><p>* Familiarity with NASA and other government agencies and their relevant capabilities.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$143,312 - $183,248<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Spacecraft-Systems-Structural-Analysis-Lead_R4581",
    "jobReqId": "R4581",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 9 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-14",
    "timeType": "Full time",
    "title": "Spacecraft Systems Structural Analysis Lead"
  },
  "userAuthenticated": false
}
