{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Public-Engagement-Specialist--Universe_R3832",
    "id": "e89318f96b8e1000d67992c2d3e00000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>As part of the Universe Public Engagement group, you will work with the Universe Public Engagement Manager and Public Engagement team to support the development and production of exoplanet and astrophysics content and products, public events, websites, and social media. You will work with multiple teams of professional communicators and scientists to engage the imaginations and interests of the public through creative storytelling about NASA’s astrophysics and exoplanet exploration efforts. </span></p><p></p><p>Responsibilities: <span>In support of the Public Engagement Section, you will perform the following duties as a member of the Universe Public Engagement team:</span></p><p></p><p><span>Content Development &amp; Production:</span></p><ul><li><p><span>Develop and produce strategic and creative plans, campaigns, and products around NASA exoplanet content across a variety of digital and physical media.</span></p></li><li><p><span>Manage, edit, organize and implement the presentation of digital content through a wide variety of technologies using software for graphics, animation, text, multimedia, dynamic and/or interactive content presentation.</span></p></li><li><p><span>Contribute to web and social content, to include Facebook, Twitter, Instagram and other social media platforms.</span></p></li><li><p><span>Will find innovative ideas for exhibits (both internal to JPL and external) that spark imagination and leverage our missions’ science goals, themes, and content.</span></p></li></ul><p></p><p><span>Event Exhibit Planning and Execution:</span></p><ul><li><p><span>Support end to end creation of exhibits, models and products including concepts, inventory management and storage requirements.</span></p></li><li><p><span>Coordinate event planning/execution and product dissemination (may include packing and shipping of materials, printing and storing of physical products, including maintenance of inventory and storage).</span></p></li><li><p><span>Represent JPL/NASA communication initiatives at professional conferences when necessary, including presenting papers and posters as a professional communicator.</span></p></li><li><p><span>Ideate and suggest creative new approaches to public engagement experiences, both physical and virtual.</span></p></li></ul><p></p><p><span>Teamwork and Collaboration:</span></p><ul><li><p><span>Work with the Universe Public Engagement team to brainstorm new content, product ideas, and messaging campaigns.</span></p></li><li><p><span>Support strategic communications planning and use innovative ideas to shape and improve public engagement products, programs, and our digital footprint.</span></p></li><li><p><span>Research industry best practices and provide ongoing improvements to public engagement programs and products.</span></p></li></ul><p></p><p><span>Customer Service and Stakeholder Engagement:</span></p><ul><li><p><span>Serve as primary point person, liaising with exoplanet stakeholders on public engagement efforts.</span></p></li><li><p><span>Use metrics to develop reports on project milestones and program impacts, and make informed suggestions for improvements.</span></p></li><li><p><span>Attend project and program meetings regularly and report (both verbally and in writing) on public engagement efforts.</span></p></li><li><p><span>Network and develop relationships with stakeholders and partners at JPL, NASA, and externally.</span></p></li></ul><p></p><p>Required Qualifications:</p><ul><li><p><b><span>Bachelors with 6 years of related experience; Masters with 4 years of related experience; PhD with 2 years of related experience. A degree in communications, public administration, business development/management, science/technology, marketing, or similar degree.  </span></b></p></li><li><p><span>Professional demeanor.</span></p></li><li><p><span>Strong written and verbal communication skills.</span></p></li><li><p><span>Punctual, detail oriented, resourceful and self-motivated.</span></p></li><li><p><span>Demonstrated experience in stakeholder management.</span></p></li><li><p><span>A combination of creativity and strong organizational abilities.</span></p></li><li><p><span>A team player who can work independently, with the ability to break down projects into smaller tasks, then execute the plan, communicating updates to the larger team throughout the process.</span></p></li><li><p><span>Experience working on communications products intended for diverse public audiences.</span></p></li><li><p><span>Experience with art directing and producing multimedia products, including video, imagery, audio and graphics.</span></p></li><li><p><span>Experience developing communications key performance indicators (KPIs), then tracking, improving, and speaking to the impact of those results.</span></p></li></ul><p></p><p><span>Preferred Qualifications:</span></p><ul><li><p><span>Demonstrated experience in developing collaborations across a diverse set of communications teams leading to innovative outcomes and products.</span></p></li><li><p><span>Awareness of social media best practices; plus if experience developing and implementing social media campaigns.</span></p></li><li><p><span>Comfortable working in technical environments and interacting with scientists and engineers to translate their work to publicly-accessible content.</span></p></li><li><p><span>Working knowledge of Adobe Creative Suite. </span></p></li><li><p><span>Ability to use style guides to create new web based graphics.</span></p></li><li><p><span>Basic knowledge of astronomy and/or exoplanet science.</span></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$97,552 - $119,392<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Public-Engagement-Specialist--Universe_R3832",
    "jobReqId": "R3832",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 12 Days Ago",
    "startDate": "2023-04-20",
    "timeType": "Full time",
    "title": "Public Engagement Specialist, Universe"
  },
  "userAuthenticated": false
}
