{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Enterprise-Implementation-Academic-Part-Time-Graduate-Intern_R4624",
    "id": "cae64fcd52b110010e34e6bf03f70000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Key Responsibilities:</b></p><p>This position is responsible for supporting the Enterprise 2.0 Implementation Office (E2IO) as part of a small team. The position will primarily aid in the following areas:</p><ul><li>Performs routine configuration of E2.0 systems; adds, removes and updates user account and access information; answers routine technical queries and troubleshoots basic problems.</li><li>Reviews, edits, and contributes to documentation generated for and by the office.</li><li>Assists project managers with routine activities such as Review Preparation, minor schedule updates, and M365 configurations.</li><li>Develops basic reports using off-the-shelf reporting tools.</li><li>Documents office procedures and practices.</li><li>Assists in the migration and configuration of documents and data to an updated, industry standard project management environment (Microsoft Project Online and M365).</li></ul><p></p><p><b><u>Required Skills: </u></b></p><ul><li>Must be currently enrolled at an accredited local college or university pursuing a Master&#39;s degree in Computer Engineering, Systems Engineering or related discipline with a graduation date of December 2023 or later.</li><li>Minimum 3.0 GPA</li><li>Typically requires moderate understanding of project management processes and practices.</li><li>Ability to learn and use project management software including Microsoft Project Online, MS SharePoint M365, and MS Teams.</li></ul><ul><li>Basic understanding of web-site design using standard Microsoft online tools.</li><li>Experience with managing data and documentation in an electronic repository.</li><li>Ability to create standard and graphical reports from Excel or similar technology.</li></ul><p></p><p><b><u>Desired Skills: </u></b></p><ul><li>Experience with Microsoft Project.</li><li>Experience configuring MS Project Web Access (PWA)</li><li>Experience with Microsoft M365 tools – especially<ul><li>SharePoint</li><li>Teams</li><li>PowerBI</li><li>Power-Automate</li></ul></li><li>Self-Motivated. Takes responsibility and ownership of work.</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $36 in year 1, $38 in year 2, $41 in year 3, $43 in year 4</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Enterprise-Implementation-Academic-Part-Time-Graduate-Intern_R4624",
    "jobReqId": "R4624",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 6 Days Ago",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-01",
    "timeType": "Part time",
    "title": "Enterprise Implementation Academic Part-Time Graduate Intern"
  },
  "userAuthenticated": false
}
