{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Design-Director-and-Manager--JPL-DesignLab_R4352",
    "id": "7887ef81446a1000d4a2003eec950000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Responsibilities:</b></p><p>We are seeking an exceptional design director: a designer and leader to steer, elevate and inspire the DesignLab of a world-leading center in space exploration.</p><p></p><p>DesignLab encompasses graphic and web designers, illustrators, installation designers and visual strategists. The design director will set the creative direction of the team in service of space exploration, Earth science and public outreach. The director also will oversee the JPL brand: how we build employee-focused campaigns to foster a collaborative culture based upon the values of the Lab.</p><p>Inclusion is a core value at JPL. Because our mission attracts brilliant minds from all over the world, and from all backgrounds, you must be able to approach each individual and design challenge with an empathetic heart, an open mind, and a commitment to careful listening. The Lab depends on our Lab Engagement team – which encompasses DesignLab, internal communications, cultural strategy and history – to reflect the range of lived experiences among our approximately 10,000 colleagues. In particular, you must be able to demonstrate commitment to inclusion and accessibility both as a leader and a design practitioner.</p><p></p><p>In your role as Design Director, you will address these core questions:</p><ul><li><p>How can JPL use art and design to spark enthusiasm for space exploration and Earth science in wider audiences?</p></li><li><p>How can the Lab create a stronger brand and cohesive graphic and visual identity, internally and externally?</p></li><li><p>What unexplored synergies exist among the varied talents and aptitudes within DesignLab?</p></li><li><p>How should we better leverage outside culture through creative influencers and unique, unexpected partnerships?</p></li><li><p>How can you be a manager and a practitioner, someone who leads by example and whose leadership is exemplary?</p></li></ul><p></p><p><b>Qualifications:</b></p><ul><li><p>Typically requires a B<span>achelors in </span>Arts, Design or other related artistic discipline <span>with 9 years of related experience; Masters with 7 years of related experience; or PhD with 5 years of related experience</span></p></li><li><p><span>Minimum 2 years of leadership experience </span>in a design profession</p></li><li><p>A history of exceptional creative and/or branding work</p></li><li><p>Outstanding oral and written communication skills and ability to understand, structure and present complex information clearly to all audiences</p></li><li><p>Experience working in a large organization and collaborating with significant stakeholders, customers, influencers and service providers outside your unit</p></li><li><p>Advanced knowledge and understanding of principles, theories, concepts and techniques in graphic design, printing (offset and digital), publications design and production, and web design and UI/UX best practices</p></li><li><p>Strong typographical skills and interest</p></li><li><p>Experience with building internal and external brands, developing strategic plans and corporate style guides, and managing design processes and creative workflows</p></li><li><p>Proficiency in InDesign, Illustrator, Photoshop, Acrobat</p></li><li><p>Valued: Curiosity and passion for science and exploration.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$116,688 - $155,168<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Design-Director-and-Manager--JPL-DesignLab_R4352",
    "jobReqId": "R4352",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 11 Days Ago",
    "startDate": "2023-05-24",
    "timeType": "Full time",
    "title": "Design Director and Manager, JPL DesignLab"
  },
  "userAuthenticated": false
}
