{
  "jobPostingInfo": {
    "id": "7de9fca8ea3610016d711f0afc840000",
    "title": "Software Systems Engineer III - TS/SCI",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Overview:</b></p><p></p><p>Do you excel in an environment that values exploration and discovery? We have a universe of opportunities waiting for you!</p><p></p><p>The Jet Propulsion Laboratory (JPL) is NASA’s leading center for robotic exploration of the solar system. Our core competency is the end-to-end implementation of unprecedented robotic space missions to study Earth, the Solar System, and the Universe.</p><p></p><p>The Instrument Software and Science Data Systems Section (Section 398) within JPL consist of multidisciplinary teams of engineers and data scientists who provide expertise across the domains of instrument operations, science data systems, and science support.</p><p></p><p>Section 398 has the responsibility to:</p><ul><li>Deliver the Instrument Operations System (IOS) to an instrument team or flight mission.  The IOS is the integrated set of people, processes, procedures, software, hardware, and facilities with the capability to plan and command instrument observations, as well as control and monitor instrument performance.</li><li>Deliver the Science Data System (SDS) to an instrument team, flight mission, or science project. The SDS is the integrated set of software, hardware, facilities, people and procedures with the capability to process, manage, distribute, explore, and analyze scientific data.</li><li>Provide data science services that enable and support JPL scientific investigations and goals.</li><li>Provide science project management and science system engineering support to JPL and NASA programs and projects.</li><li>Provide software engineering and development support to instrument and science teams.</li></ul><p><b>Will Statement:</b></p><ul><li>Join the Architecture and Systems Engineering Group (398B) as a Software Systems Engineer.</li><li>Administratively and technically report to the 398B Technical Group Supervisor and programmatically to the Product Delivery Manager.</li><li>Work on classified tasks to develop software systems</li></ul><p><b>Responsibilities:</b></p><ul><li>Lead software system engineering tasks, such as defining use cases and requirements; supporting system design meetings; interfacing with customers; leading development teams; developing and conducting Integration and Test activities; deployment and operations; managing tasks; and reporting to management.</li><li>Interface with multidisciplinary teams across science, engineering, and hardware</li><li>Lead the development of software systems which utilize algorithms to process data</li><li>Software Development knowledge is required</li></ul><p><b>Qualifications:</b></p><ul><li>Bachelor&#39;s degree in Engineering, Physical Science, Computer Science, Information Systems, Mathematics, or related technical discipline with typically a minimum of 6 years of related experience; Master&#39;s degree in similar disciplines with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years related experience.</li><li>Active TS/SCI Clearance</li><li>Prior Software Development experience with Python, Java, or C/C&#43;&#43;</li><li>Experience in the following System Engineering areas:<ul><li>Use Case/Requirements Development</li><li>Trade Studies</li><li>Task Management</li><li>Configuration Management</li><li>Verification and Validation (V&amp;V)</li><li>Operations and Maintenance</li></ul></li></ul><ul><li>Ability to deal with multiple issues, tasks and priorities concurrently</li><li>Ability to interact effectively across multiple disciplines: Software, Hardware, Engineering, &amp; Science</li><li>Excellent communicator both orally and written.</li></ul><p></p><p><b>Desired Skills:</b></p><ul><li>Agile development, devOps, CI/CD</li><li>Respected Team leader, Consensus builder, Good listener, Accountable - Owns the problem, Self-reflective, Passionate about helping others, Shares the successes &amp; Accepts the blame.</li></ul><p></p><p>NOTE: Must be a U.S. Citizen with an active TS/SCI clearance – Top Secret (TS) clearance based upon Single Scope Background Investigation (SSBI) within 5-year scope and approved for Sensitive Compartmented Information (SCI) accesses.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$124,384 - $155,688<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-30",
    "timeType": "Full time",
    "jobReqId": "R3194",
    "jobPostingId": "Software-Systems-Engineer-III---TS-SCI_R3194",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-Systems-Engineer-III---TS-SCI_R3194"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Software Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-III_R4050-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 9 Days Ago",
      "startDate": "2023-03-03"
    },
    {
      "title": "Software Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-III_R3798",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-20"
    },
    {
      "title": "GDS System Engineering Support - Near Earth (L3)",
      "externalPath": "/job/JPL-Campus/GDS-System-Engineering-Support---Near-Earth--L3-_R3762",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-18"
    }
  ],
  "userAuthenticated": false
}
