{
  "jobPostingInfo": {
    "id": "5ccfa482bd541001ee558fd048ce0000",
    "title": "Software Systems Engineer III",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This Software Systems Engineer (SE) shall be a member of the JPL 172M Collaboration and Engineering Platform Development and Analysis group, reporting to the Group Supervisor. The Software Systems Engineer shall provide technical, functional, and engineering support for collaborative document management platforms and software development efforts. The analyst will receive work instructions from the line management, product leads, and sponsors responsible for the platforms and websites.  </p><p>-Implementing software solutions that may be commercial off-the-shelf or internally developed.</p><p>-Interface with process owners and team members, evaluate business processes, gather requirements, and translate the requirements into system specifications.</p><p>-Collaborate with development team members and operations to ensure successful platform and software deliveries.</p><p>-Provide testing support, perform validation and verifications and provide assistance for product demos, user workshops, training of users, and coordination of user acceptance sessions.</p><p>-Work in conjunction with other functional and technical teams for the successful implementation and operations of various platforms and sites.</p><p>-Serving as a liaison to the customer throughout the entire system life cycle; advising customers and management.</p><p>-Manage and lead software delivery projects and ongoing maintenance.</p><p>-Other duties as assigned</p><p></p><p>Required Skills: </p><p>-Applicant must be a US citizen</p><p>-Requires a Bachelor’s degree in Information Science, Computer Science, Computer Engineering, Electrical Engineering, Mechanical Engineering, or related a discipline with a minimum of 6 years of related experience; Masters degree in similar disciplines with a minimum of 4 years of related experience; or PhD in similar disciplines with a minimum of 2 years related experience.</p><p>-Advanced knowledge in one or more of the following areas: Software Project Management, Enterprise Content Management, Custom Software Support, System Configuration Management, Implementation/Support, and Business Process Analysis Expertise.</p><p>-Extensive understanding and wide application of advanced principles, theories, concepts and techniques in: Project Management, Data Management, Requirements Gathering, User Acceptance, Software Quality Assurance, Data Access Management, Software Implementation, and User/Customer Support.</p><p>-Extensive working experience and expertise managing applications including hardware/software architecture, planning, configuration, deployment, implementation, technical support, and operations of Software Applications. Plus, a proven ability of providing functional and technical deliverables such as, requirements, training material, helpdesk documents, test cases and test scripts.</p><p>-Previous experience must include the ability to effectively interface with users providing training and technical support. Plus, must have experience working on dynamic teams composed of product leads, project managers, system engineers, solution architects, developers, and operations.</p><p>-Excellent communication skills, written and verbal, must be capable of effectively capturing and transferring technical and functional information at all JPL Level’s.   Must have the ability to develop and conduct product demos, user workshops, joint design sessions, training, and user acceptance sessions.</p><p>-Excellent leadership skills, capable of guiding, directing and training, software developers, system administrators, system engineers, software quality assurance, other Systems Engineers, functional users, and management.</p><p></p><p>Desired Skills: </p><p>-Advanced knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</p><p>-Experienced at project management and team leadership.</p><p>-Experienced at requirements gathering, design, development and gap analysis.</p><p>-Capable of managing team task and requirements in JIRA.</p><p>-Reporting and data analysis.</p><p>-Experience managing and supporting Alfresco installations</p><p>-Experience developing workflows in Alfresco</p><p>-Experience developing and providing user training for Alfresco</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$124,384 - $155,688<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-20",
    "timeType": "Full time",
    "jobReqId": "R3798",
    "jobPostingId": "Software-Systems-Engineer-III_R3798",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Software-Systems-Engineer-III_R3798"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [
    {
      "title": "Software Systems Engineer III",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-III_R4050-1",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 16 Days Ago",
      "startDate": "2023-03-03"
    },
    {
      "title": "Software Systems Engineer III - TS/SCI",
      "externalPath": "/job/JPL-Campus/Software-Systems-Engineer-III---TS-SCI_R3194",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-30"
    },
    {
      "title": "GDS System Engineering Support - Near Earth (L3)",
      "externalPath": "/job/JPL-Campus/GDS-System-Engineering-Support---Near-Earth--L3-_R3762",
      "timeType": "Full time",
      "locationsText": "JPL Campus",
      "postedOn": "Posted 30+ Days Ago",
      "startDate": "2023-01-18"
    }
  ],
  "userAuthenticated": false
}
