{
  "jobPostingInfo": {
    "id": "e89318f96b8e1000d487c7dc25730000",
    "title": "Benefits Specialist IV  (Wellness)",
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>We are seeking a results-oriented <b><span>Benefit Specialist IV </span></b>who will <b>lead all aspects of JPL&#39;s Wellness benefit programs and benefits communications</b>. Working in conjunction with the <span>Head of Benefits</span>, other Benefits CoE team members, People Services, Communications, and the Caltech Benefits staff, the Benefit Specialist IV will ensure the wellness programs support employees in achieving their wellness goals as well as operate in compliance with applicable laws. The ideal candidate must have strong written and verbal communications skills, strong project management and be able to demonstrate follow-through and is capable of handling simultaneous goals.</span></p><p><span> </span></p><p><span>In addition, they must have detailed knowledge of the IRS, ERISA and other regulatory environments under which wellness and benefit programs operate and are skilled at researching and implementing policies and procedures.</span></p><p><span> </span></p><p><b><span>Tasks include but not limited to:</span></b></p><ul><li><p><span>Works with Head of Benefits to design and implement wellness strategy and programs.</span></p></li><li><p><span>Oversees wellness plan administration and responds to complex customer service inquiries.</span></p></li><li><p><span>Designs and implements comprehensive communications plan to educate employees on wellness initiatives as well as other Benefits programs.</span></p></li><li><p><span>Works in collaboration with Caltech to ensure consistent communication, administration, interpretation, and implementation of the joint plan provisions and in accordance with the NASA Prime Contract.</span></p></li><li><p><span>Provides ongoing training of the service center staff, oversight of certain open enrollment processes, including communications, analysis and reporting, and maintaining intranet benefits content.</span></p></li><li><p><span>Responsible for vendor management, and taking the lead on implementation on wellness projects.</span></p></li><li><p><span>Conducts data analysis for preparation of and following open enrollment, and participation in strategic review of plan provisions and updates.</span></p></li></ul><p><span> </span></p><p><b><span>Qualifications:</span></b></p><ul><li><p><b><span>Bachelor’s degree in HR or equivalent with 9 years of related experience in employee Benefit Administration with an emphasis on wellness programs; Masters in a similar discipline with 7 years of related experience; Ph.D. in a similar discipline with 5 years of related experience.</span></b></p></li><li><p><span>Experience designing, implementing and maintaining wellness programs</span></p></li><li><p><span>Must have in-depth knowledge and application of IRS and ERISA associated benefit plan regulations</span></p></li><li><p><span>Ability to influence and adapt style to consult with all levels of employee and management</span></p></li><li><p><span>Ability to work effectively and well within the JPL culture (effectively gather and analyze facts, weigh risks and make <span><span>decisions/recommendations</span></span> that are right for the business, the people and our culture)</span></p></li><li><p><span>Ability to perform extensive data analysis, troubleshooting, creative problem resolution, diagnostics and process improvement.</span></p></li><li><p><span>Highly organized with strong self and project management skills (time, priorities, resources)</span></p></li><li><p><span>Excellent problem-solving, critical thinking, reasoning and analytical skills</span></p></li><li><p><span>Excellent writing and editing skills</span></p></li><li><p><span>Effective team player</span></p></li><li><p><span>Strong interpersonal and communication skills</span></p></li><li><p><span>Ability to work effectively in situations that require sound decision-making</span></p></li><li><p><span>Establishes trust and maintains confidentiality.</span></p></li></ul><p><span> </span></p><p><b><span>Preferred Skills:</span></b></p><ul><li><p><span>Proficient in MS Excel (formulas for analytics)</span></p></li><li><p><span>Excellent communication skills</span></p></li><li><p><span>Knowledgeable on wellness plans</span></p></li><li><p><span>Knowledgeable on health and welfare plans</span><span><span><span> </span></span></span></p></li><li><p><span>Knowledgeable on retirement plans is a plus</span></p></li><li><p><span>Work Day experience is a plus</span></p></li><li><p><span>CEBS certification is a plus</span></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$119,184 - $147,576<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "location": "JPL Campus",
    "postedOn": "Posted 30+ Days Ago",
    "startDate": "2023-01-30",
    "timeType": "Full time",
    "jobReqId": "R3743",
    "jobPostingId": "Benefits-Specialist-IV---Wellness-_R3743",
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "canApply": true,
    "posted": true,
    "includeResumeParsing": true,
    "jobRequisitionLocation": {
      "descriptor": "JPL Campus",
      "country": {
        "descriptor": "United States of America"
      }
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Benefits-Specialist-IV---Wellness-_R3743"
  },
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "similarJobs": [],
  "userAuthenticated": false
}
