{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Human-Resources-Manager--Leaves-of-Absence---Accommodations-_R3997",
    "id": "0b08aaf3158e10014eeb9c8378e20000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Unique opportunity to lead the <b>Leaves of Absence and Accommodation</b>s team at NASA’s Jet Propulsion Laboratory (JPL).  Reporting to the Head of Employee Relations in Human Resources, the <b>LOA and Accommodations Manager </b>combines their knowledge of the ADA, Leave of Absence and Workers’ Compensation regulations with effective process development, creative problem-solving and compassion to lead a team of dedicated professionals who facilitate the interactive process and administer leaves of absence and Workers’ Compensation claims for the employees of JPL.    </p><p></p><p><b>Specific responsibilities include (but are not limited to):</b></p><ul><li><p>Manage the operational approach, administration, and management for all leaves of absence and job accommodations, aligned with JPL culture</p></li><li><p>Ensure compliance with all federal and state regulations, including states outside of California, as well as company policies and practices</p></li><li><p>Manage complex accommodations and provide oversight to staff</p></li><li><p>Refine JPL’s interactive process to effectively partner with employees and management to facilitate a comprehensive and employee-focused accommodations process</p></li><li><p>Manage internal documents, letters, policies and other communications, as necessary, to ensure company compliance and drive clear and concise education of the leave programs</p></li><li><p>Ensure case files are appropriately documented and maintained to meet the demands of legal scrutiny  </p></li><li><p>Actively participate in initiatives to maintain and improve processes and collaborate effectively with all parties involved ensuring a strong culture of customer service</p></li><li><p>Participate in key policy reviews and recommend actions to help clarify and simplify procedures</p></li><li><p>Cultivate a strong client-oriented service rapport with other HR teams and other internal partners, that is based on a high level of collaboration and inclusion. Partnerships may be expected to include legal counsel, Payroll, Caltech HR, Facilities, and our external EAP and occupational health providers</p></li><li><p>Responsible for system upgrades and management of changes to tools utilized for administration of LOA plans and programs</p></li><li><p>May help to prepare and support effective agency responses (EEO, FEHA, etc)</p></li></ul><p></p><p><b>Requirements:</b></p><ul><li><p><b>Bachelor’s degree in Human Resources, Communications, Business or related field with 6&#43; years of related experience</b></p></li><li><p>Significant demonstrated experience leading all facets of leave administration and accommodations, including family and medical, parental, military, long term disability, and personal leaves of absence, as well as accommodations and the interactive process. </p></li><li><p>Ability to build rapport as a trusted neutral party</p></li><li><p>General understanding of employee benefits as they relate to leaves of absence, including short/long term disability, COBRA, ADA, FMLA, workers&#39; compensation, etc.</p></li><li><p>Highly organized with strong self and project management skills (time, priorities, resources)</p></li><li><p>Excellent problem-solving, critical thinking, reasoning and analytical skills</p></li><li><p>Agile learning skills</p></li><li><p>Ability to influence and adapt style to consult with all levels of employee and management</p></li><li><p>Ability to work effectively and well within the JPL culture (effectively gather and analyze facts, weigh risks and make decisions/recommendations that are right for the business, the people and our culture)</p></li><li><p>Excellent writing and editing skills</p></li><li><p>Ability to work well with individuals and teams across all levels of the organization</p></li><li><p>Strong interpersonal and communication skills</p></li><li><p>Ability to work effectively in situations that require sound decision-making</p></li><li><p>Ability to establish trust and maintain confidentiality </p></li></ul><p></p><p><b>Preferred Skills:</b></p><ul><li><p>Cross-functional / generalist human resources experience</p></li><li><p>Experience with predominantly exempt client groups</p></li><li><p>Experience working with clients in a technology field (engineers, researchers, etc.)</p></li><li><p>Familiarity with related employment laws; experience in Employee Relations a plus</p></li><li><p>Familiarity Workday</p></li><li><p>Experience with QCERA implementation and adoption</p></li><li><p>Familiarity with USERRA rules and out of state leave laws and benefits</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p></p>$124,592 - $163,176<p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">In addition, JPL is a VEVRAA Federal Contractor.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p style=\"text-align:left\"><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/designated_country_list_8-16-2019_tagged_0.pdf\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p>",
    "jobPostingId": "Human-Resources-Manager--Leaves-of-Absence---Accommodations-_R3997",
    "jobReqId": "R3997",
    "jobRequisitionLocation": {
      "country": {
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 28 Days Ago",
    "startDate": "2023-02-22",
    "timeType": "Full time",
    "title": "Human Resources Manager (Leaves of Absence & Accommodations)"
  },
  "userAuthenticated": false
}
