{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Technical-Designer-IV_R4444",
    "id": "bbec4f87682d1001b55f01342b4d0000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>This unique opportunity is part of the Mechanical Systems Engineering, Fabrication and Test Division which engages in research, technology development, and the creation of advanced mechanical, thermal, propulsion, and electronic packaging systems with expertise that spans the full breath of mechanical disciplines and is applied from architectural concept development through operations.</p><p></p><p>As a Technical Designer IV, you will be supporting the Electronic Manufacturing, Packaging, &amp; Technical Services Section, which provides engineering services that include the following: fabrication of electronics (boards and cables/harnesses), microelectronic and photonic hardware; electronic packaging, manufacturing engineering and electronic hardware thermal/structural analysis; advanced electronic packaging engineering, technology development and process engineering; technical facilities management and cleanroom services/certification; custom measurement systems development and instrumentation services; calibration services, test equipment loan pool and metrology engineering, and technical inventory management, cryogenics services and Flight Hardware Logistics Program (FHLP).</p><p></p><p><b><u>Responsibilities:</u></b></p><p></p><ul><li><p>Coordinate with product delivery lead, technical leads, and proposal / project management as required.</p></li><li><p>Participate in design teams to design, develop, fabricate, assemble, integrate and test space flight hardware, and ground hardware including support equipment for a variety of JPL missions.</p></li><li><p>Interface with packaging and manufacturing engineers, designers, analysts, machine shop, and project team.</p></li><li><p>Create complex subsystems and systems electro-mechanical designs and trade studies, designs of components, and modify existing designs to develop or improve products and facilitate design for manufacturability.</p></li><li><p>Utilize computer-aided design equipment and/or graphic tools.</p></li><li><p>Gather information, perform studies, solve equations, prepare layouts, sketches and detailed designs. </p></li><li><p>Coordinate design criteria such as ease of manufacture, availability of materials, and contractual specifications with others in engineering, material, and planning group.</p></li><li><p>Peer check team design products for Geometric Dimensioning and Tolerance (GD&amp;T) compliance.</p></li></ul><p></p><p><b><u>Qualifications:</u></b></p><p></p><ul><li><p>Typically requires a High School Diploma with a minimum of 10 years of related experience; Associates degree with a minimum of 6 years of related experience; or Bachelors with 3 years of related experience.</p></li><li><p>Extensive understanding and application of standard engineering principles, theories, concepts and techniques in mechanical systems including structures, configuration, mechanisms, structural analysis, and integration and test.</p></li><li><p>Ability to solve mechanical and packaging design problems, perform trade studies, develop design requirements, design piece parts and assemblies.</p></li><li><p>Extensive knowledge with computer aided design (CAD) tools especially recent versions of NX.</p></li><li><p>Extensive knowledge of American Society of Mechanical Engineers Y14.xx standards.</p></li><li><p>Extensive practical knowledge and skill in GD&amp;T.</p></li><li><p>Capable of working effectively in a team environment. Strong communication (oral, written, presentation) and organizational skills and ability to meet deadlines.</p></li></ul><p></p><p><b><u>Preferred Skills:</u></b></p><p></p><ul><li><p>General knowledge of applicable Laboratory policies and procedures, NASA policies and procedures, and government regulations.</p></li><li><p>Experienced with spacecraft flight hardware development and test.</p></li><li><p>Working knowledge of the JPL drawing release process and inspection reports.</p></li><li><p>Experienced with Printed Wiring Board (PWB) design tools such as Mentor or Altium.</p></li><li><p>Experienced with drawing checking.</p></li><li><p>Ability to work independently with minimal direction.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a href=\"https://www.jpl.jobs/benefits-perks\" target=\"_blank\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$103,688 - $136,032<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Technical-Designer-IV_R4444",
    "jobReqId": "R4444",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted 22 Days Ago",
    "startDate": "2023-06-15",
    "timeType": "Full time",
    "title": "Technical Designer IV"
  },
  "userAuthenticated": false
}
