{
  "hiringOrganization": {
    "name": "California Institute Of Technology Jet Propulsion Laboratory",
    "url": "https://www.jpl.nasa.gov/"
  },
  "jobPostingInfo": {
    "canApply": true,
    "country": {
      "descriptor": "United States of America",
      "id": "bc33aa3152ec42d4995f4791a106ed09"
    },
    "externalUrl": "https://citjpl.wd5.myworkdayjobs.com/Jobs/job/JPL-Campus/Physics-Undergraduate-Student_R4744",
    "id": "eedf8c71f1f1100172a0455659720000",
    "includeResumeParsing": true,
    "jobDescription": "<h1><b>Job Details</b></h1><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>With an unmatched history of creating groundbreaking advances in space science and technology, JPL has been in the space exploration business since the beginning. Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.</p><p></p><p>Our missions are complex, long-lasting, and far-reaching, and each one is unique. We’re constantly developing new mission-specific technologies. For engineers, researchers, scientists, and technologists who like to test the limits, JPL is a constant source of new stimulating challenges.</p><p></p><p>JPL is seeking highly motivated graduate students with intellectual curiosity to join our team and aid in our quest to ensure success. In this role, you would be a vital team member in a JPL group. You will partner with lead scientists and engineers to work on projects like JPL’s spacecraft, science instruments, mission control systems, the Deep Space Network, and science analysis pipelines.</p><p></p><p>The Tracking Systems and Application Section provides world-leading capability and expertise in a wide range of technologies that are critical to spacecraft tracking and related applications. The Section supports algorithm development, calibration, and validation of NASA’s satellite altimeter missions as well as NASA&#39;s deep-space missions by providing to the JPL navigators unique and extremely precise radiometric sources and data types. The Section provides the Deep Space Network (DSN) with precision atomic frequency and time references and distribution systems. The Section is responsible in delivering to JPL navigators a host of products that are required for deep space navigation such as celestial and terrestrial reference frame coordinates, Earth orientation parameters, and calibrations to account for the effects of the Earth&#39;s troposphere and ionosphere on radiofrequency metric tracking data-types.  The Section also performs extensive scientific investigations using its technologies in the areas of planetary dynamics, astrophysics, astrometry and radio astronomy, gravitational waves, geophysics, and fundamental physics.</p><p></p><p><b><u>Qualifications</u></b></p><p></p><ul><li>Students are typically enrolled at least half-time at an accredited college or university pursuing a Master’s, or PhD in Physics or other technical discipline related to work assignment.</li><li>Must be available to work a minimum of 8 hours per week, with a maximum of 30 hours per week during the academic school year.</li><li>Minimum cumulative GPA 3.0 out of 4.0 or equivalent</li><li>Recently completed coursework providing an understanding and application of standard principles, theories, concepts, and techniques in related work assignment</li><li>General knowledge of applicable industry and/or academic practices and standards in related work assignment</li><li>Relevant internship experience</li><li>Demonstrated leadership abilities</li><li>Good verbal and written communications skills with the ability to work in a team environment</li><li>Demonstrated ability to operate effectively with little oversight.</li></ul><p></p><p></p><p></p><p><b><u>Responsibilities:</u></b></p><p>We invite you to join the Tracking Systems and Application Section within the Deep Space Tracking Systems Group (DSTS) (335D) to serve as an <b>Academic Part Time Employee. </b>You will be reporting administratively to the Group Supervisor of the DSTS. As a member of the Tracking System and Applications Section you will be responsible for performing scientific research and engineering tasks within the area of VLBI and radiometrics.  Will assist in the support of the Deep Space Network’s Very Long Baseline Interferometry (VLBI) subsystems with responsibility for VLBI and radio astronomy development and implementation tasks in the DSN.  Will assist in the development of the software used to support the JPL Radio Reference catalog. The employee will conduct scientific research in the area of astrometry and geodesy, and assume a creative role in the ongoing international celestial reference frame.  Support radio transient algorithm development and research initiatives.   Publish scientific results in peer-reviewed literature.</p><p></p><p></p><p><b><u> Tasks Include</u></b></p><ul><li>Develops, debugs, tests, and optimizes complex research software pipelines and scripts</li><li>Applies scientific principles and methodology to analyzing experimental data.</li><li>Performs complex data analysis and/or fundamental research.</li><li>Designs and modifies experimental techniques, processes, and procedures.</li><li>Collaborates with researchers to initiate, write, and submit proposals and research papers.</li><li>Collaborates with researchers to develop presentation materials.</li><li>Contributes to publications (research reports/journals, articles, and presentations.)</li></ul><p></p><p><b><u>Preferred Skills:</u></b></p><ul><li>Background in experimental physics, radio science, and optical interferometry.</li><li>Experience in Radio Interferometry techniques and data-processing methods.</li><li>Ability to lead large software data processing development and support tasks that require contributions from a diverse community of scientists and engineers.</li><li>Hands-on experience with complex software subsystems supporting large experimental systems<b><u>.</u></b></li><li>Demonstrated ability to perform scientific and statistical analysis on very large data sets.</li><li>Strong computer skills and proficiency in Bash, Python, Perl, and C,/C</li><li>Demonstrated ability to develop data analysis software, develop effective visualization of the analysis, and interpret results from the analysis.</li></ul><p></p><p>The typical hourly rate for this job in Pasadena, California depending on education level is $36 in year 1, $38 in year 2, $41 in year 3, $43 in year 4</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">JPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">For further benefits information click <a target=\"_blank\" href=\"https://www.jpl.jobs/benefits-perks\">Benefits and Perks</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>The typical full time equivalent annual hiring range for this job in Pasadena, California.</span></p><p style=\"text-align:inherit\"></p>$0 - $0 see information above<p></p><p>JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.</p><p></p><p>In addition, JPL is a VEVRAA Federal Contractor.</p><p></p><p><a href=\"https://www.dol.gov/agencies/ofccp/posters\" target=\"_blank\">EEO is the Law.</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" target=\"_blank\">EEO is the Law Supplement</a></p><p><a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_English_unformattedESQA508c.pdf\" target=\"_blank\">Pay Transparency Nondiscrimination Provision</a></p><p></p><p>The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available <a href=\"https://www.nasa.gov/oiir/export-control\" target=\"_blank\">here</a>.</p><p></p>",
    "jobPostingId": "Physics-Undergraduate-Student_R4744",
    "jobReqId": "R4744",
    "jobRequisitionLocation": {
      "country": {
        "alpha2Code": "US",
        "descriptor": "United States of America"
      },
      "descriptor": "JPL Campus"
    },
    "location": "JPL Campus",
    "posted": true,
    "postedOn": "Posted Today",
    "questionnaireId": "886f1e7d19d501e9c467b82cbc01a93b",
    "startDate": "2023-08-30",
    "timeType": "Part time",
    "title": "Physics Graduate Student"
  },
  "userAuthenticated": false
}
